{"text": "Pryon Positions for Leadership in AI-Enhanced Knowledge Management With Funding and Talent Momentum. RALEIGH, N.C.--(BUSINESS WIRE)--Pryon, the artificial intelligence (AI) company founded by the inventors of the technologies behind today’s mainstream digital assistants used by hundreds of millions of people per day, announced today new leadership and funding that will bring the next generation of interactive knowledge management to the everyday work experience.Chris Mahl joined Pryon as President and Chief Revenue Officer to oversee corporate operations and drive growth strategies. Mahl brings an extensive background in enterprise sales leadership from Oracle, Informatica and Salesforce and a track record of bringing companies to profitability in more than a decade of advising startups and venture capital firms.On the heels of an equity financing round filed in September, Pryon also welcomed new board members and observers representing some of the industry’s leading venture capital funds, signaling continued confidence in the company’s trajectory. The round was supported with new investments by 3ig Ventures; Duke University Management Company (DUMAC); Gaingels; Micron Ventures; Piedmont Capital Partners; Private Ventures Group; Rex Health Ventures; Samuel J. Palmisano, Chairman of the Center for Global Enterprise and former Chairman and CEO of IBM; and Steel Perlot, with existing participation from BootstrapLabs, Breyer Capital, Good Growth Capital, Greycroft and Revolution’s Rise of the Rest.Incoming board members include Kirsten Wolberg, former executive with DocuSign, PayPal and Salesforce; Michelle Ritter, CEO of Steel Perlot, a management company incubating, investing in, and scaling companies in today’s most challenging technical industries; and Pryon’s Chris Mahl.“This is an incredible time for Pryon’s platform,” Ritter said. “Steel Perlot believes applied AI will increasingly transform business at scale. Pryon is applying machine learning and artificial intelligence to tackle a massive problem in workplace productivity and knowledge management. We invested in Pryon’s mission and team because we believe it has the technical depth, leadership, access, and product to become a category-defining company.”Palmisano said, “As businesses are accelerating their digital transformation, Pryon's AI technology addresses the critical need for organizations to translate massive volumes of legacy content into actionable knowledge.”Wolberg added, “Pryon has developed technology that fills a gap in the enterprise software stack. In my experience, what the company offers is critical for organizations who deal with large amounts of application or document-based data, or those who want to expand the capabilities of their virtual assistants. The sky is really the limit for how Pryon’s platform can be applied to provide a unique level of accuracy and speed to the management of enterprise knowledge. I look forward to being a part of their journey.”Pryon applies AI-based intelligent document processing (IDP) to augment unstructured data from disparate sources such as application knowledge bases, digital libraries and document stores. Using proprietary computer vision and natural language engines, the company’s platform enriches the content to boost accuracy. This information retrieval for question answering (IRQA) capability allows users and systems to dynamically converse with previously static information. The platform’s API also rapidly expands the functionality of existing AI assistants, chatbots, and interactive voice response (IVR) installations, which can typically only respond to a limited set of requests, reducing the business impact of contact centers and help desks.Mahl said, “Since the moment I met the team, I have been incredibly impressed and sense the same level of energy, quality and vision I witnessed in my time at Salesforce and other successful companies in hyper growth. Our sole purpose at Pryon is to transform enterprise content into a cohesive asset that drives business value.”About PryonPryon is an artificial intelligence (AI) company focused on enterprise knowledge management. Its natural language processing (NLP) platform transforms unstructured data into experiences that increase productivity with unmatched accuracy and speed. Pryon’s automated machine learning engines deliver rapid time to value by enriching existing content. This no-code approach prevents operational disruption and allows organizations to quickly maximize the business value trapped within their information assets. Pryon was founded by Igor Jablokov, whose previous company defined the state of the art for AI assistants and was acquired by Amazon to form the basis for Alexa. For more information, please visit pryon.com or follow us on LinkedIn and Twitter.", "metadata": "2021-11-22"}
