{"text": "Transport Investments, Inc. Invests in US Logistics, LLC and Nationwide Logistics, LLC. PITTSBURGH, Nov. 29, 2021 /PRNewswire/ -- Transport Investments, Inc. (\"Transport\"), a leading provider of heavy haul, flatbed, and specialized transportation and logistics services throughout North America, announced today that it has invested in US Logistics, LLC and Nationwide Logistics, LLC (together, \"USLN\").Based in Cincinnati, OH, USLN is one of the most recognized and respected specialty freight brokerage groups in North America. USLN, through its network of independent agents, connects industrial, consumer, and other specialty transportation customers with its vast network of third-party carriers and resources.R. Bruce McAdams, CEO of Transport, commented, \"USLN's market reputation, talented agents, deep customer relationships, and carrier following are complementary to Transport's capacity and other value-added solutions. We were immediately impressed by the USLN management team, and we look forward to working with Jeff, Doug, Sarah, Katie, and the rest of their team, as we forge together and create a highly differentiated transportation group.\"Jeff Hiatt, Co-Founder of US Logistics, noted, \"We view Transport as one of the leading platforms in the transportation market, and we are thrilled to partner with them on this next phase of growth.\" Further, Sarah Long, Founder of Nationwide Logistics, added, \"The combination with Transport will help fuel growth and expansion opportunities for USLN, our agents, customers, employees, and carrier partners. We look forward to serving our current and new customers with the same leading service the market has come to expect from USLN.\"ABOUT USLN US Logistics, LLC and Nationwide Logistics, LLC are highly recognized and respected specialty freight brokerage providers in North America. USLN offers predominantly full truckload (heavy haul, flatbed, specialty, step-deck, van, and refrigerated) transportation brokerage and logistics services through a national network of agents. For more information, visit www.uslfreight.com or www.nationwidelogistics.net.ABOUT TRANSPORT Transport Investments, Inc. is a leading provider of heavy haul, flatbed, and specialized transportation and logistics services throughout North America. As one of the largest carrier groups in the United States and Canada, the combined group handles annual volume of over 375,000 loads through its network of terminals, owner-operators and carriers. Gemspring Capital invested in Transport in 2021. For more information, visit www.transportinvestments.com.ABOUT GEMSPRING CAPITAL Gemspring Capital, a Westport, Connecticut-based private equity firm with $1.5 billion of capital under management, provides flexible capital solutions to lower middle market companies. Gemspring partners with talented management teams and takes a partnership approach to helping drive revenue growth and value creation. Target companies have up to $500 million in revenue and are in the business services, industrial services, software and tech-enabled services, aerospace & defense, consumer services, financial and insurance services, healthcare services, or specialty manufacturing sectors. For more information, visit www.gemspring.com.Contact: Geoff Broglio [email protected]SOURCE Gemspring Capital Related Links www.gemspring.com", "metadata": "2021-11-28"}
{"text": "Ablaze Pharmaceuticals Launches with $75m Series A Financing to Bring Novel Targeted Radiopharmaceuticals to Treat Cancer Patients in the Greater China MarketUSA - EnglishEspaña - español. SHANGHAI and SAN DIEGO, Nov. 29, 2021 /PRNewswire/ -- Ablaze Pharmaceuticals (\"Ablaze\"), a clinical-stage pharmaceutical company focused on the development and commercialization of innovative targeted radiopharmaceutical therapies (TRT) against tumor targets, announced a $75 million Series A financing round. The financing was co-led by Vivo Capital and AdvanTech Capital with participation from RAYZ Investments, Nan Fung Life Sciences, Pivotal bioVenture Partners China, venBio Partners, Samsara BioCapital and Venrock Healthcare Capital Partners. \"Targeted radiopharmaceutical therapies represent the next foundational modality to treat cancer,\" said Dr. Ken Song, co-founder and Chairman of the Board of Ablaze and President and CEO of RayzeBio, Inc. \"In forming Ablaze, we realized to be successful, it was critical to have a company focused on the China market and focused on radiopharmaceuticals.\"With TRT gaining broader interest and adoption, Ablaze was formed to become the leading radiopharmaceutical company to introduce TRT products to the Greater China market. Led by an experienced team and a strong investor syndicate, Ablaze started on a solid footing, anchoring with a strategic RayzeBio in-licensing agreement, and a partnership with an academic institution on a clinical stage asset. Upon closure of the Series A, Ablaze is also actively exploring other potential partnerships, and building strong internal development capabilities.\"TRT is an emerging field that has already demonstrated tremendous clinical efficacy in treating cancer worldwide. We are privileged to have an opportunity to partner with Ablaze and the RayzeBio team in developing this category of potentially life-saving therapeutics for cancer patients in China.\" said Dr. Hongbo Lu, Managing Partner of Vivo Capital.Proceeds from the Series A financing will be used by Ablaze to establish a leading pipeline of advanced TRT products for the treatment of solid tumors, expand the leadership team, build up infrastructure for radiopharmaceuticals and secure further strategic collaborations. The board of directors include Dr. Alex Qiao, co-founder and President and CEO of Ablaze Pharmaceuticals, Dr. Hongbo Lu, Benjamin Qiu, Partner at AdvanTech Capital, Dr. Aaron Royston, Managing Partner at venBio Partners, and Dr. Ken Song as well as Norman Tse, Vice President at Nan Fung Life Sciences as board observer.\"We believe Ablaze is bringing world class design of TRT products as well as clinical expertise to China through collaborations with global leaders in TRT, and is determined to be a leading player in China's TRT innovations\" said Mr. Benjamin Qiu.\"We are excited about this opportunity to bring a novel class of therapeutic products to benefit patients in China,\" said Dr. Alex Qiao. \"This investment from top tier investors in China and abroad provides a strong endorsement to Ablaze's vision and business model. We look forward to creating the best and differentiated medicines to address unmet medical needs in China.\"About Ablaze PharmaceuticalsFounded in 2021, Ablaze Pharmaceuticals is a clinical-stage pharmaceutical company with a mission to bring advanced targeted radiopharmaceutical therapies (TRT) to benefit cancer patients in China. Since its inception, Ablaze has secured a partnership with RayzeBio, Inc., an innovative radiopharmaceutical company based in San Diego CA, to gain exclusive development and commercial right to a series of RayzeBio's products in the greater China region. Leveraging its team's extensive business experience and network in cross-border product development and deal making, Ablaze strives to become the leader and the partner of choice in the emerging TRT market in China by working with strategic business partners in both China and abroad. For more information, please visit www.ablazepharma.comAbout Vivo CapitalFounded in 1996, Vivo Capital is a global investment firm focused on healthcare. Vivo has approximately $5.8 billion in assets under management, invested in over 310 public and private companies worldwide. The firm is headquartered in Palo Alto, California, with additional offices in Asia.  The Vivo team consists of more than 50 multi-disciplinary professionals, including, physicians, scientists, entrepreneurs, operating executives, and industry experts.Vivo provides a multi-fund investment platform, covering growth equity, private equity including buyout, venture capital, and public equity. Vivo invests broadly in healthcare across all fund strategies, including biotechnology, pharmaceuticals, medical devices, and healthcare services, with a focus on the largest healthcare markets.About AdvanTech CapitalLaunched in January 2016, AdvanTech Capital is a private equity fund, focused on innovation-driven growth capital in China. AdvanTech, focuses on healthcare and TMT / e-Services sectors, is managed by over a dozen seasoned investment professionals with local and overseas educational background, as well as diversified and in-depth local knowledge, practical deal execution capabilities and experiences.About Nan Fung Life Sciences & Pivotal bioVenture Partners ChinaNan Fung Life Sciences is a global life sciences investment platform with a long-term capital commitment from the Nan Fung Group. The team possesses diverse experience with long track records in company formation, venture capital, growth/buyout investments, and drug discovery and development. For more information, please visit https://www.nanfunglifesciences.com Pivotal bioVenture Partners China, a member of Nan Fung Life Sciences, is a venture capital firm specializing in the healthcare and life sciences industry. Its investment strategy is centered on identifying promising innovative products and technologies and bringing them to build out new companies in China. For more information, please visit https://www.pivotalbiovp.cn SOURCE Ablaze Pharmaceuticals", "metadata": "2021-11-28"}
{"text": "Alexandria Venture Investments, One of the Year's Top Five Most Active U.S. Investors in Agrifoodtech, Accelerates Its Mission-Critical Investment Activity in a Sector Experiencing Tremendous Upsurge in Venture Funding. PASADENA, Calif., Nov. 29, 2021 /PRNewswire/ -- Alexandria Venture Investments, the strategic venture capital platform of Alexandria Real Estate Equities, Inc. (NYSE: ARE), an urban office REIT and the first, longest-tenured and pioneering owner, operator and developer uniquely focused on collaborative life science, agtech and technology campuses in AAA innovation cluster locations, has accelerated its efforts to support the agrifoodtech sector by investing in innovative companies that are developing groundbreaking technologies to meaningfully improve human health and nutrition, as well as those companies that are combating climate change through sustainable agriculture technologies and practices. Recognized by AgFunder as one of the top five most active U.S.-based investors in the agrifoodtech sector in 2021, Alexandria Venture Investments is on track to double its investment activity this year, a move supported broadly by the increase in private capital that has flowed into the sector from climate change-focused funds. Venture investing in the overall agrifoodtech sector has grown dramatically in recent years, from $8.9 billion in 2016 to $24 billion in the first half of 2021 alone, amounting to a more than fourfold increase in funding over the last five years. \"Alexandria has long understood that the agricultural and climate innovation sectors represent perhaps the most critically untapped source of opportunities for improving nutrition, ending global hunger, combating climate change and advancing human health at its most fundamental level,\" said Joel S. Marcus, executive chairman and founder of Alexandria Real Estate Equities, Inc. and founder and head of Alexandria Venture Investments. \"Since 2000, Alexandria has been at the vanguard and heart of the agrifoodtech ecosystem, developing and operating sophisticated agtech infrastructure and investing in innovative companies advancing novel approaches with immense potential to address sustainability-, agriculture-, food- and nutrition-related challenges. These strategic efforts have enabled us to lead the market in identifying top-tier investment opportunities and assist in building the next generation of impactful agrifoodtech companies revolutionizing the sector.\"   Alexandria continues to focus on investing in the highest-quality, most promising and positively impactful companies across the production-distribution-consumption value chain, including those operating in the controlled environment agriculture (CEA) space, also referred to as indoor ag; innovators bringing more resilient and productive crops to market through gene editing; disruptive organizations working on sustainable crop nutrients and targeted pesticides; and pioneers in food transforming the way we eat. Included among Alexandria's agrifoodtech investment portfolio companies are those working to innovate across the food value chain, such as GreenLight Biosciences, which has announced a potential SPAC transaction; Vindara, which was acquired by Kalera, Inc. in 2021; Bear Flag Robotics, which was acquired by John Deere for $250 million in 2021; Inari, which raised $208 million at a $1.2 billion post-money valuation in 2021; and Invaio Sciences, which raised $89 million in May 2021.   About Alexandria Real Estate Equities, Inc.   Alexandria Real Estate Equities, Inc. (NYSE: ARE), an S&P 500® urban office REIT, is the first, longest-tenured and pioneering owner, operator and developer uniquely focused on collaborative life science, agtech and technology campuses in AAA innovation cluster locations, with a total market capitalization of $38.6 billion as of September 30, 2021, and an asset base in North America of 63.9 million SF. The asset base in North America includes 38.7 million RSF of operating properties and 4.3 million RSF of Class A properties undergoing construction, 8.9 million RSF of near-term and intermediate-term development and redevelopment projects and 12.0 million SF of future development projects. Founded in 1994, Alexandria pioneered this niche and has since established a significant market presence in key locations, including Greater Boston, the San Francisco Bay Area, New York City, San Diego, Seattle, Maryland and Research Triangle. Alexandria has a longstanding and proven track record of developing Class A properties clustered in urban life science, agtech and technology campuses that provide our innovative tenants with highly dynamic and collaborative environments that enhance their ability to successfully recruit and retain world-class talent and inspire productivity, efficiency, creativity and success. Alexandria also provides strategic capital to transformative life science, agtech and technology companies through our venture capital platform. We believe our unique business model and diligent underwriting ensure a high-quality and diverse tenant base that results in higher occupancy levels, longer lease terms, higher rental income, higher returns and greater long-term asset value. For additional information on Alexandria, please visit www.are.com.    Forward-Looking Statements    This press release includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements include, without limitation, statements regarding Alexandria's potential targets for investment activity, the likelihood of continued investment activity by the Alexandria Venture Investments® platform in certain agrifoodtech companies, and the potential impacts of such investments on Alexandria's business and the companies in which it invests. These forward-looking statements are based on the Company's present intent, beliefs or expectations, but forward-looking statements are not guaranteed to occur and may not occur. Actual results may differ materially from those contained in or implied by the Company's forward-looking statements as a result of a variety of factors, including, without limitation, the risks and uncertainties detailed in its filings with the Securities and Exchange Commission. All forward-looking statements are made as of the date of this press release, and the Company assumes no obligation to update this information. For more discussion relating to risks and uncertainties that could cause actual results to differ materially from those anticipated in the Company's forward-looking statements, and risks and uncertainties to the Company's business in general, please refer to the Company's filings with the Securities and Exchange Commission, including its most recent annual report on Form 10-K and any subsequently filed quarterly reports on Form 10-Q.   CONTACT: Courtney Mulligan, Senior Director – Communications, (646) 939-7471, [email protected]SOURCE Alexandria Real Estate Equities, Inc. Related Links http://www.are.com", "metadata": "2021-11-28"}
{"text": "Tegus Raises $90 Million Series B. CHICAGO, Nov. 29, 2021 /PRNewswire/ -- Tegus, the leading market intelligence platform for decision makers, today announces a $90 million Series B funding round led by Oberndorf Enterprises and Willoughby Capital.Founded in 2017 by twin brothers Michael and Thomas Elnick, Tegus has revolutionized the research process for decision makers at top institutional investment firms, Fortune 1000 enterprises, investment banks, and consultancies. Tegus now serves more than 1,000 customers, a 300% increase in the last year. Tegus will use the recent investment to continue its rapid expansion, to broaden its data offering, and to accelerate the development of its product suite. Company headcount has grown from 115 employees last year to over 300 today. Tegus plans to hire more than 400 new employees next year as the company scales sales, product, and engineering teams to meet customer demand. Tegus is also taking this opportunity to jump-start its European expansion, opening a new office in Waterford, Ireland. The Company is hiring for a wide range of go-to-market and operations roles in Europe. Over the next two years, the Company has committed to hiring an additional 100 team members in the region.\"Every company in every industry relies on qualitative insights and information to make better decisions, faster,\" said Thomas Elnick, Founder and Co-CEO of Tegus. \"Tegus created a modern research hub which rapidly educates users on the most relevant business topics, enabling informed decisions.\"\"Today's announcement reflects the strength of our business, the enormous customer demand for our products and the incredible opportunity ahead,\" said Michael Elnick, Founder and Co-CEO. \"Our investor base is unique in that all of them have been Tegus customers for many years. We feel fortunate that our largest investors are also daily users of our product, and we are excited to partner with Oberndorf and Willoughby to draw on their experience building differentiated companies for the very long-term.\"Tegus has filled key leadership roles this year, adding a team of seasoned executives who have been instrumental in leading hyper-growth organizations, including CPO Tim Anderson (Zapier, Glassdoor), CTO Ryan Aylward (Glassdoor), and GC/CCO Jason Howard (SEC). \"In a few short years Tegus built the most comprehensive primary diligence platform in the industry. We feel grateful to invest alongside such a talented team. Their product has dramatically improved our investment process and we look forward to seeing what Tom, Mike, and the Tegus team build next,\" said William E. Oberndorf, Chairman of Oberndorf Enterprises.\"Tom and Mike have created a product that revolutionizes the primary research industry,\" said Daniel Och, Founder and CEO of Willoughby Capital. \"As customers, we see first-hand the incredible efficiencies and valuable insights driven by the platform. We are very pleased to support Tom and Mike in building Tegus for the long term.\"To learn more about Tegus, please visit our website.About Tegus Tegus is the leading provider of primary business and market intelligence for key decision makers. Tegus conducts research and collects data to produce the largest and most comprehensive primary information platform available, enabling clients to discover answers to their most challenging questions faster and more efficiently than anywhere else. The company serves more than 1,000 customers worldwide, including investment firms, corporations, and consultancies. For more information about our leading market and business intelligence solution, visit tegus.co.Company ContactBob CaseyChief Financial Officer847.507.3232[email protected] SOURCE Tegus", "metadata": "2021-11-28"}
{"text": "Zendure, a leading lifestyle brand for outdoor clean-energy products, obtains millions in series-A funding. PALO ALTO, Calif., Nov. 29, 2021 /PRNewswire/ -- Recently, Zendure announced that it has secured a multi-million series-A funding deal, which is jointly invested by Shanghai GP Capital and YOTRIO group. This round of funds will be mainly used to expand the R&D and sales team, enrich and improve Zendure's outdoor clean-energy lifestyle product line, expand the range of energy storage scenarios the brand can address, and accelerate the expansion of domestic and foreign sales channels. At the same time, Zendure's blockbuster product, SuperBase Pro outdoor IoT power station has exceeded 1.3 million US dollars in its global release on Indiegogo, a well-known technology product crowdfunding platform.Zendure announced that it has secured a multi-million series-A funding deal, which is jointly invested by Shanghai GP Capital and YOTRIO group.For this round of financing, a partner of GP Capital said, \"Zendure is an outdoor focused consumer electronics company with the 'geek gene' and a global outlook. With many innovative patented technologies, Zendure's power banks and outdoor energy storage technologies have attained a lead position in the global market. In recent years, GP Capital has made several substantial investments in the entire clean energy industry. This time we are very happy to be able to team up with Zendure to jointly promote the popularization of the outdoor clean energy lifestyle.\" Bryan Liu, the founder of Zendure, said, \"The outdoor clean energy lifestyle will gradually become mainstream, worldwide. Zendure will release a series of products including power banks, outdoor power stations, outdoor small appliances, and more, to create a trendy, fashionable, high-tech angle to the offerings in this lifestyle, to realize Zendure's mission of 'empowering outdoor life'. Thanks to our investors' confidence in Zendure, we are able to realize our vision of becoming the leading brand in the outdoor clean energy lifestyle market.  Zendure is an outdoor consumer electronics company located in Silicon Valley in the United States and the Guangdong - Hong Kong - Macao- Greater Bay Area in China. Since its establishment in 2017, Zendure has continuously launched innovative products, made rapid breakthroughs in the core technologies of outdoor energy storage and power supplies, and continues to bring pleasant surprises to the user experience.Zendure's growth coincides with a period of rapid growth in the outdoor portable energy storage market. From the perspective of the overall environment, the outdoor energy storage power supply industry has entered a period of explosive growth. Outdoor power supplies can charge drones, digital cameras, laptops, and other equipment to solve power problems in outdoor entertainment, day-to-day necessities, and even help start a vehicle in an emergency. In addition, the COVID-19 epidemic has changed the way people pursue entertainment and leisure. Short drives and \"picnic camping\" have become increasingly popular. Data shows that the events of 2020 will put the global portable energy storage/power supply industry into hyperdrive. This market is expected to reach 36.9 billion U.S. dollars in 2025. As early as 2019, Zendure foresaw the potential of the portable energy storage and power supply industry from trends in consumer demand. Relying on years of accumulated technical and market experience, plus a mature supply chain and fulfillment channels in the charging field, Zendure made a timely entrance into the outdoor energy storage/power supply industry. Zendure has more than 60 global patents, and the company has full chain control in battery management systems, power inverters, DC power, cloud services, and app development. Passport, SuperTank, SuperWave, SuperBase and other Zendure products have earned awards including Red Dot, iF, Good Design and more. In 2020, SuperTank Pro, a portable energy storage product, was purchased by Apple's California headquarters and was covered by top overseas media including ZDNet, The Verge, and Forbes. Zendure's core team consists of experienced team leaders and development experts from large global brands, including Apple, Huawei, and BYD. More than 50% of Zendure's personnel are dedicated toward R&D.The rapid development of the clean energy industry and the proposed goals of \"carbon peak\" and \"carbon neutrality\" have greatly bolstered the energy storage industry. Coupled with changes to the way people camp, the global portable energy storage and outdoor consumer electronics market is growing rapidly and is expected to reach 100 billion US dollars within 5 years.  SOURCE Zendure", "metadata": "2021-11-28"}
{"text": "HotSpot Therapeutics Closes $100M Series C to Advance First-in-Class Allosteric Drug Discovery Platform to the ClinicFinancing will accelerate HotSpot's transition into a clinical development company while enabling expansion of its product pipeline. BOSTON, Nov. 29, 2021 /PRNewswire/ -- HotSpot Therapeutics, Inc., a biotechnology company pioneering the discovery and development of first-in-class allosteric therapies targeting regulatory sites on proteins referred to as \"natural hotspots,\" today announced the close of its oversubscribed $100 million Series C financing, bringing its total funding to $190 million.Led by Pivotal bioVenture Partners, with significant participation by LSP and B Capital Group, the round includes new investors Monashee Investment Management, LLC, CaaS Capital Management, Revelation Partners and Pavilion Capital, as well as participation from previous investors, Atlas Venture, Sofinnova Partners, SR One Capital Management, funds managed by Tekla Capital Management, LLC, and MRL Ventures Fund. Ash Khanna, PhD, of Pivotal bioVenture Partners, and Fouad Azzam, PhD, of LSP, will join the HotSpot Board of Directors. The new financing will be used to continue advancing HotSpot's Smart Allostery™ platform, with a focus on undrugged and poorly druggable targets, as well as the company's existing pipeline.  \"With the support of top-tier healthcare and technology investors, we will expand on the significant productivity of the Smart Allostery™ platform to enable a treasure trove of sought-after disease targets and thereby develop medicines that broadly benefit patients,\" said Jonathan Montagu, Co-founder and Chief Executive Officer of HotSpot Therapeutics. \"We have diligently established a deep pipeline of product opportunities in cancer and autoimmune disease, each offering a clear path to clinical value through precision and patient-targeted trial design.\"HotSpot's Smart Allostery™ platform unlocks a vast range of disease-relevant proteins for the first time through the identification of protein pockets called \"natural hotspots.\" Natural hotspots are pockets that are decisive in protein function yet previously unexploited using conventional allostery approaches. The Smart Allostery™ platform encompasses a broad suite of AI-enabled technologies and the industry's largest and most diverse chemical library tailored to hotspots. The company is leveraging the Smart Allostery™ platform to uncover, capture, and drug natural hotspots across a wide array of disease-causing proteins.\"Within 36 months, HotSpot has established a new paradigm for allostery drug discovery that is reproducibly delivering small molecules across multiple target classes, including transcription factors and E3 ligases,\" said Ash Khanna, PhD, Venture Partner at Pivotal bioVenture Partners. \"We are thrilled to be partnering with HotSpot as they advance their pipeline to the clinic and realize the promise of delivering potentially lifesaving therapeutics to patients.\"Earlier this month, HotSpot announced new data validating its Smart Allostery™ platform in the elucidation and preclinical evaluation of a novel allosteric inhibitor of the E3 ubiquitin ligase CBL-B, an important target in cancer immunotherapy. The data show successful targeting with the first and only selective small molecule inhibitors of CBL-B. Identified via the company's Smart Allostery™ platform, these small molecules promote T cell responses in vitro and in mice. Through allosteric inhibition of this negative regulator of immune cells, HotSpot's small molecule CBL-B inhibitors offer the potential for increased immunotherapy efficacy for cancer patient populations that have historically exhibited poor treatment responses.About HotSpot TherapeuticsHotSpot Therapeutics is targeting naturally occurring pockets on proteins called \"natural hotspots\" that are decisive in the control of cellular protein function. Largely unexploited by industry, these pockets are highly attractive for drug discovery and enable the systematic design of highly potent and selective small molecules that exhibit novel pharmacology. The company's Smart Allostery™ technology platform utilizes AI-driven data mining of large and highly diverse data sets to identify pockets that matter on proteins, integrated with a tailored pharmacology toolkit and bespoke chemistry to rapidly deliver superior hotspot-targeted small molecules. The company has successfully exploited natural hotspots across multiple classes, including E3 ligases, kinases, and transcription factors. HotSpot has established a product pipeline of first-in-class small molecules for the treatment of cancer and autoimmune diseases, each enabled by precision and patient-targeted clinical design. To learn more, visit www.hotspotthera.com.SOURCE HotSpot Therapeutics", "metadata": "2021-11-28"}
{"text": "Hacking people is too easy: CultureAI announces $4m seed round to measure and mitigate human cyber security risk. MANCHESTER, England, Nov. 29, 2021 /PRNewswire/ -- CultureAI, the human cyber security platform founded by professional hackers, today announced the closing of a $4 million Seed round to fuel its rapid growth. The investment was led by Senovo and saw participation from new investors Conviction alongside existing investors Passion Capital. Angel investors Paul Forster (Co-founder, Indeed) and Guntram Friede (Head of Marketing, EMEA Salesforce & MuleSoft) also joined the round to support CultureAI's disruption of the cyber security awareness market. The additional capital accelerates product development and enables CultureAI to expand into new markets.Founded when professional hacker James Moore saw even the best security awareness training made no difference to attackers' ability to compromise organisations, CultureAI is being adopted by a rapidly growing number of organisations to easily identify and prevent security incidents caused by employees. \"It's almost unheard of for professional hackers (known as penetration testers) to fail to gain access to an organisation, even if they have great security awareness training for employees,\" explains James, who continues \"We successfully gain access to organisations' data and systems every time and it's almost always as a result of human behaviour or error. As an example, multi-factor authentication (MFA) is often touted as a key cyber defence – yet we find that an average of 32% of employees accept MFA authentication requests sent by attackers, essentially opening the door for them. The traditional awareness training approach simply doesn't improve behaviours like this – hacking people is still too easy.\"James believes security coaching, not training, is key – \"Outside of security, when someone starts to learn a sport or a new skill and wants to improve, they get a coach. A coach observes behaviour, corrects mistakes in real-time, and gives them tailored advice whilst motivating and empowering them by providing the right equipment to perform. A coach doesn't simply tell them to watch some generic training videos, take a multiple choice quiz and then expect them to be perfect; which is, regrettably, the common approach to security awareness today. We built CultureAI to detect human security risks and automatically use those insights to drive technical interventions and coaching - not simply 'train' people. It's a very different way to managing human risk.\"\"CultureAI is revolutionising human security with a data-driven approach, disrupting the $1 billion security awareness industry,\" says Jon Stokes, chief technology officer. \"Within minutes our platform is detecting human security incidents across the organisation and combining those events with machine-learning to automatically drive cyber security coaching programmes that are intelligently tailored to each employees' cyber strengths, weaknesses and job role. As human risk events are detected, the platform creates employee security scores to allow organisations to understand their entire human risk surface for the first time. Human security event data is also pushed to clients' existing security tools in real-time, enabling automated mitigation of human security incidents. The result is people preventing breaches, instant responses to protect people when security incidents occur and the ability to measure security behaviour improvement – something awareness training has never managed.\"CultureAI will leverage the new funding to supercharge its product roadmap and will be significantly expanding its commercial and technical teams in its Manchester city centre office, located within minutes of half a dozen cyber security organisations, including UK government intelligence agency GCHQ. \"Manchester has become one of the worlds leading tech and cyber security hubs, we're excited to be building the team from such a strong local talent pool,\" says head of HR Molly Keeton. \"While cyber security threats are growing and employees remain one of the main targets for hackers, the human risk factor continues to be an unsolved problem for most organisations. With their fully automated approach to measure human cyber security risk and mitigate it through gamified, data-driven coaching CultureAI offers the first solution to create a truly secure cyber security culture. We're extremely excited to be working with James, Jon and the rest of the team to rethink human cyber security,\" says Mona Müller from Senovo.Organisations looking for a better approach to security awareness can sign up for a free trial at: https://www.culture.ai/trial.Website: https://www.culture.aiSOURCE CultureAI", "metadata": "2021-11-28"}
{"text": "Help Therapeutics Completes Series C Financing of 25 Million Dollars. NANJING, China, Nov. 29, 2021 /PRNewswire/ -- Recently, the iPSC therapeutics leading global platform company - Help Therapeutics announced the completion of Series C financing of 25 millions of dollars. This round of financing was led by Ming Bioventures, followed by Share Capital, Beisen Medical Fund, and Jolmo Capital, with additional support from our old shareholder Purple Bull Startups, and Hoyue Capital acting as the exclusive financial advisor for this round of financing. The financing will help the company conduct and complete clinical trials of its fully independent intellectual property development pipeline, iPSC heart cell injection, and will initiate clinical studies of immune cell therapy based on iPSC technology within the next year.Help TherapeuticsAs the first company in China to develop and manufacture cell therapy using induced pluripotent stem cell (iPSC) technology, Help Therapeutics insists on focusing on the fields of heart failure and tumor immune diseases to develop general-purpose cell therapy products to meet clinical demand.The company's founder, Dr. Wang Jiaxian, is a medical doctor from the University of Hong Kong and a postdoctoral fellow at Mount Sinai School of Medicine in the United States. During his time as a cardiologist, Dr. Wang became concerned that the population of heart failure patients in China has reached over 10 million, and there are about 3 million patients with severe heart failure waiting for heart transplants every year, but only about 600 people can find heart donor, a huge gap that has become a problem for the entire medical community. Dr. Wang chose to enter the field of iPSC cell therapy in 2010, convinced that iPSC technology is a groundbreaking technology for human medicine, and looking forward to saving heart failure patients through this innovative cutting-edge technology. After years of development, the company has developed several product pipelines based on iPSC technology, mastering advanced iPSC reprogramming technology while having the capability of large-scale automated production and cell quality inspection of iPSC drugs.iPSC pipeline layout  Break through the heart failure treatment dilemmaHelp Therapeutics has laid out several R&D pipelines in the areas of heart failure and tumor immunity, among which iPSC technology therapy for the treatment of moderate to severe heart failure has entered several authoritative centers nationwide to conduct large-scale randomized controlled human clinical trials. Help Therapeutics has accumulated profound experience in the field of heart failure cell therapy: In 2020, Nature reported the world's first human study of iPSC cells for end-stage heart failure conducted jointly by the company and Nanjing Drum Tower Hospital. Based on 24-month follow-up data from three patients in this clinical trial, the efficacy and safety of Help Therapeutics's iPSC-derived cardiomyocyte drug for the treatment of severe heart failure were excellent.The company has already obtained the first iPSC technology-based heart failure cell therapy clinical study filing from the National Health Care Commission in China, and is also actively preparing clinical registration filings for both the U.S. and China for its heart failure treatment pipeline. After clinical trials, this product is expected to be the first iPSC cell therapy drug for moderate to severe heart failure in China and the world, and its social and commercial value will be incalculable.Artificial intelligence fully automated production line, the world's first biopharmaceutical 4.0 eraWith the development of the cell therapy industry, the quantity and quality of cell culture are in more refined and higher demand, both from the perspective of clinical demand and R&D exploration. The current manual culture of cell therapy products has long operation time, large variation between product batches, low batch culture capacity and other industry bottlenecks, and thus the cost and terminal selling price of cellular drugs remain high, and cannot really reach the majority of patients. Therefore, addressing the commercial mass production of cells has become central to the development of cell therapy companies.Help Therapeutics is at the forefront of the world's technology in terms of cell mass production and quality assurance. Its fully automated production line has reached the international leading position, improving the quality and stability of cellular products while significantly reducing production costs. The annual production capacity of a single production line can meet 100,000 doses, contributing to the popularization of cellular products. The company's fully automated production pipeline was selected for the National \"13th Five-Year Plan\" Science and Technology Innovation Achievement Exhibition.Taking the responsibility of the country as our ownHelp Therapeutics has the first induced pluripotent stem cell (iPSC) biospecimen bank authorized by the Ministry of Science and Technology for the preservation of human genetic resources in China. Entrusted by the National Human Genetic Resources Sharing Service Platform and as the only officially recognized iPSC rare disease cell bank in the National 14th Five-Year Plan (National Science and Technology Heritage Office [2021]-BC0022), Help Therapeutics carries the heavy responsibility of human genetic material and makes every effort to promote the role of China's iPSC technology platform and rare disease research and development treatment. Help Therapeutics will provide high-quality and diversified biological samples to research institutions and enterprises, accelerate rare disease research and orphan drug development, and help the rapid development of iPSC cell industry.SOURCE Help Therapeutics", "metadata": "2021-11-28"}
{"text": "Quell Therapeutics Raises $156 million in Oversubscribed Series B Financing to Advance its Pioneering Multi-Modular Engineered T Regulatory (Treg) Cell Therapy Pipeline and Platform. LONDON and BOSTON, Nov. 29, 2021 /PRNewswire/ -- Quell Therapeutics Ltd (\"Quell\"), the world leader in the development of engineered T-regulatory (Treg) cell therapies for serious medical conditions driven by the immune system, today announced it has raised $156 million in an oversubscribed Series B financing. The financing round was co-led by Jeito Capital, Ridgeback Capital Investments, SV Health Investors and Fidelity Management & Research Company LLC with participation from founding investor Syncona. New investors include British Patient Capital through its Future Fund: Breakthrough program, Janus Henderson Investors, Monashee Investment Management, Point72 and funds managed by Tekla Capital Management LLC. Proceeds from the financing will be used to:Fund the LIBERATE Phase 1/2 clinical trial of QEL-001, a first-in-class antigen-specific multi-modular CAR-Treg cell therapy candidate designed to prevent organ rejection in liver transplant patients by inducing durable immune tolerance and eliminating the need for lifelong immunosuppression. QEL-001 is on-track to become the first multi-modular engineered CAR-Treg cell therapy in clinical development, with patient recruitment expected to begin before the end of the year. Advance Quell's pipeline in core therapeutic areas of transplantation, neuroinflammatory diseases and autoimmune diseases Accelerate the development of Quell's autologous multi-modular engineered Treg platform, and further develop an allogeneic CAR-Treg platform\"Quell is at the forefront of a new wave of cell therapy. We are leading the way with our highly-differentiated, multi-modular approach to Treg therapy engineering and production,\" said Iain McGill, Chief Executive Officer of Quell Therapeutics. \"We are proud to have the support of this premiere syndicate of investors as we drive forward to our next stage of growth. With this financing, we have the full suite of capabilities – capital, cutting-edge science, and a world-class team – to advance our pipeline and platform to key milestones on our path ultimately to deliver potentially transformative therapies to patients suffering from diseases caused by immune dysregulation.\"Quell is harnessing the full power of Tregs, known as the \"master modulators\" of immune homeostasis, to create novel cell therapies designed to suppress overactive immune responses, drive long-term tolerance in the local immune environment and promote tissue repair. Quell's versatile platform technology enables the Company to design, engineer and manufacture at scale, therapeutic Treg products with greater stability, persistence and potency than earlier generations. Key elements of this technology include its proprietary Phenotype-Lock technology, which enables Quell to \"lock\" Tregs in an immunosuppressive phenotype that enhances their safety, stability, and efficacy; chimeric antigen receptor (CAR) modules for tissue targeting; and additional modules to enhance disease-specific efficacy and safety.In connection with the financing, Rachel Mears (Partner at Jeito Capital), Jeffrey Long-McGie (Managing Director at Ridgeback Capital) and Houman Ashrafian (Managing Partner at SV Health Investors) joined Quell's Board of Directors.Martin Murphy, CEO of Syncona Investment Management Limited, said: \"In 2019, Syncona co-founded Quell bringing together pioneering science from leading UK and European universities, with the ambition to develop first-in-class therapies in the ground-breaking Treg field offering the potential to make a real difference to the lives of patients. Since then, the progress made by the Quell team, led by Iain McGill, is remarkable. The business has moved from concept-to-clinic in under three years – we are excited to see its pioneering lead program enter the clinic this year.\"This financing underlines the progress the company has made to date and the scale of its ambition. Supported by a strong syndicate of global investors, the business will be able to progress its lead program and pipeline, whilst building scalable manufacturing capabilities, as it seeks to entrench its leadership position in an emerging field of innovative medicine.\"Rafaèle Tordjman, Founder and CEO at Jeito, said: \"Our investment in Quell is testament of our ambition to continue building a strong portfolio of companies with the potential of becoming market leaders. Following the recent closing of our first fund, Jeito I, at $630 million, we are pleased to have co-led this financing round alongside many prestigious investors in the US and the UK. With its high-quality science, expert leadership team, strong syndicate of investors and significant capital, Quell is ideally positioned to accelerate its therapies through clinical development for the benefit of millions of patients.\"Dr. Wayne Holman, Founder & CEO of Ridgeback Capital, said: \"The ability to modulate the T regulatory cell has the potential to advance medicine into a new age of possibility.  We at Ridgeback are proud to help provide the resources to advance this crucial work.  The technology this dedicated and talented team at Quell has developed may transform autoimmune diseases as well as facilitate organ transplant without the need for lifelong immunosuppression. This is an impossible dream that we believe the scientists and team at Quell can transform into a reality.\"\"As a leader in Treg cell therapies engineering for serious medical conditions, Quell is ultimately driving development of potentially transformative therapies to address diseases driven by the immune system with major unmet medical needs,\" said Houman Ashrafian, Managing Partner of SV Health Investors. \"SV is excited to co-lead the company's latest funding round and we look forward to working closely with Quell's leadership team as they progress clinical development of QEL-001, build out its product pipeline and enhance its Treg platform.\"About Quell TherapeuticsQuell Therapeutics is the world leader in developing engineered T-regulatory (Treg) cell therapies that aim to harness, direct and optimize their immune suppressive properties to address serious medical conditions driven by the immune system.The Company is leveraging its pioneering phenotype lock technology, unique multi-modular platform and integrated manufacturing capabilities to design and develop a pipeline of highly engineered Treg cell therapies with greater potential for stability, persistence and potency than earlier generations of Treg cell therapy approaches.Quell's lead candidate QEL-001 is being developed to induce operational tolerance following liver transplantation, with the potential to protect the post-transplant liver without the need for chronic immunosuppressive medications. Quell is also advancing additional programs in neuroinflammatory and autoimmune diseases. www.quell-tx.com.About Jeito CapitalJeito Capital is a global leading investment company with a patient benefit driven approach that finances and accelerates the development and growth of ground-breaking medical innovation. Jeito empowers and supports entrepreneurs through its expert, integrated, multi-talented team and through the investment of significant capital to ensure the growth of companies, building market leaders in their respective therapeutic areas with accelerated patients' access in Europe & the United States. Jeito Capital has €534 million under management. Jeito Capital is based in Paris with a presence in Europe and the United States. For more information, please visit www.jeito.life, or follow on Twitter @Jeito_life or LinkedIn.About Ridgeback Capital InvestmentsFounded in 2006 by Wayne Holman, MD, Ridgeback Capital is a private investment company that is focused on investing in life science companies at all stages from formation through public market. Ridgeback Capital has a long track record of supporting innovation. The focus of the portfolio is to fund paradigm changing people, ideas, technologies, and companies that will have a broad reaching impact toward the betterment of society. For more information, please see www.ridgebackcap.com.About SV Health InvestorsSV Health Investors is a leading healthcare fund manager committed to investing in tomorrow's healthcare breakthroughs. The SV family of funds invests across stages, geographic regions, and sectors, with expertise spanning biotechnology, dementia, healthcare growth, healthcare technology and public equities. With approximately $2.7 billion in assets under management and a truly transatlantic presence with offices in Boston and London, SV has built an extensive network of talented investment professionals and experienced industry veterans. Since its founding in 1993, SV has invested in more than 200 companies with more than 90 of these having achieved successful acquisitions or IPOs.For more information, please see www.svhealthinvestors.com About Syncona LtdSyncona's purpose is to invest to extend and enhance human life. We do this by founding and building companies to deliver transformational treatments to patients in areas of high unmet need.Our strategy is to found, build and fund companies around exceptional science to create a dynamic portfolio of 15-20 globally leading healthcare businesses for the benefit of all our stakeholders. We focus on developing treatments for patients by working in close partnership with world-class academic founders and management teams. Our balance sheet underpins our strategy enabling us to take a long-term view as we look to improve the lives of patients with no or few treatment options, build sustainable life science companies and deliver strong risk-adjusted returns to shareholders.About Future Fund: BreakthroughFuture Fund: Breakthrough, managed by British Patient Capital, addresses the later stage equity finance gap faced by innovative, R&D-intensive UK companies with cutting edge technologies. These companies often require more capital and take longer to get to market than other companies. Through the Future Fund: Breakthrough programme, British Patient Capital makes equity co-investments with private sector investors in later stage R&D-intensive UK companies operating in breakthrough technology sectors. Companies must, inter alia, be raising a minimum total investment round size of £30m, and the maximum Future Fund: Breakthrough will contribute to an investment round is 30%. Future Fund: Breakthrough invests on the same terms as private sector investors.ContactsLuke Henry, Chief Business OfficerQuell Therapeutics[email protected] Media: Mark Swallow, Frazer Hall, Eleanor PerkinMEDiSTRAVA Consulting+44 207 638 9571[email protected] Investors: Christina TartagliaStern Investor Relations, Inc.+1 212 362 1200[email protected]SOURCE Quell Therapeutics", "metadata": "2021-11-28"}
{"text": "Foundry Lab raises $8M to quickly, cheaply create metal castings using a microwave. Remember Easy Bake Ovens? You’d mix up some colored powder and water until a dough or batter formed, put it in a mold, pop it in the oven, and before you knew it — ding! A disgusting treat. Foundry Lab, a New-Zealand based startup with backing from Rocket Lab’s Peter Beck, has figured out how to do something similar, except instead of chemicals and an “oven,” it’s metals and a microwave.The company, which emerged from stealth on Monday with an $8 million Series A raise, is using “literally a microwave, but on steroids” to cast metal parts much quicker than metal 3D printing, according to David Moodie, founder and CEO of Foundry.“It’s super easy for the user; they literally take the mold, throw in the cold metal powder or metal ingots, put it in the microwave, press the button and walk away,” Moodie told TechCrunch. “It even dings when it’s done. As easy as heating up a microwave dinner.”(Foundry’s microwave has also been used to cook a typical New Zealand meat pie. It took only a few seconds and didn’t taste fantastic, according to Moodie.)Typical casting systems like investment casting, 3D printing and die-casting take anywhere from one to six weeks to produce. Foundry says it has been able to turn around brake shoes for cars in under eight hours using molds that had been 3D printed using computer-aided design (CAD) molds and a giant microwave. The startup is currently working with zinc and aluminum, but has done some successful stainless steel trials and wants to move onto other metals like copper and brass in the future.While Foundry’s tech has future applications in manufacturing industries where metal 3D printing can’t reach, the near-term goal is to help car manufacturing R&D teams develop production-identical, functional metal parts that can be used for testing and prototyping before committing to mass production.“One of the companies we’re talking to is making up to 600 prototype cars before one reaches the market, so they’ll keep changing and keep iterating on it, and that can get expensive really quickly,” Moodie said, adding that tooling costs could be upwards of $50,000 to $100,000.Moodie says before starting Foundry, he ran an industrial design consultancy business, designing products for mass manufacture. He felt frustrated that authorities would consistently reject patent applications because they were made with parts produced by 3D printers or CNC machines, and therefore, potentially made with the wrong physical structures.“So I did the Kiwi thing and went to the shed and lucked my way into a system that worked,” he said, noting that much of his experimenting was done using standard microwaves during New Zealand’s latest lockdown, during which time Moodie couldn’t get into his workshop. “What we’re trying to solve is actual castings, trying to simulate a die casting but doing it fast and cheaply. If you machine to a tool to do a die casting, it’s typically three to six months to get that back.”It’s still early days for Foundry. The company only has a couple of its very large microwaves out for trial with potential customers at the moment, but it will use the Series A funding, which came from Australian VC Blackbird, to get production-ready by the end of 2023.Part of the funding will go toward hiring more staff. The company has grown quickly over the past few months, up from six staffers when it first started fundraising to 17 full-time employees now. The goal is to make it to around 35 over the coming months, a task that’s been difficult with New Zealand’s strict pandemic-related border closures.“The whole border close thing is starting to hit us now,” said Moodie. “The country’s got two microwave experts, and they both have jobs. That’s been particularly difficult. So we’re trying to get someone to come across and help us.”New Zealand is beginning to open up internally, with Auckland coming out of lockdown this week and the city borders opening up to the rest of the country in mid-December. Unless the new omicron variant holds things up, the country is expected to start inviting vaccinated travelers back starting April 30, 2022, giving Foundry and other New Zealand startups the chance to hire talent from abroad.Even though Foundry is working out of New Zealand, it’s targeting markets in the United States and Europe. The company’s long game is to continue to work on the microwaves and get them to a point where they can produce the quantities needed for mass production.", "metadata": "2021-11-28"}
{"text": "Upbound nabs $60M to grow its open source Crossplane multi-cloud management project. Companies today want to avoid the lock-in they faced in the past with a single vendor. As a result, they are hedging their bets with a multi-cloud strategy, but this creates a new problem around finding a single tool for managing it all. That’s where Upbound comes in with its open source Crossplane multi-cloud management tool.It’s a big problem, and up until now, companies have relied on the cloud vendors themselves to manage each one separately. While some solutions like Google Anthos and Red Hat OpenShift have come along, there was a lack of open source tooling until Upbound released Crossplane in May 2020.Investors recognized the need identified by Upbound and rewarded the company with a $60 million Series B to help build the open source project while looking to grow the commercial version of the product. Altimeter Capital led the round with participation from GV, Intel Capital and Telstra Ventures.Upbound founder and CEO Bassam Tabbara said that while the market has attempted to find a solution to this management challenge, he believes that his company is the first to build an open source community with the hope of developing this single management console and single API to manage across cloud tools.“There’s been a lot of efforts around trying to build a single point of control. None of them have attacked this problem from a community perspective, creating a universal control plane that enables that in [a] community, while [building] the convergence around it,” he said.“I think of Crossplane as the first to get to a point where we actually now have a convergence effect around a single universal cloud API. This has never happened before. It’s truly the first time that we’ve gotten to one. You can go to Crossplane right now and you get one declarative API that can be used to address all cloud resources and infrastructure sources across all vendors.”Tabbara points out that the project is fully cloud-native and is managed under the umbrella of the Cloud Native Computing Foundation (CNCF), which manages Kubernetes and other key open source cloud-native technologies.He said that Crossplane allows users to pick and choose the cloud vendors they want to use — whether cloud infrastructure vendors like AWS, Microsoft and Google or cloud-native tooling like Elastic, Confluent, Databricks and Snowflake — and manage all of that from a single API.The company has grown and helped nurture the open source project and developed a commercial product in parallel called Upbound (like the company), which customers can install themselves in their cloud of choice or use a SaaS version that Upbound will manage for them.It’s not only catching on with users. Tabbara said he has also been seeing major vendors like AWS, Azure, Equinix and IBM building integrations for Crossplane. He believes this is key, and it’s similar to the dynamic we saw in 2017 when the major cloud players began to rally around Kubernetes and the CNCF.“It’s truly to the point where there is now a real convergence effect around Crossplane, not unlike the convergence effect that we saw around Kubernetes as a project, and not unlike the convergence we saw around Linux as a project,” he said.It seems to be a project and a commercial vision with tremendous potential, one that investors see as a pivotal piece of the cloud puzzle and are willing to pour in significant capital to help build. If Upbound can execute on this vision, it may be onto something truly transformative, but only time will tell if they can make that happen.What open source-based startups can learn from Confluent’s success story", "metadata": "2021-11-28"}
{"text": "Thought Machine closes $200M for its cloud native banking SaaS and becomes a unicorn. Thought Machine, a 2014 (Xoogler) founded startup that sells cloud-based b2b banking services, has closed a $200 million Series C round and announced that it’s achieved unicorn status (aka, passing a $1BN valuation).The new funding follows an $83M Series B round last year — when it described its market cap as “increasing healthily”.The Series C is led by New York- and San Francisco-based Nyca Partners, with other new investors including ING Ventures, JPMorgan Chase Strategic Investments and Standard Chartered Ventures — the investment arms of some of its global tier one banking clients.Lloyds Banking Group, which led Thought Machine’s Series A, has also participated in the latest raise.Other existing investors also returning for the Series C are British Patient Capital, Eurazeo, SEB, Molten Ventures (formerly Draper Esprit), Backed, and IQ Capital.UK challenger bank Starling raises $376M, now valued at $1.9BThought Machine describes itself as a “cloud native core banking technology” firm — and is selling cloud-basked banking infrastructure to old and new banks as they look to offer their customers services via the cloud, moving away from mainframe, legacy banking tech (in the case of old school banks) or offering cloud-based services from the get-go in the case of challenger banks and fintech startups.The startup’s Series C follows a period of accelerated growth, with Thought Machine noting it’s added 200+ employees since 2020 and relocating into a larger London HQ to accommodate its expanded headcount.The new funding will be used to continue development and expansion of its flagship SaaS product Vault — a cloud-native platform which its b2b customers rely on to provide a range of retail banking services, from checking accounts, savings accounts, loans and credit cards to mortgages.Vault is built around APIs, using a microservice architecture and a system of Smart Contracts — hosted on a cloud service of the customer’s choosing (the likes of Google Cloud Platform, Microsoft Azure, Amazon Web Services and IBM Cloud are supported) — with touted benefits including increased flexible and more scalable infrastructure, as well as reduced running costs vs maintaining legacy technology.Commenting on the funding in a statement, Paul Taylor, CEO and founder of Thought Machine said: “We are delighted to have earned the support of our new and existing investors as we continue to move the world’s leading banks into the cloud. We set out to eradicate legacy technology from the industry and ensure that all banks deployed on Vault can succeed and deliver on their ambitions. These new funds will accelerate the delivery of Vault into banks around the world who wish to implement their future vision of financial services.”In another supporting statement, Hans Morris, managing partner at Nyca Partners, added: “Thought Machine is the leading technology among the new generation of cloud native core platforms, and as a result it has become the top choice for tier one banks looking to upgrade their core architecture. These institutions tell us that Thought Machine’s engineering approach is unrivalled; Vault is highly configurable, flexible, scalable, and specifically designed for the complex environment and requirements of tier one banks. Investing in Thought Machine is an investment in the future of banking and we are very energized to be working with them as they build a new standard for core banking technology.”Thought Machine nabs $83M for a cloud-based platform that powers banking services", "metadata": "2021-11-28"}
{"text": "Nissan to invest $17.6 billion in EV development over the next five years. Steve DentContributor\t\tSteve Dent is an associate editor at Engadget.\tMore posts by this contributorTesla requires Full Self Driving testers to allow video collection in case of a crashUK will require new homes to have EV chargers starting in 2022Nissan will invest 2 trillion yen ($17.6 billion) over the next five years developing new EVs and battery technology as part of a grand plan it calls “Ambition 2030,” the company announced. It aims to release 15 new EVs total by 2030, with electrified vehicles making up half its vehicle lineup at that point.The automaker said it will develop 23 electrified vehicles in total over the next eight years, with 20 of those coming in the next five years alone. It’s shooting for a market mix of 75 percent electrified (EV and e-Power PHEV/hybrids) in Europe, 55 percent in Japan and 40 percent in the US and China by 2030.The other part of that mix, would presumably be internal combustion engine (ICE) vehicles. It’s worth noting that in early 2021, Nissan said that it planned to electrify every all-new car it launches by the early 2030s. Presumably, then, any ICE vehicles still available would be legacy models.Nissan will launch EVs with all-solid-state batteries (ASSB) by 2028 and ready a pilot plant in Yokohama as early as 2024, it said. That technology promises benefits like reduced charging times, but has yet to arrive to market as expected. The company also wants to bring the cost of battery packs down to $75 per kWh by 2028 with a reduction to $65 kWh further down the road. That would be about half of what EV batteries cost last year, according to Bloomberg. By 2030, Nissan hopes to be producing 130 GWh of batteries.The company said it plans to expand its ProPilot driver assistance technology to over 2.5 million Nissan and Infiniti vehicles by 2026. It will also incorporate next-generation LIDAR systems “on virtually every new model by fiscal year 2030.”NissanAs part of Ambition 2030, Nissan also unveiled no less than four concept cars: the Chill-Out, Surf-Out, Hang-Out and Max-Out. Like most concepts, they’re meant to give a taste of Nissan’s future technology including self-driving, interior features and just far-out designs. However, Nissan has only shown images of the Chill-Out as a real vehicle, with renders of the other three vehicles.The Chill-Out (top and above) is a smallish crossover that could be an early preview of the next-generation Leaf, which Nissan previously confirmed would move from a hatch to a crossover style body. It will use the Ariya’s CMF-EV platform and e-4orce electric all-wheel drive system, and could arrive by 2025.NissanThe Surf-Out, meanwhile, is a small electric single cab pickup with a decent-sized bed and removable canopy. It would come with a dual-motor AWD setup and a variety of power outputs, offering off-road performance, utility power and extended cargo space.NissanThen there’s the Hang-Out, which is more like a small camper van/SUV designed to “provide a new way of spending time on the move.” It has a completely flat floor and movable, theater-like seats, offering “the comfort of your living room in a mobile space” — something we’ve seen with other recent EV concepts. It also offers e-4orce and advanced ProPilot features.NissanFinally, the Max-Out is a concept convertible sports car that offers “superlative stability and comfort.” Body roll is limited to deliver “dynamic cornering and steering response” to optimize handling and occupant comfort. It’s supposedly lightweight with a very low center of gravity, and also offers advanced e-4orce.Nissan’s new plan comes as the company has grappled with internal problems, including the arrest and subsequent flight of former CEO Carlos Ghosn. In the short term, the company plans to cut 300 billion yen ($2.65 billion) in fixed costs and reduce production capacity by 20 percent as part of its “Nissan Next” plan unveiled last year.Editor’s note: This article originally appeared on Engadget.", "metadata": "2021-11-28"}
{"text": "Robotics startup FJDynamics raises $70M to make manual labor easier. FJDynamics, founded by DJI’s former chief scientist Wu Di, just closed a Series B round of $70 million as it advances its goal to empower workers in the harshest environment with robotic technologies.When I asked Wu what’s special about his company’s farming robots, he gave an answer that would make any publicist sweat: “I don’t think our technology is that special.” The startup’s vision, he said, is to make useful and affordable robots for the most labor-intensive industries.“You can have the most advanced AI algorithms,” he continued, “But if the technology doesn’t work on the production line or the farm, because you don’t have any industry experience, then how does your technology benefit people?”The technologies that Wu worked on before FJDynamics were cutting-edge in every sense. At DJI, he served as the chief scientist and oversaw the drone giant’s acquisition of the Swedish format camera maker Victor Hasselblad AB in 2017. Before returning to China, he spent a decade in Sweden, during which he earned a PhD in domain-specific processor design. He also worked as a vice president at fabless semiconductor company Coresonic AB and a director at the Swedish luxury sports car maker Koenigsegg AB.“After seeing all these first-class technologies, it’s a stretch to say we [FJDynamics] are a high-tech company,” said the founder, who donned a slightly faded checkered shirt and a pair of thin-rimmed glasses on the morning of our interview.We were sitting in a makeshift meeting room, a partition comprising a few desks separated from the rest of the open-plan office by movable walls. The company, located in Shenzhen’s bustling tech hub Shenzhen, was fast expanding and approaching 1,000 employees.Wu Di, founder and CEO of FJDynamicsIn 2019, Wu left DJI to start FJDynamics. The company set out with a focus on agricultural robots, building tools like unmanned lawnmowers, orchard sprayers and feed pushing machines. It has since ventured into other fields that depend heavily on manual work, such as construction and manufacturing.As Beijing invokes a digital upgrade in the country’s traditional industries, Chinese companies like FJDynamics are in hot demand by investors. FJDynamics itself has attracted a rank of heavyweight financiers, including Tencent and state-owned automaker Dongfeng Asset Management. DJI had a stake in the company early on but has since sold off its shares.It declined to name its sole investor in its latest Series B round and only said it is a major internet firm in China. The funding, the company said, will allow it to “grow its suite of robotics automation technology across agriculture, facility management, construction and gardening, along with supporting the increasing demand of the company’s ESG product offerings in over 60 countries.”Over the years, a raft of tech talent has left DJI to set up their own shops or join others’ fledgling projects. Portable battery maker EcoFlow, hairdryer Zuvi, electric toothbrush brand Evowera are among the most high-profile ones. For Wu, what drove him away from a prestigious position at the world’s largest drone company was a sense of disconnection he felt making “luxury” hardware.“If you look at how robotic technology is being applied, there are a lot of companies using drones and autonomous vehicles. But the majority of people on earth aren’t benefiting from it.”“Agriculture, construction, gardening… Work conditions in these sectors are physically demanding and there are still a lot of us doing this kind of job. The question is how we use robotic technology to improve their work environment, and that doesn’t mean simply replacing them with robots,” said the founder.Image Credits: FJDynamics’ cow feed pusher, printed with the logo of Sveaverken, a Swedish farming company it acquiredOne of FJDynamics’ popular products is the automated feed pusher. To produce high-quality milk, cows need to be fed about ten times throughout the day. The routine requires farms to have staff on-site 24 hours. A farm with 500 cows, for example, needs about three grass feeders to take shifts. But in poorer countries, farms can’t afford to have as many workers and staff could be out tending to the cows all day even in the coldest season.FJDynamics aims to make farmers’ work easier. Its vision-guided feeder, which costs about 20,000 euros each, can feed up to 500 cows a day. In 2019, it acquired the 110-year-old Swedish farming company Sveaverken, which has helped put the Chinese firm’s feed pushing robots to work.“I never talk about technology to my customers. The farmer is more interested in whether my product can help improve the crop yield,” said Wu. “Every farmer is an economist.”Because of the company’s vision in “making tech affordable”, margins are “modest” and the management is vigilant about operational costs.At the moment, about 40% of the startup’s sales happen outside China across some 60 countries. Many Chinese companies expanding overseas are increasingly cagey about their origin, fearing hostility against anything labeled “Chinese”. Wu takes a more proactive approach.“Even though I’ve lived in Europe for ten years, I can’t rip off my skin. I don’t think that’s important — whether it’s a Chinese, American or Swedish entrepreneur… As long as I build great products and bring benefits to my customers, there will be users.”Data compliance is especially key to a company’s global expansion. FJDynamics provides the hardware and software while its local partners help deploy the “system” using the data. Microsoft Azure is its main cloud partner outside China to allow “elastic deployment while meeting data privacy requirements such as GDPR.”“Our culture is that we don’t want the data,” Wu said.Unlike smartphones or drones that require sophisticated processors, FJDynamics’ products use relatively simple chips that could be found in China, so the firm is likely immune from the recent supply chain disruptions, the founder reckoned.While Wu may not be working on the most advanced technology anymore, he looks for ways to impart his knowledge. When he’s not developing the next farming robot, he lectures at the Southern University of Science and Technology in Shenzhen.“I live a simple life that focuses on two things — product [FJDynamics] and education,” the founder said. “I’ve seen a lot and realized that money can’t change you or make you happier. So you need a simple goal, and achieving the simple goal makes your life happier.”", "metadata": "2021-11-28"}
{"text": "Bessemer Venture Partners Raises $220 Million to Back Founders in India. BANGALORE, India & SAN FRANCISCO--(BUSINESS WIRE)--Bessemer Venture Partners today announced the close of a dedicated $220 million fund in India to build on its long-standing success in the country and back the next generation of innovators in India.The fund will focus primarily on early-stage investments, consistent with Bessemer’s time-honored approach of starting with seed and Series A investments and sticking with companies throughout their growth lifecycle with later stage investments. Bessemer plans to apply its roadmap-driven investment approach to deploy the new capital over five roadmaps across consumer internet and cloud software, including marketplaces, digital health, social commerce, vertical and global SaaS. These roadmaps take a deep look at industries to identify emerging areas and understand the complexities behind the sectors.“We’ve always had a global investment approach and India has long been a focus for us. This new capital allows us to go deeper in the market, while continuing to support our portfolio with Bessemer’s global network and resources. The dedicated fund exemplifies our confidence in the massive growth opportunities within India,” said Vishal Gupta, Partner and Managing Director of the firm’s Bangalore office. “We are excited to not only continue supporting the many companies with whom we already partner, but to expand our investments to even more innovative entrepreneurs who are shaping the future.”“As we look at where innovation is stemming worldwide, it’s clear that the India startup ecosystem is more vibrant than ever,” said Bob Goodman, Partner in Bessemer’s New York office. “We see a sizable market of India-based companies that will disrupt global markets and look forward to leveraging Bessemer’s global platform, deep domain expertise and the insights our team has amassed over the years to help these founders navigate areas that are critical to building and scaling their business.”In tandem with its India fund, the firm welcomed Nithin Kaimal as Chief Operating Officer of Bessemer’s Bangalore office, where he’ll oversee operations, portfolio services, and fund governance. He brings nearly 20 years of expertise across private equity, management consulting and startups, and joins Bessemer from VixCap, an investment management firm he founded and led. Prior to VixCap, Nithin was senior director at India Resurgence Fund (IndiaRF), a leading India-focused investment platform, and began his career at McKinsey & Company.“Nithin joins at a time of incredible growth in the market and brings deep operational expertise that will be invaluable as the firm’s focus within India grows even stronger,” said Bessemer Partner Anant Vidur Puri. “India represents a trillion dollar digital opportunity across consumer internet and SaaS as we predict 500 million more people will engage and transact online in the next ten years. Through this new fund we will continue to partner with the best entrepreneurs who are looking to build for this opportunity within India and beyond.”Bessemer first invested in India 15 years ago and has had a dedicated team of investors on the ground ever since. The firm’s track record in India includes multi-stage investments -- ranging from seed to Series D -- in market-leading companies that are reshaping industries, such as: PharmEasy (pharmacy benefits), BigBasket (online grocery), Swiggy (food delivery), Urban Company (home services) and Perfios (credit underwriting platform). The partnership has realized seven IPOs within India including Home First Finance, IEX and Matrimony.com, and today has five companies within its portfolio valued at more than $1 billion, including Livspace (home interior platform) and MyGlamm (direct-to-consumer beauty).Raising dedicated capital focused on investing in early stage opportunities in India supports the firm’s belief that innovation is borderless and continues its mission of positioning team members across the globe, including in Bangalore, Beijing, Boston, London, New York, Silicon Valley, San Francisco, and Tel Aviv.About Bessemer Venture PartnersBessemer Venture Partners helps entrepreneurs lay strong foundations to build and forge long-standing companies. With more than 135 IPOs and 200 portfolio companies in the enterprise, consumer and healthcare spaces, Bessemer supports founders and CEOs from their early days through every stage of growth. Bessemer’s global portfolio includes Pinterest, Shopify, Twilio, Yelp, LinkedIn, PagerDuty, DocuSign, Wix, Fiverr and Toast and has $9 billion of capital under management. Bessemer has teams of investors and partners located in Tel Aviv, Silicon Valley, San Francisco, New York, London, Boston, Beijing and Bangalore. Born from innovations in steel more than a century ago, Bessemer’s storied history has afforded its partners the opportunity to celebrate and scrutinize its best investment decisions (see Memos) and also learn from its mistakes (see Anti-Portfolio).", "metadata": "2021-11-28"}
{"text": "Mars Growth, a Liquidity Group Fund, Provides Disprz With $5 Million in Funding. NEW YORK--(BUSINESS WIRE)--Mars Growth, a Liquidity Group and MUFG joint venture fund, provided $5 million in growth credit for Disprz, an India-based (Global) enterprises SaaS company that offers an AI and cognitive science-based learning and skilling suite that embeds into businesses, aligns with team goals and ensures breakthrough performance for all types of workforces and industries.The term sheet was provided with Liquidity Group’s usual record breaking speed, which included just 24 hours due diligence utilizing the Liquidity Analysis machine learning platform. The transaction brings Liquidity Groups deployment to companies in excess of $800 million. The company expects to surpass $1 billion by year end 2021.Mars Growth is excited about Disprz’s growth during this era of transformation in both the workplace and in education. Their technology puts them at the forefront of helping businesses prepare their workforce for the new working models of the future. Mars Growth is fully committed to supporting high growth companies with scalable funding that helps them continue to create value and efficiencies in their market. Disprz’s technology-driven approach includes identifying the right skills needed by each business, assessing current levels of employee proficiency, skill-building that turns learning into action, and analytical tools that measure and adapt to ever-evolving needs.“This transaction reflects our strategy of moving at light speed to provide the growth funding companies need to expand and make an impact on the world,” said Ron Daniel, CEO and co-founder of Liquidity Group. “Our machine learning due diligence system enabled us to deploy funding in support of Disprz’s rapid growth.”Founded in 2015, by Subramanian Viswanathan, CEO and Kuljit Chada, COO Disprz has headquarters in Mumbai, India and offices in Chennai, Gurugram, Bangalore, Hyderabad, Bangkok, Singapore, New Jersey, and Dubai. The company seeks to empower business with solutions built with enterprise-grade security that are mobile-friendly and cloud-native. Disprz’s unparalleled agile deployments are tailored to customer needs with swift implementations through plug-and-play configurations. Today more than 200 enterprises including Amazon, Coca-Cola, Uber, and GE Aviation are clients, with more than 1.2 million learners in 120 countries.“Disprz is a pioneering company that helps businesses make sure they have the skills and abilities they need both today and in the future,” said Yaron Primovich, Managing Director of Mars Growth. “We are pleased to partner with Disprz and work with their great team.”“The Mars team not only provided us a great financial alternative to enable accelerated growth but also validated our plans and ambitions through their ‘Liquidity Analysis’ platform,” said Disprz Co-Founder and CEO Subramanian Viswanathan (Subbu). “The entire process was effortless and took just 24 hours before they presented us with a term sheet. Their financing is a great option for us in fueling our growth — it gives us a lot of flexibility on draw-downs and most importantly, provides non-dilutive capital. At Disprz, we empower organizations and teams to find opportunities in disruption. The future belongs to those who are ready for what’s next. We’re here to help organizations thrive by creating a continuous learning and skilling force for their employees.”About Liquidity Group:Founded in 2018, the Liquidity Group is a global capital market credit automation company and fund manager providing growth capital through funds focused on the US, Asia, Europe and the Middle East. Liquidity Group’s subsidiary fund, Singapore-based Mars Growth Capital, and its partner MUFG [MUFG:NYSE] jointly handle the company’s South East Asia activity. It combines real-time data with proprietary machine learning technology to offer tailored financing that matches a company’s future growth. Liquidity Group operates three main divisions: Analysis, Capital, and Market Syndication, which together provide global lenders a complete cycle of scaled and quick credit deployment. https://www.liquiditygroup.comAbout Disprz:Founded in 2015, Disprz has helped more than 200 global organizations redefine their digital skilling and learning experiences by combining the art of learning with the science of software and data. Based in Chennai and Mumbai in India, Disprz has offices in seven countries. Disprz builds skills in the talented people that power global brands. https://disprz.com", "metadata": "2021-11-28"}
{"text": "Principal® Supports Iron Path Capital’s Investment with Versant Diagnostics. DES MOINES, Iowa--(BUSINESS WIRE)--Principal Global Investors®, through its direct lending business, Principal Alternative Credit, announced today it served as sole lead arranger and administrative agent on senior secured credit facilities for Versant Diagnostics, an Iron Path Capital portfolio company, in partnership with Alliance Pathology Consultants.The financing supports Versant Diagnostics emergence as one of the largest, independent, physician-led pathology groups in the Midwest region.“We are pleased to support Iron Path Capital and Versant as they continue to successfully execute their acquisition strategy,” said Doug Koch, managing director for sponsor originations with Principal. “We look forward to the continued growth and expertise that Versant’s talented management team and physician partners will contribute to this newly formed brand.”“Principal delivered by committing to the entire facility in support of Versant,” said Rob Reistetter, co-founder of Iron Path Capital. “Their knowledge in the healthcare sector allowed them to move quickly to provide the optimal financing solution for the transaction, demonstrating their flexibility and ability to execute.”Principal Alternative Credit invests in privately negotiated debt transactions with both sponsor-backed and non-sponsored middle market companies throughout North America that typically have $5 million or more in EBITDA. The direct lending team targets transactions of $25 million to $200 million, with typical hold sizes of $10 million to $50 million.About Principal Global Investors®Principal Global Investors® leads global asset management at Principal®. As a multi-investment team firm, we bring a focused perspective and offer expertise across a host of asset classes.At our core, we are driven by our purpose to help investors and businesses achieve their financial goals. Our global investment professionals deliver investment solutions for public and private pension funds, foundations and endowments, central banks, insurance companies, sub-advisory arrangements, sovereign wealth funds and individual portfolios.Principal Global Investors manages approximately $577.4 billion in assets on behalf of over 800 institutional clients located in over 80 markets as well as retirement plans and individual clients, reflecting our worldwide market reach and experience and our commitment to high-quality research and service (as of September 30, 2021). To find out more, visit us at principalglobal.com.About Versant DiagnosticsFounded in 2021 by leading physicians and operating executives Ven Aduana, M.D., Jim Billington and Brian Carr, Versant Diagnostics is a premier physician services company focused on anatomic pathology, precision medicine, and the digital transformation of the industry. Its areas of focus include urology, dermatology, women’s health, gastroenterology and hematology. Versant is based in Chicago, IL, with a view to consolidate the largest independent pathology platform in the nation. Learn more at www.versantdx.com.About Iron Path CapitalFounded in 2021 by seasoned investors and operating executives Rob Reistetter and Scott Mraz, Iron Path Capital is a private equity firm that specializes in building great businesses in the healthcare and specialty industrials sectors. With offices in Nashville, TN, and Charlottesville, VA, Iron Path Capital supports management teams with strategic leadership, operational expertise and flexible capital to achieve visionary growth plans through defined, defensible execution. Learn more at www.ironpathcapital.com.The recent transaction profiled above are intended to demonstrate the application of Principal Alternative Credit investment strategy and represents middle marketing lending transactions previously entered by Principal Alternative Credit. There is no guarantee that any future transactions entered will have the characteristics like the deals profiled above.© 2021 Principal Financial Services, Inc. Principal®, Principal Financial Group®, and Principal and the logomark design are registered trademarks of Principal Financial Services, Inc., a Principal Financial Group company, in the United States and are trademarks and services marks of Principal Financial Services, Inc., in various countries around the world.", "metadata": "2021-11-28"}
{"text": "Upbound Raises $60M in Funding from Altimeter Capital, GV, Intel Capital and Others To Advance its Universal Cloud Management Platform. SEATTLE--(BUSINESS WIRE)--Upbound, the cloud management platform company behind the popular open source Crossplane project, today announced that it raised $60M in new funding. The new funding includes a Series B round led by Altimeter Capital with participation from GV, Intel Capital, and Telstra Ventures. The funding follows 10x quarter-over-quarter recurring revenue growth fueled by Crossplane adoption and enterprise demand for Upbound’s product offering. Upbound will use the funding to broaden its worldwide go-to-market efforts, accelerate product development, and expand its services and support offerings. To-date, Upbound has raised $69 million.“We believe that Upbound is distinctly positioned to be the convergence point for cloud infrastructure,” said Ram Woo, partner at Altimeter Capital. “The Crossplane project they invented builds on the momentum of the cloud-native community, and the company's remarkable growth is a testament to the Kubernetes-first approach desired by platform engineers. We have been watching Upbound for a while and are excited to partner with Bassam and team.”With the rise of Kubernetes and the cloud-native movement, enterprise infrastructure is undergoing a wave of modernization not seen since the dawn of cloud computing. Legacy Infrastructure-as-Code tooling is no longer adequate to manage multiple cloud vendor environments, deploy applications into different clouds, and accelerate the application development cycle. Upbound created Crossplane in 2018 to offer the cloud-native community a Universal Control Plane for this new era of cloud computing. For the first time, the industry has rallied around a consistent, declarative, and vendor-neutral API for the cloud.Upbound’s Universal Cloud Platform makes it easy for enterprises to transform their internal operations into a comprehensive cloud platform, simplifying infrastructure management and empowering developers with self-service capabilities. In an era where cloud computing is heading towards more horizontal integration, enterprises can truly achieve a single point of control for all their teams, applications, workloads and vendors. Infrastructure managed via Upbound adheres to an organization's policy guardrails and is continuously reconciled, simplifying Day 2 operations, eliminating configuration drift entirely, and enabling a much higher degree of automation than was previously possible.“We’re going all-in on the Universal Control Plane approach Upbound is bringing to market,” said Sidarta Oliveira, Director of Infrastructure & Cloud at Grupo Boticário. “Thanks to Upbound, we’re rapidly transforming our approach to infrastructure management and application development and are able to bring the same cloud native practices and tooling to both our operator and developer teams.”Founded by open source industry veteran and Rook co-creator Bassam Tabbara in 2017, Upbound is quickly being recognized by leading enterprises around the world that have adopted Kubernetes. Enterprise customers are integrating Upbound into their existing software delivery pipelines enabling “GitOps for everything” workflows. Crossplane and Upbound work out of the box with thousands of tools and products in the cloud native ecosystem. In addition, cloud and Infrastructure vendors are building specific integrations into Crossplane.“We are witnessing a convergence effect on Crossplane as a Universal Control Plane for the cloud that is built on top of Kubernetes and solid cloud native abstractions,” said Chris Aniszcyk, CTO at Cloud Native Computing Foundation (CNCF). “Upbound has done a phenomenal job stewarding the project by building a diverse open community around Crossplane. The CNCF is thrilled to cultivate and support the Crossplane project in its next evolution of growth.\"“We started Upbound four years ago realizing the industry was at a pivotal moment, and that customers more than ever wanted to consume services and deploy abstractions across multiple vendors,” said Upbound Founder and CEO Bassam Tabbara. “We see platform engineering teams everywhere building their own internal modern day Heroku. Today’s funding announcement ensures we continue to help them on their journey with innovative products and services.”The company recently announced a fully self-hosted, self-managed version of its Universal Cloud Platform with strict security requirements in response to customer demand. Upbound also continues to invest in the open source Crossplane community. The company recently donated a code generation project to ensure operators using legacy Infrastructure-as-Code tooling can easily switch over to a modern control plane architecture, as Upbound continues to be at the forefront of innovation in the space.About UpboundCreated in 2017, Upbound is a leading enterprise cloud management platform and the company behind the open source Crossplane project. Crossplane is designed for platform teams looking for a cloud-native infrastructure management solution. Customers use Upbound’s Universal Cloud Platform to transform their internal operations into a comprehensive cloud computing platform, simplifying infrastructure management and empowering developers with self-service capabilities. As a fully remote company, Upbound is backed by leading investors, including Altimeter, GV, Intel Capital, and Telstra Ventures. Learn more at upbound.io and follow us at @upbound_io.", "metadata": "2021-11-28"}
{"text": "Thought Machine raises $200m in Series C funding to bring world’s banks to the cloud. LONDON--(BUSINESS WIRE)--Thought Machine, the cloud native core banking technology firm, today announces the close of its series C funding round, bringing $200m into the business from new and existing investors. This new round sees Thought Machine achieve unicorn status.This round was led by Nyca Partners, a New York and San Francisco-based venture capital firm, with investment also coming from the investment arms of some of Thought Machine’s global tier one banking clients – ING Ventures, JPMorgan Chase, and Standard Chartered Ventures. Existing investors Lloyds Banking Group, British Patient Capital, Eurazeo, SEB, Molten Ventures (formerly Draper Esprit), Backed, and IQ Capital have all participated in the round.This announcement follows a period of accelerated growth as Thought Machine executes its internationalisation strategy and continues to deploy cloud native core banking technology into the world’s most ambitious banks and fintechs.In October 2021, Thought Machine relocated to a larger London HQ to support its headcount growth after adding more than 200 employees since 2020.Thought Machine will be using the funding to continue developing and expanding Vault. The firm intends to further develop Vault and its Universal Product Engine, which allows for unparalleled flexibility in product development and configuration. The company will expand its international reach, strengthening its five global offices and targeting new key markets to accelerate the adoption of cloud native core banking globally.Founded in 2014 by former Google engineer Paul Taylor, Thought Machine provides modern, cloud native core banking technology to some of the largest and most ambitious banks in the world. Many of Thought Machine’s investors are also clients, including Lloyds Banking Group, Standard Chartered, SEB and others – signalling to the market Thought Machine’s critical role in the future of global banking technology.QuotesPaul Taylor, Chief Executive Officer and Founder, Thought Machine:We are delighted to have earned the support of our new and existing investors as we continue to move the world’s leading banks into the cloud. We set out to eradicate legacy technology from the industry and ensure that all banks deployed on Vault can succeed and deliver on their ambitions. These new funds will accelerate the delivery of Vault into banks around the world who wish to implement their future vision of financial services.Hans Morris, Managing Partner, Nyca Partners:Thought Machine is the leading technology among the new generation of cloud native core platforms, and as a result it has become the top choice for tier one banks looking to upgrade their core architecture. These institutions tell us that Thought Machine’s engineering approach is unrivalled; Vault is highly configurable, flexible, scalable, and specifically designed for the complex environment and requirements of tier one banks. Investing in Thought Machine is an investment in the future of banking and we are very energized to be working with them as they build a new standard for core banking technology.Alex Manson, Head of SC Ventures, Standard Chartered:The deployment of Thought Machine is tied to our digital banking strategy, as we have adopted Thought Machine as the core banking software for our digital banks in Singapore and Hong Kong. Thought Machine’s cloud-native and agnostic technology stack offers agile and easily replicable deployment across markets, boosting our ability to roll out efficient digital banks with great customer experience in other markets. Digital Banking is one of our high-conviction themes, as we strongly believe finance should be a seamless experience embedded in our customers’ lifestyles. This will continue to be a focus area for SC Ventures.-- ENDS --About Thought MachineThought Machine was founded in 2014 with a mission to enable banks to deploy modern systems and move away from the legacy IT platforms that plague the banking industry. We do this through our cloud native core banking platform, Vault. This next generation system has been written from scratch as an entirely cloud native platform. It does not contain a single line of code which is legacy, or pre-cloud.We are currently a team of more than 500 people spread across offices in London, New York, Singapore, Sydney, and Melbourne, and have raised more than $340m in funding at a $1bn+ valuation.For more information visit thoughtmachine.net", "metadata": "2021-11-28"}
{"text": "Immusoft Receives $4M in Funding from the California Institute for Regenerative Medicine (CIRM). SAN FRANCISCO--(BUSINESS WIRE)--Immusoft of CA, a wholly owned subsidiary of Immusoft Corporation, a cell therapy company dedicated to improving the lives of patients with rare diseases, announced today that the California Institute for Regenerative Medicine (CIRM) has awarded the company a $4M grant to support the development of its ISP-002 (for delivery of iduronate sulfatase) program in mucopolysaccharidosis type II (MPS II), an inherited disease for which patients have limited options.MPS II is a rare genetic disease in children, which causes abnormalities across many organs, including the heart and lungs, and the musculoskeletal system. If untreated, individuals with severe MPS II will not live past their teen years. Currently available treatments for MPS II do not sufficiently provide therapeutic agents at stable levels, resulting in considerable residual burden of disease.Immusoft’s therapeutic is specially tailored to combine a cell therapy with a gene-encoded medicine. In the case of ISP-002, the patient’s own B cells are programmed to express the therapeutic enzyme iduronate sulfatase (IDS). In healthy individuals, IDS contributes to the breakdown of glycosaminoglycans (GAGs), which are harmful at high levels. Once clinical testing is initiated for ISP-002, the cells will be delivered back to the patient where they are expected to release IDS at therapeutic levels, around the clock – potentially for years.“ISP-002 has the potential to address a significant unmet need in children who suffer from mucopolysaccharidosis type II (MPS II). Preclinical data suggests ISP-002 can meaningfully reduce accumulated glycosaminoglycans in various tissues, and our approach also holds the potential to provide patients with durable delivery of the therapeutic continuously,” said Sean Ainsworth, Chief Executive Officer, Immusoft. “We are honored that CIRM has recognized the potential value of ISP-002 and we look forward to advancing our candidate into clinical trials in this rare genetic disease where patients have limited options.”“Our goal is to always move the most promising research forward as fast as we can,” said Dr. Maria Millan, President and Chief Executive Officer, California Institute of Regenerative Medicine (CIRM). “That’s why these programs are so important. They reflect potential therapeutic approaches that have shown promise in the lab and are ready to take the next step, to undergo further testing and examination to see if they might be able to work in patients.”Immusoft is developing a new modality of gene delivery that holds the promise of being both durable and re-dosable. There is significant potential across multiple high-value disease states to replace suboptimal standard of care, beginning with Hurler Syndrome (MPS I). Immusoft’s lead candidate ISP-001 is expected to enter Phase I clinical trials for MPS I in 2022. The current standard of care for MPS I is enzyme replacement therapy (ERT), and there is a significant unmet need for new therapies with improved efficacy and convenience.About ImmusoftImmusoft of CA is a wholly owned subsidiary of Immusoft Corporation. Immusoft is a cell therapy company focused on developing novel therapies for rare diseases using a sustained delivery of protein therapeutics from a patient’s own cells. The company is developing a technology platform called Immune System Programming (ISP™), which modifies a patient’s B cells and instructs the cells to produce gene-encoded medicines. The B cells that are reprogrammed using ISP become miniature drug factories that are expected to survive in patients for many years. The company is based in Seattle, WA. For more information, visit www.immusoft.com.About CIRMAt CIRM, we never forget that we were created by the people of California to accelerate stem cell treatments to patients with unmet medical needs, and act with a sense of urgency to succeed in that mission.To meet this challenge, our team of highly trained and experienced professionals actively partners with both academia and industry in a hands-on, entrepreneurial environment to fast track the development of today’s most promising stem cell technologies.With $5.5 billion in funding and more than 150 active stem cell programs in our portfolio, CIRM is the world’s largest institution dedicated to helping people by bringing the future of cellular medicine closer to reality.For more information go to www.cirm.ca.gov", "metadata": "2021-11-28"}
{"text": "Pibox, a Ukraine-Based Platform for Musicians and Creators, Completes $400K Pre-Seed Raise and Joins Techstars Toronto. TORONTO--(BUSINESS WIRE)--Pibox, the SaaS platform for team collaboration with media files, was accepted into the latest cohort at Techstars Toronto. The Ukraine-based company has raised $400,000 from Techstars along with Adventures Lab, Globalive Capital, 70 Ventures, and Presto Ventures. Techstars is a fully remote program that began in October 2021 and ends with a demo day on January 11, 2022.\"The management of Techstars has long followed our progress; we have been growing quickly and our client base includes Universal, Epidemic Sound, Sony, Red Bull, National Gallery of Art (Washington), and Michigan Technological University,” says Ivan Talaychuk, co-founder of Pibox. “With this fundraise, we intend to expand our team, develop our go-to-market across multiple creative verticals, and continue building our product capabilities as we develop our brand positioning for video and podcast productions, branding agencies, and media industry specialists.\"The platform provides customers with an easy-to-use interface that makes it possible to structure workflows alongside content. By using media files inside the application, the customer can leave comments, draw on video, and select crucial moments with an accuracy of milliseconds. Chat and fixed storage structures are also available. Pibox replaces several programs used for communication by a creative team, school, or project, including between a customer and contractor; examples include mail, messenger, file hosting service, and task manager.“We are excited to invest in Pibox and look forward to working with the ambitious team to help them scale into the North American market,” adds Sunil Sharma, Managing Director of Techstars Toronto.About Pibox:Pibox is an all-in-one service for team collaboration with media files. The company was founded in 2017 in Ukraine by two brothers — Ivan and Pavel Talaychuk. Pibox's current clients include major creative and music companies such as Universal, Epidemic Sound, and Sony as well as educational institutions such as Michigan Technological University and the National Gallery of Art. Please visit https://pibox.com/ for more information.", "metadata": "2021-11-28"}
