{"text": "Jefa raises $2 million to offer digital accounts for women in LATAM. Fintech startup Jefa has raised a $2 million seed round to build a fintech startup offering digital accounts with a product specifically designed for women living in Latin America and the Caribbean. The company has managed to attract 115,000 women on its waitlist and participated in TechCrunch’s Startup Battlefield last year.Investors in Jefa include The Venture Collective, DST Global, Foundation Capital, Amador Holdings, The Fund, FINCA Ventures, Rarebreed VC, Siesta Ventures, Springbank Collective, Bridge Partners, Hustle Fund, Foundation Capital, Latitud, J20 and Magma Partners. Several business angels also participated, such as Daniel Bilbao, JP Duque, Ricardo Schaefer, Jean-Paul Orillac and Allan Arguello.In addition to this founding round, the startup has also signed a deal with Visa. It’s a multi-year strategic partnership agreement. Jefa will be able to take advantage of Visa’s resources and products to create its payment products and more.“Visa believes in empowering women,” senior director of fintech partnerships for Visa Latin America and the Caribbean Sonia Michaca said in a statement. “Financial and digital inclusion transform economies. Women, who control the lion-share of everyday household spending, should be at the core of this transformation, yet women are vastly underserved by traditional banks. We are thrilled to be partnering with Jefa, a women-led platform in Latin America and the Caribbean, and one which explicitly serves women’s financial needs in the region.”  The team behind Jefa believes that banks have neglected women for too long. Even challenger banks have mostly been designed for male customers in the first place. It doesn’t necessarily mean that women can’t open an account with a challenger bank. But some product decisions are unfriendly to women.Back when Jefa founder and CEO Emma Smith pitched at TechCrunch Disrupt, she listed some of the reasons why most people in Latin America who don’t currently have a bank account are women. For instance, minimum balance requirements are hostile to women who statistically earn less than men.When Jefa launches, the company will let you open a digital account for free from a mobile app. You don’t have to visit a bank branch. A few days later, you’ll receive a Visa debit card. There will be a built-in savings feature and a reward program.The startup plans to roll out its product in Mexico first, then Colombia and Central America. Jefa isn’t the first fintech startup trying to branch out from the unified banking offering. There are several startups trying to create vertical banks, such as banks for kids (Greenlight or Step) or banks for climate change-focused customers (Aspiration). And there’s now Jefa offering digital accounts for women.Image Credits: JefaJefa is a challenger bank for women without a bank account"}
{"text": "Flowrite is an AI writing productivity tool that wants to help you hit inbox zero. When TechCrunch asks Flowrite if it’s ‘Grammarly on steroids’, CEO and co-founder Aaro Isosaari laughs, saying that’s the comment they always get for the AI writing productivity tool they’ve been building since late summer 2020 — drawing on early access to OpenAI’s GPT-3 API, and attracting a wait-list of some 30,000 email-efficiency seeking prosumers keen to get their typing fingers on its beta.The quest for ‘Inbox zero’ — via lightning speed email composition — could be rather easier with this AI-powered sidekick. At least if you’re the sort of person who fires off a bunch of fairly formulaic emails each and every day.What does Flowrite do exactly? It turns a few instructions (yes you do have to type these) into a fully fledged, nice to read email. So where Grammarly helps improve a piece of (existing) writing, by suggesting tweaks to grammar/syntax/style etc., Flowrite helps you write the thing in the first place, so long as the thing is email or some other professional messaging type comms.Email is what Flowrite’s AI models have been trained on, per Isosaari. And frustration with how much time he was having to spend composing emails was the inspiration for the startup. So its focus is firmly professional comms — rather than broader use cases for AI-generated words, such as copy writing etc (which GPT-3 is also being used for).Grammarly raises $200M at a $13B valuation to make you an even better writer using AI“In my previous work I knew that this is a problem that I had — I’d spend several hours every day communicating with different stakeholders on email and other messaging platforms,” he says. “We also knew that there are a lot more people — it’s not just our problem as co-founders; there’s millions of people who could benefit from communicating more effectively and efficiently in their day to day work.”Here’s how Flowrite works: The user provides a set of basic (bullet pointed) instructions covering the key points of what they want to say and the AI-powered tool does the rest — generating a full email text that conveys the required info in a way that, well, flows.Automation is thus doing the wordy leg work of filling in courteous greetings/sign-offs and figuring out appropriate phrasing to convey the sought for tone and impression.Compared to email templates (an existing tech for email productivity), Isosaari says the advantage is the AI-powered tool adapts to context and “isn’t static”.One obvious but important point is that the user does also of course get the chance to check over — and edit/tweak — the AI’s suggested text before hitting send so the human remains firmly the agent in the loop.Isosaari gives an example use-case of a sales email where the instructions might boil down to typing something like “sounds amazing • let’s talk more in a call • next week, Monday PM” — in order to get a Flowrite-generated email that includes the essential details plus “all the greetings” and “added formalities” the extended email format requires.(Sidenote: Flowrite’s initial pitch to TechCrunch was via email — but did not apparently involve the use of its tool. At least the email did not include a disclosure that: “This email is Flowritten” as a later missive from Isosaari (to send the PR as requested) did. Which, perhaps, gives an indication of the sorts of email comms you might want to speed-write (with AI) and those you maybe want to dedicated more of your human brain to composing (or at least look like you wrote it all yourself).)“We’ve built an AI powered writing tools that helps professionals of all kinds to write and communicate faster as part of their daily workflow,” Isosaari tells TechCrunch. “We know that there’s millions of people who spend hours every day on emails and messages in a professional context — so communicating with different stakeholders, internally and externally, takes a lot of work, daily working hours. And Flowrite helps people to do that faster.”The AI tool could also be a great help to people who find writing difficult for specific reasons such as dyslexia or because English is not their native language, he further suggests.One obvious limitation is that Flowrite is only able to turn out emails in English. And while GPT-3 does have models for some other common languages, Isosaari suggests the quality of its ‘human-like’ responses there “might not be as good” as they are in English — hence he says they’ll remain focused there for now.They’re using GPT-3’s language model as the core AI tech — but have also, recently, begun to use their own accumulated data to “fine tune it”, with Isosaari noting: “Already we’ve built a lot of things on top of GPT-3 as opposed to building a wrapper on it.”The startup’s promise for the email productivity tool is also that the AI will adapt to the user’s writing style — so that faster emails won’t also mean curtly out of character emails (which could lead to fresh emails asking if you’re okay?).Isosaari says the tech is not not mining your entire email history to do this — but rather only looks at the directly preceding context in an email thread (if there is one).Flowrite does also currently rely on cloud processing, since it’s calling GPT-3’s tech, but he says they want to move to on-device processing, which would obviously help address any confidentiality concerns, when we ask about that.For now the tool is browser-based and integrates with web email. Currently it only works for Chrome and Gmail but Isosaari confirms the team’s plan is to expand integrations — such as for messaging platforms like Slack (but still initially at least, only for the web app version).While the tech tool is still in a closed beta, the startup has just announced a $4.4 million seed raise.The seed is led by Project A, along with Moonfire Ventures and angel investors Ilkka Paananen (CEO & Co-founder of Supercell), Sven Ahrens (director of global growth at Spotify), and Johannes Schildt (CEO & Co-Founder of Kry). Existing investors Lifeline Ventures and Seedcamp also joined in the round.What types of emails and professionals is Flowrite best suited for? On the content side, Isosaari says it’s “typically replies where there’s some kind of existing context that you are responding to”.“It’s able to understand the situation really well and adapt to it in a really natural way,” he suggests. “And also for outreaches — things like pitches and proposals… What it doesn’t work that well for is if you want to write something that is really, really complex — because then in order to do that you would need to have all that information in the instructions. And then obviously if you need to spend a lot of time writing the instruction that could be even close to the final email — and there’s not much value that Flowrite can provide at that point.”It’s also obviously not going to offer great utility if you’re firing off “really, really short emails” — since if you’re just answering with a couple of words it’s likely quicker to type that yourself.In terms of who’s likely to use Flowrite, Isosaari says they’ve had a broad range of early adopters seeking to tap into the beta. But he describes the main user profile as “executives, managers, entrepreneurs who communicate a lot on a daily basis” — aka, people who “need to give a good impression about themselves and communicate very thoughtfully”.On the business model front, Flowrite’s initial focus is on prosumers/individual users — although Isosaari says it may look to expand out from there, perhaps first supporting teams. And he also says he could envisage some kind of SaaS offering for businesses down the line.Currently, it’s not charging for the beta — but does plan to add pricing early next year. “Once we move out of the beta then we’ll be starting to monetize,” he adds, suggesting that a full launch out of beta (so no more waitlist) could happen by mid 2022. The seed funding will primarily be spent on growing the team, according to Isosaari, especially on the engineering side — with the main goal at this early stage being to tool up around AI and core product.Expanding features is another priority — including adding a “horizontal way” of using the tool across the browser, such as with different email clients.This report was updated to clarify a quotation by Isosaari as he intended to say Flowrite is not just building a wrapper for GPT-3 but rather that it’s building on top of itOkay, the GPT-3 hype seems pretty reasonable"}
{"text": "Blockade Games Raises $5M at $23M Valuation. NEW YORK--(BUSINESS WIRE)--Blockade Games, the leading blockchain video game studio, has today announced the close of a $5 million seed extension at a $23 million valuation co-led by Animoca Brands and Digital. Other investors include Drew Austin from Redbeard Ventures, Flamingo DAO, Galaxy Interactive, Roham Gharegozlou from Dapper Labs, Keith Grossman from TIME and Meltem Demirors from Coinshares.Additionally, the raise includes a recommitment from Blockade’s early investors including Xsquared Ventures and Polygon.CEO and Co-founder of Blockade Games, Marguerite deCourcelle said: “We’re thrilled by the support of so many investors and fellow entrepreneurs who believe in our mission of making NFTs more accessible to the masses.”CTO and Co-founder of Blockade Games, Ben Heidorn added: “NFTs provide immense possibilities for game developers to engage with their community. We're excited to ramp up our efforts to explore creative new ways for players to immerse and express themselves.”The financing will contribute to the expansion of the company through hiring, game development, partnerships, and marketing efforts focused on community engagement and user growth.Robby Yung, CEO of Animoca Brands’ North American Operations, said: “We're pleased to be leading this investment round into Blockade Games. The team are amongst the most experienced veterans of the blockchain game industry, and they really understand the power of bringing tokenomics to games. We are looking forward to building the open metaverse together!”Mike Dudas, co-founder of 6th Man Ventures said: “The Blockade Games team is one of the most inventive groups of people in the gaming industry. In addition to pioneering free to play NFT gaming, they have introduced tens of thousands of players to blockchain-based games and layer 2 technology. They have illuminated the way for an entire class of developers and gamers while creating consistently novel, exciting and easy to understand experiences that we expect millions of people to enjoy in the coming years.”Mark Daniel, co-founder and Managing Partner of Digital said: “Blockade Games has taken a long-term, methodical approach to designing Neon District, which is exceedingly rare in today's market. That thoughtfulness has laid a foundation that can support millions of players, and we couldn't be more excited to partner with Marguerite and the team on that journey.”Alex Amsel aka Sillytuna from Soulcast said: “I'm excited to see Blockade continue to innovate in the realm of NFTs and cyberpunk gaming, bringing their blend of creativity and new technology to new audiences.”To date, Blockade Games has a user base of 100,000 and has created 11K+ new users in the past month. The game has 177K+ unique asset owners and 2.1M+ Season 1 NFTs have been minted.About Blockade GamesBlockade Games is a leading blockchain video game development studio and parent company of Neon District, Plasma Bears, and Pineapple Arcade. Founded in 2018 by Marguerite deCourcelle, also known as Coin Artist, Diego Rodriguez and Ben Heidorn, Blockade Games is one of the earliest metaverse companies to market. We are developing blockchain layer two infrastructure and gaming applications, in particular, our flagship game, Neon District which is a free-to-play, play to earn cyberpunk role-playing game featuring collectible NFTs on Polygon and Ethereum.About Animoca Brands:Animoca Brands, ranked in the Financial Times list of High Growth Companies Asia-Pacific 2021, is a leader in digital entertainment, blockchain, and gamification. It develops and publishes a broad portfolio of products including the REVV token and SAND token; original games including The Sandbox, Crazy Kings, and Crazy Defense Heroes; and products utilizing popular intellectual properties including Formula 1®, Disney, WWE, Power Rangers, MotoGP™, and Doraemon. The company has multiple subsidiaries, including The Sandbox, Blowfish Studios, Quidd, GAMEE, nWay, Pixowl, Bondly, and Lympo. Animoca Brands has a growing portfolio of more than 100 investments in NFT-related companies and decentralized projects that are contributing to building the open metaverse, including Axie Infinity, OpenSea, Dapper Labs (NBA Top Shot), Bitski, Harmony, Alien Worlds, Star Atlas, and others. For more information visit www.animocabrands.com or follow on Twitter or Facebook.About Digital:Digital is an investment platform founded by Mark Daniel, Benjamin Milstein, and Steve Cohen focused on investing across the metaverse, from NFT projects to blockchain infrastructure."}
