{"text": "Transport Investments, Inc. Invests in US Logistics, LLC and Nationwide Logistics, LLC. PITTSBURGH, Nov. 29, 2021 /PRNewswire/ -- Transport Investments, Inc. (\"Transport\"), a leading provider of heavy haul, flatbed, and specialized transportation and logistics services throughout North America, announced today that it has invested in US Logistics, LLC and Nationwide Logistics, LLC (together, \"USLN\").Based in Cincinnati, OH, USLN is one of the most recognized and respected specialty freight brokerage groups in North America. USLN, through its network of independent agents, connects industrial, consumer, and other specialty transportation customers with its vast network of third-party carriers and resources.R. Bruce McAdams, CEO of Transport, commented, \"USLN's market reputation, talented agents, deep customer relationships, and carrier following are complementary to Transport's capacity and other value-added solutions. We were immediately impressed by the USLN management team, and we look forward to working with Jeff, Doug, Sarah, Katie, and the rest of their team, as we forge together and create a highly differentiated transportation group.\"Jeff Hiatt, Co-Founder of US Logistics, noted, \"We view Transport as one of the leading platforms in the transportation market, and we are thrilled to partner with them on this next phase of growth.\" Further, Sarah Long, Founder of Nationwide Logistics, added, \"The combination with Transport will help fuel growth and expansion opportunities for USLN, our agents, customers, employees, and carrier partners. We look forward to serving our current and new customers with the same leading service the market has come to expect from USLN.\"ABOUT USLN US Logistics, LLC and Nationwide Logistics, LLC are highly recognized and respected specialty freight brokerage providers in North America. USLN offers predominantly full truckload (heavy haul, flatbed, specialty, step-deck, van, and refrigerated) transportation brokerage and logistics services through a national network of agents. For more information, visit www.uslfreight.com or www.nationwidelogistics.net.ABOUT TRANSPORT Transport Investments, Inc. is a leading provider of heavy haul, flatbed, and specialized transportation and logistics services throughout North America. As one of the largest carrier groups in the United States and Canada, the combined group handles annual volume of over 375,000 loads through its network of terminals, owner-operators and carriers. Gemspring Capital invested in Transport in 2021. For more information, visit www.transportinvestments.com.ABOUT GEMSPRING CAPITAL Gemspring Capital, a Westport, Connecticut-based private equity firm with $1.5 billion of capital under management, provides flexible capital solutions to lower middle market companies. Gemspring partners with talented management teams and takes a partnership approach to helping drive revenue growth and value creation. Target companies have up to $500 million in revenue and are in the business services, industrial services, software and tech-enabled services, aerospace & defense, consumer services, financial and insurance services, healthcare services, or specialty manufacturing sectors. For more information, visit www.gemspring.com.Contact: Geoff Broglio [email protected]SOURCE Gemspring Capital Related Links www.gemspring.com", "metadata": "2021-11-21"}
{"text": "Ablaze Pharmaceuticals Launches with $75m Series A Financing to Bring Novel Targeted Radiopharmaceuticals to Treat Cancer Patients in the Greater China MarketUSA - EnglishEspaña - español. SHANGHAI and SAN DIEGO, Nov. 29, 2021 /PRNewswire/ -- Ablaze Pharmaceuticals (\"Ablaze\"), a clinical-stage pharmaceutical company focused on the development and commercialization of innovative targeted radiopharmaceutical therapies (TRT) against tumor targets, announced a $75 million Series A financing round. The financing was co-led by Vivo Capital and AdvanTech Capital with participation from RAYZ Investments, Nan Fung Life Sciences, Pivotal bioVenture Partners China, venBio Partners, Samsara BioCapital and Venrock Healthcare Capital Partners. \"Targeted radiopharmaceutical therapies represent the next foundational modality to treat cancer,\" said Dr. Ken Song, co-founder and Chairman of the Board of Ablaze and President and CEO of RayzeBio, Inc. \"In forming Ablaze, we realized to be successful, it was critical to have a company focused on the China market and focused on radiopharmaceuticals.\"With TRT gaining broader interest and adoption, Ablaze was formed to become the leading radiopharmaceutical company to introduce TRT products to the Greater China market. Led by an experienced team and a strong investor syndicate, Ablaze started on a solid footing, anchoring with a strategic RayzeBio in-licensing agreement, and a partnership with an academic institution on a clinical stage asset. Upon closure of the Series A, Ablaze is also actively exploring other potential partnerships, and building strong internal development capabilities.\"TRT is an emerging field that has already demonstrated tremendous clinical efficacy in treating cancer worldwide. We are privileged to have an opportunity to partner with Ablaze and the RayzeBio team in developing this category of potentially life-saving therapeutics for cancer patients in China.\" said Dr. Hongbo Lu, Managing Partner of Vivo Capital.Proceeds from the Series A financing will be used by Ablaze to establish a leading pipeline of advanced TRT products for the treatment of solid tumors, expand the leadership team, build up infrastructure for radiopharmaceuticals and secure further strategic collaborations. The board of directors include Dr. Alex Qiao, co-founder and President and CEO of Ablaze Pharmaceuticals, Dr. Hongbo Lu, Benjamin Qiu, Partner at AdvanTech Capital, Dr. Aaron Royston, Managing Partner at venBio Partners, and Dr. Ken Song as well as Norman Tse, Vice President at Nan Fung Life Sciences as board observer.\"We believe Ablaze is bringing world class design of TRT products as well as clinical expertise to China through collaborations with global leaders in TRT, and is determined to be a leading player in China's TRT innovations\" said Mr. Benjamin Qiu.\"We are excited about this opportunity to bring a novel class of therapeutic products to benefit patients in China,\" said Dr. Alex Qiao. \"This investment from top tier investors in China and abroad provides a strong endorsement to Ablaze's vision and business model. We look forward to creating the best and differentiated medicines to address unmet medical needs in China.\"About Ablaze PharmaceuticalsFounded in 2021, Ablaze Pharmaceuticals is a clinical-stage pharmaceutical company with a mission to bring advanced targeted radiopharmaceutical therapies (TRT) to benefit cancer patients in China. Since its inception, Ablaze has secured a partnership with RayzeBio, Inc., an innovative radiopharmaceutical company based in San Diego CA, to gain exclusive development and commercial right to a series of RayzeBio's products in the greater China region. Leveraging its team's extensive business experience and network in cross-border product development and deal making, Ablaze strives to become the leader and the partner of choice in the emerging TRT market in China by working with strategic business partners in both China and abroad. For more information, please visit www.ablazepharma.comAbout Vivo CapitalFounded in 1996, Vivo Capital is a global investment firm focused on healthcare. Vivo has approximately $5.8 billion in assets under management, invested in over 310 public and private companies worldwide. The firm is headquartered in Palo Alto, California, with additional offices in Asia.  The Vivo team consists of more than 50 multi-disciplinary professionals, including, physicians, scientists, entrepreneurs, operating executives, and industry experts.Vivo provides a multi-fund investment platform, covering growth equity, private equity including buyout, venture capital, and public equity. Vivo invests broadly in healthcare across all fund strategies, including biotechnology, pharmaceuticals, medical devices, and healthcare services, with a focus on the largest healthcare markets.About AdvanTech CapitalLaunched in January 2016, AdvanTech Capital is a private equity fund, focused on innovation-driven growth capital in China. AdvanTech, focuses on healthcare and TMT / e-Services sectors, is managed by over a dozen seasoned investment professionals with local and overseas educational background, as well as diversified and in-depth local knowledge, practical deal execution capabilities and experiences.About Nan Fung Life Sciences & Pivotal bioVenture Partners ChinaNan Fung Life Sciences is a global life sciences investment platform with a long-term capital commitment from the Nan Fung Group. The team possesses diverse experience with long track records in company formation, venture capital, growth/buyout investments, and drug discovery and development. For more information, please visit https://www.nanfunglifesciences.com Pivotal bioVenture Partners China, a member of Nan Fung Life Sciences, is a venture capital firm specializing in the healthcare and life sciences industry. Its investment strategy is centered on identifying promising innovative products and technologies and bringing them to build out new companies in China. For more information, please visit https://www.pivotalbiovp.cn SOURCE Ablaze Pharmaceuticals", "metadata": "2021-11-21"}
{"text": "Alexandria Venture Investments, One of the Year's Top Five Most Active U.S. Investors in Agrifoodtech, Accelerates Its Mission-Critical Investment Activity in a Sector Experiencing Tremendous Upsurge in Venture Funding. PASADENA, Calif., Nov. 29, 2021 /PRNewswire/ -- Alexandria Venture Investments, the strategic venture capital platform of Alexandria Real Estate Equities, Inc. (NYSE: ARE), an urban office REIT and the first, longest-tenured and pioneering owner, operator and developer uniquely focused on collaborative life science, agtech and technology campuses in AAA innovation cluster locations, has accelerated its efforts to support the agrifoodtech sector by investing in innovative companies that are developing groundbreaking technologies to meaningfully improve human health and nutrition, as well as those companies that are combating climate change through sustainable agriculture technologies and practices. Recognized by AgFunder as one of the top five most active U.S.-based investors in the agrifoodtech sector in 2021, Alexandria Venture Investments is on track to double its investment activity this year, a move supported broadly by the increase in private capital that has flowed into the sector from climate change-focused funds. Venture investing in the overall agrifoodtech sector has grown dramatically in recent years, from $8.9 billion in 2016 to $24 billion in the first half of 2021 alone, amounting to a more than fourfold increase in funding over the last five years. \"Alexandria has long understood that the agricultural and climate innovation sectors represent perhaps the most critically untapped source of opportunities for improving nutrition, ending global hunger, combating climate change and advancing human health at its most fundamental level,\" said Joel S. Marcus, executive chairman and founder of Alexandria Real Estate Equities, Inc. and founder and head of Alexandria Venture Investments. \"Since 2000, Alexandria has been at the vanguard and heart of the agrifoodtech ecosystem, developing and operating sophisticated agtech infrastructure and investing in innovative companies advancing novel approaches with immense potential to address sustainability-, agriculture-, food- and nutrition-related challenges. These strategic efforts have enabled us to lead the market in identifying top-tier investment opportunities and assist in building the next generation of impactful agrifoodtech companies revolutionizing the sector.\"   Alexandria continues to focus on investing in the highest-quality, most promising and positively impactful companies across the production-distribution-consumption value chain, including those operating in the controlled environment agriculture (CEA) space, also referred to as indoor ag; innovators bringing more resilient and productive crops to market through gene editing; disruptive organizations working on sustainable crop nutrients and targeted pesticides; and pioneers in food transforming the way we eat. Included among Alexandria's agrifoodtech investment portfolio companies are those working to innovate across the food value chain, such as GreenLight Biosciences, which has announced a potential SPAC transaction; Vindara, which was acquired by Kalera, Inc. in 2021; Bear Flag Robotics, which was acquired by John Deere for $250 million in 2021; Inari, which raised $208 million at a $1.2 billion post-money valuation in 2021; and Invaio Sciences, which raised $89 million in May 2021.   About Alexandria Real Estate Equities, Inc.   Alexandria Real Estate Equities, Inc. (NYSE: ARE), an S&P 500® urban office REIT, is the first, longest-tenured and pioneering owner, operator and developer uniquely focused on collaborative life science, agtech and technology campuses in AAA innovation cluster locations, with a total market capitalization of $38.6 billion as of September 30, 2021, and an asset base in North America of 63.9 million SF. The asset base in North America includes 38.7 million RSF of operating properties and 4.3 million RSF of Class A properties undergoing construction, 8.9 million RSF of near-term and intermediate-term development and redevelopment projects and 12.0 million SF of future development projects. Founded in 1994, Alexandria pioneered this niche and has since established a significant market presence in key locations, including Greater Boston, the San Francisco Bay Area, New York City, San Diego, Seattle, Maryland and Research Triangle. Alexandria has a longstanding and proven track record of developing Class A properties clustered in urban life science, agtech and technology campuses that provide our innovative tenants with highly dynamic and collaborative environments that enhance their ability to successfully recruit and retain world-class talent and inspire productivity, efficiency, creativity and success. Alexandria also provides strategic capital to transformative life science, agtech and technology companies through our venture capital platform. We believe our unique business model and diligent underwriting ensure a high-quality and diverse tenant base that results in higher occupancy levels, longer lease terms, higher rental income, higher returns and greater long-term asset value. For additional information on Alexandria, please visit www.are.com.    Forward-Looking Statements    This press release includes \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward-looking statements include, without limitation, statements regarding Alexandria's potential targets for investment activity, the likelihood of continued investment activity by the Alexandria Venture Investments® platform in certain agrifoodtech companies, and the potential impacts of such investments on Alexandria's business and the companies in which it invests. These forward-looking statements are based on the Company's present intent, beliefs or expectations, but forward-looking statements are not guaranteed to occur and may not occur. Actual results may differ materially from those contained in or implied by the Company's forward-looking statements as a result of a variety of factors, including, without limitation, the risks and uncertainties detailed in its filings with the Securities and Exchange Commission. All forward-looking statements are made as of the date of this press release, and the Company assumes no obligation to update this information. For more discussion relating to risks and uncertainties that could cause actual results to differ materially from those anticipated in the Company's forward-looking statements, and risks and uncertainties to the Company's business in general, please refer to the Company's filings with the Securities and Exchange Commission, including its most recent annual report on Form 10-K and any subsequently filed quarterly reports on Form 10-Q.   CONTACT: Courtney Mulligan, Senior Director – Communications, (646) 939-7471, [email protected]SOURCE Alexandria Real Estate Equities, Inc. Related Links http://www.are.com", "metadata": "2021-11-21"}
