{"text": "Female-Owned Biotech Startup Tiamat Sciences Raises $3 Million to Manufacture Plant-Based BiomoleculesProprietary plant molecular farming platform to advance multiple industries, including cellular agriculture, regenerative medicine, and vaccine production. DURHAM, N.C., Nov. 24, 2021 /PRNewswire/ -- Biotechnology startup Tiamat Sciences today announced its $3 million seed financing round led by Silicon Valley venture capital firm True Ventures with participation from Social Impact Capital and Cantos. Tiamat Sciences manufactures animal-free proteins using a proprietary plant molecular farming platform. By replacing costly bioreactors with plants, the company produces key reagents for biotechnology companies at a fraction of the cost.Those reinvented biomolecules are used to fuel the next generation of biotechnology innovations in various fields such as cellular agriculture and cultivated meat, regenerative medicine, and novel vaccine production. These new fields rely on reagents accounting for more than 80% of the production cost. But Tiamat offers key proteins 10X cheaper than the current market offers with fermentation technologies.\"Affordable animal-free growth factors are a long-awaited ingredient for cellular-agriculture...\"Tweet this\"Our technology can help to promote animal-free alternatives not only for food but also for the pharmaceutical industry,\" said France-Emmanuelle Adil, founder and CEO of Tiamat Sciences. \"Plants are a great system to work with; they grow fast, are small water and energy consumers, and they are compostable. The technology offers flexibility with production for a diversified product portfolio.\"The Tiamat team designed its proprietary production process by combining biotechnology, vertical farming, and computation design to reinvent recombinant proteins. While having already achieved a 10X cost decrease for its current products with lab-scale practices, the company is planning to achieve a cost decrease of 1,000X by 2025 with large-scale production for a wide catalog of products.With its two operating sites, in Belgium and the U.S., team Tiamat is forging global partnerships and preparing its expansion to include additional local production facilities. The company is already on its way to reach carbon-neutral production. Those strategies will allow Tiamat to reduce its environmental footprint and offer string supplies in a field that has endured numerous raw material shortages over the past several years.\"From regenerative medicine to cellular agriculture, numerous companies are looking for animal-free solutions for their activities,\" said Adil. \"Our exclusive plant-based production system allows us to answer those needs with a wide range of reagents. By targeting nascent markets on the verge of scale-up, we've already demonstrated significant traction for our solutions and an early revenue potential that is outstanding for a biotech startup.\"\"Affordable animal-free growth factors are a long-awaited ingredient for cellular-agriculture companies in their mission to bring cultured meats to the market,\" said Ryan Bethencourt, CEO of Wild Earth and Tiamat Science's chairman. \"Thanks to its innovative production platform using plants as bioreactors, I'm confident that the Tiamat team will address both the price and scalability challenges on one of the most exciting markets of the century.\"\"We follow best-in-class founders into the future as they invent the missing pieces of their industries,\" said Phil Black, co-founder of True Ventures. \"This is absolutely the case with the Tiamat team. Their innovations in cellular agriculture and biotechnology will advance multiple industries and even the work of other companies in our portfolio. We're here to play a supporting role in this exciting shift to a more plant-based future.\"To continue its work, Tiamat Sciences will build its pilot production facility in prominent technology research center Research Triangle Park in Durham, North Carolina. About Tiamat SciencesTiamat Sciences is reinventing recombinant proteins to fuel the next generation of biotech companies across cellular agriculture, regenerative medicine, vaccine production, and more. By using the power of plants, Tiamat provides animal-free recombinant proteins at the fraction of their cost with a reduced carbon footprint. The team is on track to become the fastest growing supplier of recombinant proteins. About True VenturesFounded in 2005, True Ventures is a Silicon Valley-based venture capital firm that invests in early stage technology startups. With more than $2.8 billion under management, True provides seed and Series A financing to entrepreneurs in today's fastest growing markets. To learn more, visit www.trueventures.com. About Social Impact CapitalSocial Impact Capital is a venture capital fund specialized in impact investing, which they define as investments that can deliver top decile returns in addition to a positive social impact. They focus on the \"essentials of human need\" — energy, water, food, health, environment, education, housing, access to capital, and social justice. About CantosCantos is a first-round venture capital firm with $50 million under management that invests where the innovation curve casts previously intractable problems in a new light –– where new technology might positively impact billions. At a time when venture capital has become synonymous with growth equity, Cantos exists to take the first steps with founders on bold journeys that would have been impossible just years prior. That is, to return venture capital to its roots.SOURCE Tiamat Sciences"}
{"text": "Falcon Edge, DST Global, D1 Capital and RedBird Capital lead $840 Million investment in Dream Sports at $8 Billion valuation. MUMBAI, India, Nov. 24, 2021 /PRNewswire/ -- Dream Sports, India's leading sports tech company with brands such as Dream Capital, FanCode, Dream11, DreamSetGo, Dream Game Studios, and DreamPay in its portfolio, today announced the completion of an investment of $840 Million at an $8 Billion valuation, led by Falcon Edge, DST Global, D1 Capital, RedBird Capital and Tiger Global. The round also saw participation from existing investors like TPG and Footpath Ventures, making it amongst the largest investments globally in the sports tech sector. Dream Sports, with an existing user base of 140 million Indian sports fans, is on a mission to build one of the world's largest sports ecosystems which includes Sports Content, Commerce, Experiences, Fan Engagement (including Sports Gaming and Esports), Web 3.0 solutions, Fantasy Sports and Fitness Tech. Earlier this year, Dream Sports further strengthened its commitment to this space by announcing a corpus of $250 Million through its CVC and M&A arm, Dream Capital. Dream Capital has built an initial portfolio of 10 companies, largely focusing on thematic early stage investments in India, including, Fittr, SoStronk, KheloMore and Elevar. Dream Capital is now expanding its sports, fan engagement and fitness portfolio in India and globally. Commenting on the investment, Harsh Jain, CEO and Co-Founder, Dream Sports said, \"Our vision and mission is to create an entrepreneur-led virtuous cycle of investment, innovation and wealth creation for all stakeholders in the sports ecosystem, from fans to athletes, teams and leagues. Our investors have deep experience in developing sports ecosystems globally, and we are fortunate to have their guidance to 'Make Sports Better' for 1 Billion Indian sports fans.\" \"We're excited to partner with the Dream Sports family in their vision of building the leading end-to-end sports tech company in India,\" said Rahul Mehta, Managing Partner at DST Global. \"We're very impressed with their customer centric approach, product strategy and ability to strengthen connections between fans and their favorite sports.\"A homegrown company founded in 2008 by Harsh Jain and Bhavit Sheth, Dream Sports is located in Mumbai and employs close to 1,000 'Sportans'.Avendus Capital was the exclusive financial advisor to Dream Sports on the transaction. About Us:Dream Sports is India's leading sports technology company with 140 million users, housing brands such as Dream11, the world's largest fantasy sports platform, FanCode, a premier sports content & commerce platform, Dream Capital, a CVC and M&A arm, DreamSetGo, a sports experiences platform, and DreamPay, a payment solutions provider. Dream Sports is based in Mumbai and has a workforce of close to 1,000 'Sportans'. Founded in 2008 by Harsh Jain and Bhavit Sheth, Dream Sports' mission is to 'Make Sports Better' for fans through the confluence of sports and technology. Since 2018, Dream Sports has been consistently featured as the only sports tech company in the 'Great Places to Work' survey.For more information: https://dreamsports.group/Media contact:Ishanee Roy [email protected] +91 9833308102SOURCE Dream Sports"}
{"text": "Mindspace Raises 72 Million Dollars From Institutional InvestorsUSA - EnglishUSA - EnglishDeutschland - DeutschDeutschland - DeutschNederland - NederlandsNederland - NederlandsUSA - EnglishUSA - EnglishUSA - English. TEL AVIV, Israel, Nov. 24, 2021 /PRNewswire/ -- Mindspace, the global flex office provider, secured a funding of $72 million. The investment round is intended to support the continuation of the company's growth and its further expansion in Europe, the United States and Israel. The round was led by Harel Insurance Investments and Financial Services Ltd., More Provident Funds, Shalom Meckenzie, Arkin Holdings and existing investors. Existing investors include: Yoav Harlap, Kobi Rogovin and Globalworth. Continue ReadingMindspace founders Dan Zakai (left) and Yotam Alroy (right). Image copyright: David Garb (PRNewsfoto/Mindspace)Mindspace, founded in 2014 by Dan Zakai and Yotam Alroy, currently operates 32 branches in 17 cities in seven countries, spread over 100,000 square meters (over 1 million sq. ft). In the past year alone, Mindspace successfully launched new branches in London, Tel Aviv, Philadelphia and a new hub and spoke location outside Tel Aviv, at Yakum. Mindspace serves a wide variety of companies; about 41% are large enterprises and corporations and 38% are small and medium-sized companies. The leading industry types of its customer base are technology companies, financial companies and service providers. Past and present customers include Microsoft, Samsung, Playtika, Taboola, Yahoo!, Expedia, GoPro, and more.While most of the commercial real estate industry took a hit as a result of COVID, the flex market continued to grow. All forecasts predict the accelerated growth of the flex industry to reach a market share of more than 30% by 2030; the current market share of flex as part of commercial real estate is 5%. According to a recent study by CBRE, in two years 43% of occupiers will have 10-50% of their portfolio dedicated to flex. In addition, 17% of occupiers will have more than 50% of their portfolio dedicated to flex.\"Mindspace is experiencing an impressive growth momentum and high demand in all its locations\", says Dan Zakai, CEO and Co-founder of Mindspace. \"We successfully faced the many challenges of COVID. Today, our locations are almost at full occupancy and the current investment led by Harel Insurance and More Provident Funds is intended to fulfill the rising demand in the market and to launch new locations in partnership with landlords worldwide\", says Zakai. In addition, he comments that \"Mindspace isn't just another real estate company that rents out offices, but rather offers a strong, strategic partnership to its customers and to landlords. When choosing their office environment, we found that our customers put a great emphasis on their experience: central location, unique design and service of the highest standard. We expect a continued accelerated growth in 2022, while creating a great added value for our many customers,\" adds Zakai.Mindspace provides well designed offices, luxurious lounges, fully equipped kitchens and meeting rooms, in addition to its unique community of leading entrepreneurs, business professionals and established companies. Mindspace allows for greater flexibility, shorter term commitments and lower financial risk, which is the most suitable solution in times of economic slowdown. These benefits explain the global increase in demand for flex and the many supportive forecasts of industry analysts.In 2021, Mindspace demonstrated a significant recovery when it reached the pre-COVID occupancy levels of early 2020, and even exceeded them with over 95% occupancy in Israel and Germany. The high occupancy levels are not the result of lowered prices as Mindspace maintained its pre-pandemic prices.In the past two years, Mindspace signed six management agreements with landlords in Europe, Israel and the U.S., including for its recent launches in Israel and Philadelphia. A management agreement is a model that is gaining both momentum and recognition worldwide, inspired by the hotel industry. This innovative concept presents a partnership between the landlord and the flex operator, allowing increased profitability and greater flexibility for the landlord, while providing a relevant response to today's market landscape.Earlier in March 2021, Mindspace launched \"Hybrid\", a new array of on-demand office solutions for companies and individuals who work under a hybrid model, combining work from home and in-office. The shift to hybrid has been on the rise for a few years and the outbreak of the pandemic has accelerated the process. At Mindspace, the increase of the hybrid trend is noticeable: casual, on-demand contracts have almost tripled in the past six months, compared to the same period last year, pre-COVID. As part of Mindspace's innovative development and the current flex trend, tenant experience is taking up a more central position. This experience envelops the customer journey from the first encounter with the office space through the use of the space and its various services, all the way to the end of the work day in the office. Tenant experience is accompanied by technological innovations, such as apps, data-driven insights and personalized activities, that enable the expansion of services and benefits to additional tenants in the buildings.Sami Babkov, Deputy CEO and CIO at Harel Insurance Investments and Financial Services, Ltd.: \"Harel is proud to lead the current investment round with a total funding of $30 million. This investment is an expression of confidence in the flexible workspace model, against the backdrop of COVID's impact on the office market, and shows confidence in Mindspace's experienced and professional management team. Through this investment we're able to diversify and improve our investments in real estate and faithfully serve the customers utilizing Harel's investment department.  \"We believe Mindspace brings an interesting model to the market - both economically and in terms of the value it produces for its customers,\" says Ori Keren, CIO at More Provident Funds. \"In a short time the company managed to create new standards in the market, to build high loyalty among its customers and is experiencing steady growth.\" Barak Capital Underwriting, Ltd. served as the investment banker in the transaction.About MindspaceMindspace is a boutique flex space provider, presenting a global mindset with a local flavor. We redefine the workplace experience for companies of all sizes. Our beautifully designed spaces, personalized level of service and carefully curated events foster enhanced employee engagement and a strong sense of community, accommodating the way people work, innovate and grow. Our customer base includes blue-chip companies, enterprises and SMBs, in 32 locations, 17 cities and seven countries across Europe and the US. Mindspace is home to corporations and large companies such as Microsoft, Samsung, Playtika, Yahoo!, Expedia, GoPro, Taboola, Techstars Accelerator, Barclays Bank, Klarna and more.Amongst its landlord partners are JTLV2, Patrizia, an affiliate of Rubenstein Partners Ltd., REIT1 and Rogovin-Tidhar. For further information please visit Mindspace.me, or follow Mindspace on LinkedIn, Twitter, Facebook or Instagram.Contact: Nicole Nanikashvili [email protected]SOURCE Mindspace"}
{"text": "YKC Clean Energy Technologies Receives Investment from OPPO in Series B3 FinancingUSA - EnglishUSA - EnglishUSA - EnglishUSA - EnglishUSA - EnglishUSA - EnglishFrance - FrançaisFrance - FrançaisDeutschland - DeutschDeutschland - DeutschItalia - ItalianoItalia - Italiano. NANJING, China, Nov. 24, 2021 /PRNewswire/ -- YKC Clean Energy Technologies (YKC Charging), a leading Chinese provider of EV charging and energy management services, has recently announced the completion of its Series B3 financing with investment from top smart device manufacturer OPPO, concluding three significant financing rounds within a space of just nine months following investments from CATL and NIO Capital.YKC Charging is one of the pioneers in the Chinese EV charging sector and one of the few Chinese internet firms with both technical expertise and an open attitude towards collaboration with other industry players. Since 2016, YKC Charging has built the largest third-party EV charging SaaS platform in China. By October 2021, YKC Charging was serving some 2,800 charging station operators while the number of directly connected charging piles topped 140,000, leading the way in the industry in terms of both scale and strength. YKC Charging has been on a mission with a focus on EV charging and on energy management with the end goal of becoming an integrated energy management service provider with a deep commitment to the charging infrastructure sector through collaboration with industry partners. To this end, the firm, in cooperation with local governments and companies across the industry chain, has established the first carbon peak and neutrality-oriented fund in the sector while creating industry-leading products and services with applications in the software, finance, energy storage and carbon trading sectors, as well as providing operations and maintenance services through cooperation with upstream and downstream vendors. This recent investment demonstrates OPPO's high recognition of YKC Charging's well-defined strategies, cooperation philosophy and efforts in helping achieve carbon peak and neutrality goals. Notably, YKC Charging had completed several rounds of strategic financing before the Series B3 financing. Investors included leading logistics provider GLP, battery giant CATL and NIO Capital. These investments served to bring together several key elements, including charging scenarios, technologies for charging equipment, traffic sources and industry capital. According to available information, OPPO has successively rolled out several smart mobility solutions since the beginning of the year. In response to the country's carbon peak and neutrality goals, the smartphone manufacturer chose to invest in and establish a strong alliance with YKC Charging to create synergies by leveraging their respective advantages. OPPO plans to work in concert with YKC Charging to further the integration of in-vehicle infotainment (IVI) and connected charging piles. The collaboration between the two companies is expected to facilitate innovation across the sector by leveraging their respective competencies in technologies, ultimately opening up more opportunities to themselves and other industry players. About YKC Charging Established in 2016, YKC Clean Energy Technologies (YKC Charging), a leading Chinese provider of EV charging and energy management services, has built the largest third-party charging IoT SaaS platform in China, with business spanning over 320 cities and serving more than 2,800 charging pile operators. Based on an open third-party platform cooperation ecosystem, YKC Charging provides comprehensive SaaS-based charging solutions to charging station operators, easy-to-use and efficient integrated charging management solutions to fleets and logistics providers, and scenarios-based charging-related operational and software services to government agencies and corporate customers. In October 2021, the firm established the first fund in the charging infrastructure sector to focus on carbon peak and carbon neutrality in concert with local governments and companies across the industry chain, intending to create the country's largest charging network for logistics and public services while actively investing in and building storage-charging integrated charging stations.SOURCE YKC Clean Energy Technologies (YKC Charging)"}
{"text": "ROCSOLE Raises €5M To Commercialize Its AI Tools For Industrial Automation. STOCKHOLM, Nov. 24, 2021 /PRNewswire/ -- ROCSOLE has successfully completed it's Series A investment round for 5 million euros. The investment round was led by Springvest Oy and was already completed in a few hours after it was released on November 5th, 2021.  ROCSOLE has been piloting its innovative and unique solutions in a variety of industries and applications in the past years. The commercialization started during the pandemic and we have been able to grow in this business environment. Supported by the investments, ROCSOLE will continue to grow its' team, upgrade own infrastructure and facilities as well as dedicate efforts on the scalability and product improvements and features.\"I am very glad to see this response, our team is strong and dedicated with our work to make industries safer and better. This investment turns the page for our company as we start a new chapter. The huge interest from investors, customers and the market is confirming the needs for improved sensor data and analytics allowing for improved operational efficiency which is a critical part in decarbonization. We are now gearing up for our scale-up with an impact in several industries. The coming years are going to be extremely exciting\" said Mika Tienhaara, chief executive officer of ROCSOLE.\"Springvest is built to support the most promising Finnish growth companies on their journey to international success. Rocsole has the potential to make a huge difference through its' sensor technology and data and analytics solutions. We are proud to be able to back up the commercialization of such technologies. Springvest is looking forward to a continuous cooperation with Rocsole in the future and we are eager to see the company grow as a result of this funding\" said Jouni Mäkelä, chief investment analyst  of Springvest.Contact: Harri Hedman       Mika Tienhaara        +358 40 166 3871 +47 911 11 459 [email protected]       [email protected]      ROCSOLE– See Beyond Technology. Rocsole Ltd (www.rocsole.com) is a Finnish high-tech company that develops SEE BEYOND tomographic imaging systems and Artificial Intelligence (AI) solutions. Customers are able to get accurate online data in order to optimize their processes for major savings in operational costs – Use Cases show on millions of Euros in savings.Springvest – Growth investment company Springvest enables Finnish success stories. Springvest is a trusted partner of growth companies and investors. We provide growth funding for the most promising companies and for investors an opportunity to invest in unlisted shares of growth companies.Springvest is the leading organizer of share issues for unlisted growth companies in Finland. During its' history, Springvest has raised over 170 million euros for growth companies in over 70 successful financing rounds. Springvest is a minority shareholder in all of its' portfolio companies and currently owns shares in more than 30 companies.This information was brought to you by Cision http://news.cision.comhttps://news.cision.com/rocsole-oy/r/rocsole-raises--5m-to-commercialize-its-ai-tools-for-industrial-automation,c3459812The following files are available for download:https://mb.cision.com/Main/21151/3459812/1500987.pdf Press release (PDF) https://news.cision.com/rocsole-oy/i/mika-tienhaara,c2984148 Mika Tienhaara   SOURCE Rocsole Oy"}
{"text": "Splashlight Studios Raises $1 Million in Seed FundingUSA - EnglishUSA - EnglishUSA - English. DUBAI, UAE, Nov. 24, 2021 /PRNewswire/ -- Splashlight Studios, a young e-commerce digital solutions provider has raised seed funding of $1 million from Eagle Ventures, a Dubai-based  fund managed by Adit Mehta and Hitesh Ajmera. Backbay Advisors was the financial advisor to Splashlight Studios on the transaction. Kartik Jobanputra , Founder and CEO of Splashlight Studios\"The seed fund is a great vote of confidence for Splashlight Studios and highlights the progress achieved since its launch in 2020. These funds will fuel our entry into KSA  which is a huge and exciting market for us after UAE. We've seen hockey-stick growth in e-commerce accelerated by COVID. The e-commerce revenue in the UAE alone is projected to touch USD 12 Billion by 2025. Fashion as a segment sits in the middle of this growth. As more and more new and legacy brands go online in the MENA region, Splashlight Studios has a huge untapped market to expand into,\" said Kartik Jobanputra, Founder and CEO of Splashlight Studios LLC. \"Due to COVID, demand for e-commerce offerings has witnessed substantial growth globally, especially in the past few months. Splashlight Studios is well-placed to cater to the demand originating in the Middle East as the e-commerce market matures in  that region. We trust the business potential and plans to expand across borders,\" said Ashok Mittal, Partner, Backbay Advisors. ABOUT SPLASHLIGHT STUDIOS  Set up in 2020, Splashlight Studios works on the intersection of fashion and technology. It aims to both empower brands as they take their first steps into e-commerce as well as provide competitive solutions to established brands looking to expand their footprints. Splashlight bridges the creativity-technology gap by offering end-to-end services ranging from product shoots, campaign shoots, English and Arabic content, Videos and annual content calendars. It is now looking to expand into  aggregation to reduce the go-to-market time for both, young and legacy brands looking to expand into digital. For more information, please visit https://splashlight-studios.com/ ABOUT BACKBAY ADVISORS  Backbay Advisors is a partnership of professionals who have vast experience in corporate finance, investment banking, restructuring, etc. It provides strategic and  financial advisory services for fund raising, mergers & acquisitions, restructuring. For more information, please visit https://backbayadvisors.in/SOURCE Splashlight Studios"}
{"text": "Next-generation Precision Medicine Company Allorion Therapeutics Completes Series A Financing Round. BOSTON, Nov. 24, 2021 /PRNewswire/ -- Allorion Therapeutics, a company focusing on next-generation precision medicine for oncology and autoimmune disease, today announced the completion of $40M Series A financing. This financing round is led by Qiming Venture Partners and participated by IDG Capital, Octagon Capital, Firstred Capital, and Elikon Venture. Existing investors - TF Capital and Med-Fine Capital - continued to support in this round.The proceeds will be used to support Allorion's preclinical projects, IND-enabling studies and IND applications of two drug candidates in China and the United States. Allorion will also increase its investment in its platform technologies in the systematic screen for allosteric inhibitors and synthetic lethality targets with matching tool compounds and enhance the clinical and business development teams.The drug discovery engine of Allorion integrates technological breakthroughs in protein structure, big data, machine learning and gene editing to systematically discover and develop highly selective small molecules, including covalent and allosteric inhibitors of well-validated targets. Allorion has also built a unique synthetic lethality screening platform to expand the scope of targeted therapies for cancer patients, laying a solid foundation for the company's long-term success. Allorion endeavors in target selection and project execution and upholds high standards of drug discovery and data quality to gain international recognition and collaboration.Peter Ding, Founder and CEO of Allorion Therapeutics, said, \"Over the past year, Allorion has built up R&D capabilities in Boston and Guangzhou and formed a strong management and R&D team. Multiple projects achieved their milestones. The completion of this financing round shows investors' recognition of the progress and the support for the company's long-term strategy on highly innovative platforms for best- or first-in-class drug discovery. We are grateful to all the investors for their trust and support. We will continue our efforts in promoting innovative small molecule drugs to clinical research, fulfilling the unmet clinical needs. Allorion will leverage cutting-edge technologies and strive to make precision medicine more precise and accessible to more patients.\"Chen Kan, Principal of Qiming Venture Partners, said, \"There are huge unmet medical needs for autoimmune disease and cancer therapy globally. Based on data mining and an in-depth understanding of disease biology, Allorion focuses on the early discovery and development of precision medicines. We have confidence in the team's strong R&D capabilities.. We hope to support Allorion to grow into a globally-recognized company and improve patients' life quality.\"About Qiming Venture PartnersFounded in 2006, Qiming Venture Partners is a leading China venture capital firm with offices in Shanghai, Beijing, Suzhou, Hong Kong, Seattle, Boston and the San Francisco Bay Area. Currently Qiming Venture Partners manages ten US Dollar funds and six RMB funds with $6.2 billion in AUM capital raised. Since establishment, Qiming Venture Partners has invested in outstanding companies in the TMT and healthcare industries at the early and growth stages. Since its debut, Qiming Venture Partners has backed over 430 fast-growing and innovative companies. Over 170 companies are already listed on NYSE, NASDAQ, HKEx, Gretai Securities Market, Shanghai Stock Exchange and Shenzhen Stock Exchange, or achieved exit through M&A and other means. There are also over 40 portfolio companies that have achieved unicorn status. About TF CapitalTF Capital focuses on investment in the life sciences industry, primarily investing in early stage companies with high potential.  Through strategic investments in various key areas and right partnerships, TF Capital hopes to capture opportunities in the rapidly expanding Chinese life sciences market. Our investment team has vast experience and resources in industry to assist  our portfolio companies.SOURCE Allorion Therapeutics"}
{"text": "TabTrader raises $5.8M for a mobile app that aggregates crypto exchange data. As many of the top cryptocurrencies seem to temporarily stabilize near all-time highs, users looking to speculate on tokens that are a bit more volatile are searching across exchanges to find deals.Amsterdam-based startup TabTrader has been capitalizing on this search with a platform that aggregates prices and token availability across dozens of exchanges. While other platforms allow users to look at token prices across exchanges, most are desktop-optimized while TabTrader has built up a substantial presence for its mobile app on iOS and Android.As different exchanges take different approaches toward onboarding new tokens, crypto traders are increasingly signing up for accounts on multiple exchanges and tracking prices across multiple apps with multiple notification types set for each. Many users rely on TabTrader for its cross-exchange price alert feature, notifying users when a particular token has gone above or below a certain value. While plenty of exchanges offer this functionality inside their native apps, the reliability and customizability of these push notifications has often been inconsistent.CEO Kirill Suslov tells TechCrunch that the TabTrader app has more than 400,000 active users, with particularly strong presences in Europe and Asia.The startup has adopted a Kayak-like model, aggregating prices for tokens and picking up rebate fees from exchanges when users make a purchase through the app. While users plug their wallet info into the app to easily make purchases through connected exchanges, Suslov says that TabTrader never has access to user funds.Alongside these rebates, TabTrader also makes money through a $12 monthly subscription for a paid version, as well as advertising. Suslov says his 20-person team has scaled to reach their current audience without any paid marketing.While tens of millions of users have created accounts on centralized exchanges like Coinbase and Binance, Suslov says that TabTrader’s biggest opportunity may be embracing so-called decentralized exchanges like Uniswap, which allow users to rapidly exchange tokens with other users.Suslov says that while the exchanges have built out great technology in the back-end, the front-end interfaces aren’t as easy for users to navigate, leaving room for an aggregator like TabTrader to streamline the user experience while allowing users to explore decentralized exchanges for the first time. The startup says they’re starting with a number of Solana-based exchanges including Serum, Raydium and Orca.“[Decentralized exchanges] are the hottest topic of 2021,” Suslov says. “We raised to get onto this rocket ship.”Suslov tells TechCrunch that TabTrader has banked $5.8 million in Series A funding from 100X Ventures, Hashkey Capital, Spartan Capital, SGH Capital, SOSV and Artesian Venture Partners."}
{"text": "Ionity lands €700 million investment from BlackRock, automakers to expand EV fast-charging network. Ionity, an electric vehicle fast-charging charging network provider whose owners include Daimler AG and Volkswagen Group, has scored a €700 million ($783 million) investment from BlackRock Global and existing shareholders to expand its footprint across Europe.The company, which was founded in 2017, installs ultra-high-speed EV charging stations. It was launched as a joint venture between a coalition of major automakers that includes Hyundai Motor Group, Ford and BMW. The investment will allow Ionity to increase the number of charging points to 7,000 by 2025 — a more than four-fold increase from the 1,500 that are installed today.The new charging stations will be situated on highways and other major roads as well as near major cities. Six to 12 charging points will be at each location, Ionity said in a statement. The firm is also planning on adding more charging points to existing sites with high demand.Ionity’s planned expansion includes owning and operating full service stations for drivers to “recharge” while charging their vehicles. These stations, a concept it’s calling “Oasis,” are similar to roadside rest stops today.BlackRock is the first non-automotive company to invest in Ionity, through its Global Renewable Power equity investment vehicle. The investment management company raised $4.8 billion for the fund in April, a sign that institutional investors are increasingly interested in decarbonization technologies.Its investment also speaks to the growing surety amongst powerful investment players in the forthcoming electric revolution in transportation. Thus far, BlackRock has mostly invested in onshore and offshore wind, and solar-powered projects, so its interest in EV charging is notable."}
{"text": "India’s Spinny valued at over $1.75 billion in $280 million funding. Spinny, a Gurgaon-based startup that operates a platform to facilitate the purchase and sale of used cars, is the latest firm to become a unicorn in the world’s second-largest internet market.Spinny has raised more than $280 million in its Series E financing round, a source familiar with the matter told TechCrunch. The round, which is co-led by Tiger Global and Abu Dhabi Growth Fund, values Spinny at over $1.75 billion post-money, the source said.This is the third funding round raised by Spinny this year. The startup was valued at about $700 million in July this year and $350 million in April.The new round follows quarters of strong growth that saw Spinny expand to 15 Indian cities, up from fewer than half a dozen last year. The startup has grown its business by four times in the current calendar year, the source said, requesting anonymity as the figures are not public.Spinny, which counts Elevation Capital and Accel among its existing backers, did not immediately respond to a request for comment. Indian news outlet Entrackr first reported about the funding round.Hundreds of thousands of used cars are sold in India each month. But buying them through the offline and traditional channel could prove to be a painstakingly long and high-risk process.One of the biggest challenges people face in buying a used car is the trust factor, Niraj Singh, co-founder and chief executive of Spinny told TechCrunch in an interview earlier this year.Spinny is addressing this by removing the traditional middlemen from the equation, thereby making it more affordable and reliable for customers to buy a used car. The startup buys cars from the owners, performs thorough and transparent inspections and then makes them available for customers to purchase.Niraj Singh, a former teacher, co-founded Spinny. (Image Credits: Spinny)If a customer is not satisfied with the car that they have purchased from Spinny, they get a full refund, the startup says on the website.The growth potential for Spinny and some other startups operating in this space is massive. The market for auto e-commerce currently has less than 1% penetration in India, according to analysts at Bernstein.“This is largely because the auto market still requires physical inspections and the target market skews towards used vehicles — an unorganized market,” they wrote in a report earlier this year.“The total addressable market in India is around $220 billion, which includes used vehicle purchase by consumers, auctions and remarketing, growth potential for the new vehicles market, and financing and advertisements. The total addressable market for only the used car market in US is over $800 billion,” they wrote in a report earlier this year.Spinny is the second Indian startup to become a unicorn this week. India has produced more than three dozen unicorns this year — more than all other years put together — after several high-profile global investors, including Tiger Global, SoftBank and Falcon Edge Capital, began to double down on the world’s second-largest internet market earlier this year at the height of the ravaging pandemic.In a letter to shareholders earlier this year, Tiger Global identified India as one of the few markets where it was planning to deploy billions of dollars. SoftBank Group chief executive Rajeev Misra said earlier this month that the Japanese firm has invested more than $3 billion in India this year and can invest up to $10 billion in the country next year."}
{"text": "Nigeria’s OnePipe raises $3.5M to double down on its embedded finance offering. Last year, fintech API infrastructure players came into the African tech scene, ushering in Plaid-like services to businesses and developers.And the attention on these companies, particularly from venture capitalists, spiralled into this year, with each significant player raising large seed to Series A rounds. OnePipe, a fintech API company with a different play from the lot, joins the list today, raising $3.5 million seed to double down on its embedded finance offering.African impact-focused VC Atlantica Ventures, a co-lead investor in OnePipe’s $950,000 pre-seed round last year, also co-led this seed round alongside Tribe Capital and V&R Associates.New investors Canaan Partners, Saison Capital, Norrsken (the fund of Klarna founder Niklas Adalberth), The Fund and Two Culture Cap also participated. Existing investors Chris Adelsbach, Techstars, Ingressive Capital, Acquity, P1, Raba and DFS Lab followed on with new checks, alongside a few angel investors.There are generally three main fintech API infrastructure plays. One is data and financial accounts aggregation (Plaid, Okra, Mono, Stitch and Pngme are some players in the space). The second focuses on embedded finance and banking as a service, where Treasury Prime, Marqeta ply their trade. The third is core open banking pioneered by the likes of TrueLayer.OnePipe’s original game plan was to create an API gateway that connected banks and fintechs under a uniform standard, a move that would allow the company to perform core open banking. But founder and CEO Ope Adeoye (self-described as the company’s chief plumber), on a call with TechCrunch, said upon continuous integration with these financial institutions, it became clear the company needed to pivot since it wasn’t generating many demand cycles. And having struck partnerships with a few banks, OnePipe decided to take a step back and delve into the world of embedded finance.Unlike open banking and data aggregation plays where a company needs to collaborate with almost every bank in the country where they operate, it’s not necessarily the case with companies offering embedded finance. That’s why OnePipe has six partner banks at the moment.“The caveat goes like this, the moment you make a positioning play for banking as a service, all you really need is one partner bank that lets you go deep because the embedded finance [offering] is about depth and not breadth,” said the CEO. “If you go for data aggregation or open banking in general, then you are going for breadth, not depth. So on our side, we said we’d rather go with tier two and tier three bands, where once you describe the concept to them, they get it. It powers their growth and is more valuable to them, unlike other larger financial institutions.”By running API infrastructure on behalf of these partner banks and helping them monetize it, OnePipe works with non-financial institutions to launch and cross-sell an array of financial services such as credit, accounts and payments within their offerings.  “We raised a round last year to focus on one use case of the partnership, which was to pull together the APIs of a fixed set of banks and offer embedded banking or banking as a service play,” Adeoye asserted. “Meaning, we make it possible for non-financial institutions, or businesses in general, to offer banking services to their customers.”So an FMCG startup, for instance, can plug into a bank’s API managed by OnePipe and begin to issue accounts to customers, allowing them to make payments off those accounts and access credit when they need it.With open banking on the horizon, the fintech-SME love story is just beginningIn the 10 months OnePipe switched up to this model, it has processed more than 6.3 million transactions worth over $46.3 million, the company said. These numbers are from over 1 million individual accounts and 138+ businesses, ranging from FMCG and retail to lending and agriculture.OnePipe takes a percentage cut from transactions made on these accounts and shares with its partner banks. For loans offered via its APIs, OnePipe takes at least 1% of the loan interest from its lending partners and also shares it with the businesses and partner banks.With what OnePipe has accomplished so far, Aniko Szigetvari, the founding partner at Atlantica Ventures, believes the company is not only deepening financial inclusion in Nigeria but the continent. “In our view, embedded finance is the next enabler for both traditional and financial service businesses to increase customer loyalty and revenue by offering a wide range of third-party financial products and revenue streams for their customers,” she said.Though OnePipe is currently only present in Nigeria, it is making its first move beyond the country’s shores to align with Szigetvari’s statement. OnePipe is going through a strategic partnership route as Adeoye mentioned that his company made a deal with African logistics and freight company Sendy to expand into other African countries. Per the company’s statement, the plan is to “pull a Stripe-Shopify-esque tag team.”“We made sure that before we looked into other African countries, we were going in with a customer on the ground already,” said the CEO. “We did a deal with Sendy that made them participate in this round, and we will then deploy the capital for expansion. So as they go to Egypt, South Africa, we’ll be deploying with them and grow together.”African startups join global funding boom as fintech shines"}
{"text": "Kenyan fintech Asilimia raises $2 million in a pre-seed round, plans to extend loans to MSMEs and expand in East Africa. Kenya’s economy is powered by informal businesses, which contribute 33.8% to the country’s GDP and provide 83.4% of the total employment outside of small-scale agriculture, data from the country’s bureau of statistics shows. The contribution of these enterprises is pivotal to the country’s economy, yet they remain underserved by traditional banking institutions, making it hard for them to access the financing needed to grow.On the other hand, the financing gap left by conventional banking institutions has presented an opportunity for innovation, leading to the birth of fintechs like Asilimia. The Kenyan startup has over the last three years been offering a lifeline to traders in Kenya by enabling them to make mobile money transactions that are devoid of transfer charges (through its Leja app).And now, having secured $2 million in pre-seed funding ($1 million equity and $1 million debt), the startup is headed for its next phase of growth, which will involve extending loans to traders offering more relief to this subgroup that is often left out and regarded as high risk by the traditional banking sector.The funding came from various investors, including Fredrik Jung Abbou, a two-time unicorn founder and Norrsken Impact Accelerator, while the debt round had the participation of French Public Investment Bank (Bpifrance) and GreenTec Capital Partners.Asilimia is set to use the funding to hire talent as it looks to fine-tune its technology and expand to another market within East Africa. It will also extend loans to micro, small and medium-sized enterprises (MSMEs) based on data from its Leja app.“We have entered a phase where we are exploring ways in which we can extend the much-needed credit enabling traders to buy equipment or products to sustain their enterprises,” Asilimia co-founder and CEO Tekwane Mwendwa told TechCrunch.Morgane Kablan, is the startup’s other co-founder and chief operating officer.By providing mobile loans, Asilimia will join a space that has about 100 lending apps, including Branch by San Francisco-based Branch International Ltd and PayPal-backed Tala.Asilimia team in Nairobi, Kenya. Image Credits: Asilimia.The Digital Lenders Association of Kenya told TechCrunch in a past interview that about 25 apps it represents disburse about $40 million a month. The apps offer collateral-free loans making them attractive to borrowers looking for quick cash.In addition to enabling users to make mobile money transactions at no fee, Leja also supports bookkeeping, making it easier for the traders to track their revenues and outflows, without the need for technical or accounting knowledge. The platform provides valuable data that Asilimia plans to tap to extend loans to users.Mwendwa said that Asilimia will create credit scoring models from the collected data to determine how much will be extended to borrowers.“We will factor in their B2B transactions, cash flow, sales, liabilities and expenses because all this information is in the app. This is possible because traders love to use our app which, unlike other lending apps, has inventory management. I like to think of our app as the operating system of informal businesses and we are happy that it is a one-stop shop for the traders,” said Mwendwa.“Another thing that traders struggle with is airtime top-up. We interact with them daily and understand their pain points, and so we want to give them all the support they need so that they can continue doing business — we will also extend airtime top-up credit at no interest,” he said.Mwendwa said that a normal user makes about three transactions through the app every day and the business has been growing 30% week on week. About 27,000 users use its apps, with total transactions done through the Leja app reaching about $20 million.Previously, the startup has been through the prestigious Station F incubation program in Paris and the Norrsken Impact Accelerator program. In 2019, the startup won the Africa Cup at the 2019 SA Innovation Summit, securing a $350,000 investment from Unicorn Group, a pan-African investment firm. It used the financing to fund its growth which included adding Leja to its portfolio.Beyond East Africa, Asilimia is exploring growth opportunities in other regions, as it seeks to continue bridging the financing gap currently experienced by traders across the continent.“MSMEs play a vital role across Africa and making it easier for them to succeed is great for the continent as a whole,” said Norrsken Impact Accelerator co-founder and managing director Funda Sezgi.“Tekwane and the team have built a solution that works and we are delighted to be supporting them as they drive prosperity in a key sector for the African economy.”"}
{"text": "Vollebak, which makes ‘clothes for the future,’ is closing its Series A round. If you’ve ever visited the site of the six-year-old, London-based direct-to-consumer clothing company Vollebak, you’ve likely marveled at the exaggerated descriptions of clothing it sells, including a jacket “designed for a world of megastorms, where ‘waterproof’ is not enough,” a hoodie that promises to repel rain, wind, snow and fire; and and an “ice age” fleece “designed to recreate the feeling and performance of the soft hides worn by prehistoric man.”That marketing genius comes directly from CEO Steve Tidball, who co-founded the outfit with his twin, Nick Tidball — both of whom worked in advertising previously and both of whom are active outdoorsmen, though their families and the growth of Vollebak have kept them closer to home in recent years. Indeed, Steve Tidball writes the copy himself, he revealed last week in an interview about Vollebak, a brand that prides itself on making “clothes for the future.”During that chat, he also answered our questions about how much tech is actually involved in the clothing’s production. And he let us know that Vollebak has so far raised around $10 million in outside funding, including through a Series A round that is about to close, led by the London-based venture firm Venrex, with participation from Airbnb co-founder Joe Gebbia, and Headspace CFO Sean Brecker, among others. Our chat has been edited for length and clarity.TC: You started this company with your twin, Nick. So much of its genius seems to be in how your clothing is marketed. Tell us a bit about how it came together.ST: We launched the company five years ago. Before that, we’d been working together in advertising for 15 years, so I think one of the reasons the marketing is more fun than it might otherwise be is that was our job.We’ve operated by an incredibly simple rule from a marketing perspective, which is basically: spend as little money as humanly possible. So, for instance, a couple years ago, we created our first piece of clothing for space, which was a deep sleep cocoon. And in marketing, you’re always [asking] who’s your audience, and really, our audience was one person here, which was Elon [Musk], so we found a billboard [space] opposite SpaceX, and we just took out a poster there, and it said, “Our jackets are ready. How’s your rocket going?” It doesn’t cost much money, but it was really great fun, and NASA called the next week, and then we got [to] chatting to them.Your clothing is a reflection of the stuff that you think is going to happen to people over the next century, from space travel to sustainability. You have a solar charge jacket that you say can glow like a firefly in the dark, for example. You have a “black squid” jacket that you say recreates one of nature’s most brilliant solutions to high visibility, the adaptive camouflage of the squid. How much tech is really involved here?Over the last five years, the angle of tech we focused on is material science. That’s the one thing that, as a startup, we’ve had access to, because if you’re going to look at much [complex] technologies like AI or exoskeletons, you need a really huge amount of funding to go tackle those, whereas any startup can really go and look at material science. So that’s the angle we’re really fascinated with . ..[because]  that’s typically not been explored, how much material science could go into a product.One of the most interesting things we ever launched was the world’s first graphene jacket. Even the scientists who isolated graphene for the first time can’t actually tell you what graphene is going to do.  . . .[So] we said, well, one side has graphene and the other side doesn’t. Why don’t you go out and test it and tell us what it does? We had a theory that it could store and redistribute heat because graphene behaves in a very surprising way and there’s no limit to how much heat it can store. What came back were two particularly amazing stories, one of a U.S. doctor who’d been freezing at night in the Gobi Desert and who wrapped his graphene jacket around a camel, and after it absorbed the heat of the camel, he put his jacket back on and stayed warm through the night.Another friend of ours, a Russian guy who was out in the Nepalese mountains and was in danger of freezing to death, used the graphene jacket to absorb the last rays of sun. It warmed up, and he put it on as his inner layer and credits it with keeping him warm through the night.How do you manufacture a graphene shirt or ceramic shirt? Do you have a special loom? Do you make it out of a 3D printer? What’s the process?You manufacture it with great difficulty is the answer, which is why our stuff costs more than regular clothing. What you really end up with is very specialist factories, typically in Europe, with really high-tech machinery that very few people have access to.Do you typically do short production runs for your merchandise?Yes, and at the start, that was really just a function of capital, meaning we didn’t have much, so we just made as many clothes as we could, they sold out really quickly, and we tried to make some more as the business has grown. There’s definitely stuff where it’s so complicated or so experimental, it would be reckless to make 10,000 of them. So yeah, we’ve made short runs of some of our most experimental stuff, just to see: Does it work? Could it be improved?One of those experimental new products is the Mars jacket and pants. Where does one wear that?Of the funny things about making anything for Mars is that the irony, of course, that you have to test it on Earth. But the reality of going to Mars or any space travel is there’s going to be an exponential increase in the number of people going there and the number of jobs they need to do when they go there. You’re going to need scientists, biologists, builders, engineers, architects, they’re gonna have to wear something. And so the reality is, we want to start working on it early, so what we’re doing is we’re starting to think about some of the tasks that need to be carried out, whether it’s on the moon or Mars or lower orbit stuff, and about: What are the jobs? What are some of the challenges that we’re going to face? This is why the jacket comes with a vomit pocket, because your vestibular system is thrown into disarray as soon as you encounter a lack of gravity.How do you know about the vestibular system? You’re a marketing genius. Are you also a scientist?I’m a pretend scientist [laughs]. But we have a lot of really interesting people around us, whether it’s people who think about the future of warfare, or people who think about the future of space travel, we often joke that our business is run on WhatsApp.Where do you receive most of your customer feedback? Certain D2C brands are very active on social and Instagram and have Slack channels. How do things work over there?I had this really early thought that if you could combine really cool innovative technology with really friendly people on the end of email, that could be a really cool thing.You only sell directly through the Vollebak site. Will that ever change?Not in the near-term future. One of the things that’s been absolutely central to the brand is getting that feedback, and I really worry about losing that connection to the customers. Let’s say someone has a cool experience with one of our shirts or one of our jackets, and they bought it at some wholesale store, and they have no real connection to us. I feel that’s lost information.We will be doing more stuff in the metaverse space very, very soon, because I just find it so exciting, the idea that there’s going to be this competition or integration between the virtual world and real world. So we’re currently building some fairly crazy stuff in that space. We’re currently on the hunt for some supercomputers powerful enough to process some of the stuff we’re working on. But yes, basically, anything that we think is going to define the future, we’ll plow pretty heavily into.(You can hear this conversation in its entirety, including about Vollebak’s plans to eventually launch a women’s line and its funding situation, here.)"}
{"text": "India’s Blume Ventures raises $105 million in the first close of its fourth fund. Blume Ventures said on Wednesday it has raised $105 million in the first close of its fourth fund, less than two years after finalizing its previous fund, as investment activity intensifies in the world’s second-largest internet market.The 11-year-old firm, one of the largest Indian venture funds, said it expects its new fund to balloon to close to $200 million by March next year, which is when it hopes for the final close. Its current LPs include some multifamily-office wealth management funds, sovereigns and some corporates across Asia and Europe.With the new fund, the investment firm will continue to focus on backing early-stage startups in their pre-seed and pre-Series A rounds, said Karthik Reddy, co-founder and managing partner at Blume Ventures, in an interview with TechCrunch.Blume Ventures — which counts online learning platform Unacademy, fintech Slice, hyperlocal delivery service Dunzo, edtech Classplus, used-car marketplace Spinny, and insurer Turtlemint among its portfolio startups — backs early-stage startups and typically writes its starting check in the range of $1 million to $2.5 million.Over the years, Blume Ventures has become one of the most respected venture firms in the country. Even the startups that don’t end up getting a check from the fund speak highly of its partners, according to many entrepreneurs with whom TechCrunch has spoken.Wednesday’s announcement comes at a time when Indian startups are raising record amounts of capital. Sequoia Capital India, Tiger Global, Falcon Edge Capital and SoftBank have increased the pace of their investments in India in recent quarters as they double down on finding winners in one of the last great growth markets.The pandemic has also seen many firms aggressively scramble for new strategies. But Blume Ventures appears to follow the more conservative approach. The venture firm has written about 25 checks from its previous fund and still has some reserves to do follow-on rounds, said Reddy.At the height of the pandemic, Blume Ventures was “slow and thoughtful” as it was not very comfortable with assessing firms over Zoom calls, he said. “We took our own time to write the last few checks,” he said.“We are getting amazing love from large investors,” he said, adding that it may appear that some of the startups larger firms have backed in recent quarters have seen multi-fold jumps in valuations, but he pointed to some business-to-business e-commerce marketplaces and noted that their growth build-up had been in the works for three to four years.With the firm’s $102 million third fund, Blume Ventures backed a number of firms in edtech and deep-tech SaaS spaces, he said. Reddy said it was too early to say how the third fund has performed, but added that it has probably never seen its portfolio firms reach the $50 million to $100 million valuations stage faster.“But that’s natural. If you have a good founder, good story to tell, you don’t need a boat load of revenue to go and raise a double-digit round today,” he said, adding that by March the firm expects valuation of 10 portfolio startups from the third fund to be over $75 million. “This is a first-time experience for us. It took us much longer in previous funds.”With the new fund, the largest for Blume Ventures, the firm expects to participate for longer in the lifecycle of its portfolio startups."}
{"text": "Auth0’s Eugenio Pace and Ubiquity’s Sunil Nagaraj will outline how the startup went from seed to a $6.5B acquisition. In March, Okta completed a $6.5 billion acquisition of Auth0, an identity and access management platform. The deal surely brought a smile to the faces of Auth0’s investors.On December 1 at 12p PT / 3p ET, we’ll sit down with Auth0 co-founder Eugenio Pace and investor Sunil Nagaraj of Ubiquity to learn for certain.We’re amped to have Pace and Nagaraj join us for this upcoming episode of TechCrunch Live. Click here to register for free!Eugenio Pace spent more than a decade at Microsoft before starting his journey with Auth0. Nagaraj, for his part, is founding partner at Ubiquity Ventures, which is a seed-stage firm with close to $100 million in AUM. Nagaraj sits on the boards of Esper, Halter, Kinetic, Parallel Domain, Revi, Safehub and others.Nagaraj was an early investor in Auth0 and can share insight on how a company secures seed funding and grows at the rate that Auth0 has.TechCrunch Live is all about helping founders build better venture-backed businesses. We do this by talking to founders and the investors who finance them to learn how they came together, why they chose to work with one another and how they overcome hurdles and scale together.Sometimes, we even take a peek at the startup’s early pitch deck to hear what truly sang on the other side of the table.TechCrunch Live also features the TCL Pitch-off, where founders in the audience can volunteer to hop on the virtual stage and pitch their product to our esteemed guests and hear their live feedback.We look forward to seeing you on December 1st! "}
{"text": "Arc hooks another $30M in investment as EV interest spills over into electric boats. Arc is not even a year old and the electric boat startup has attracted investment from top VC firm Andreessen Horowitz, entertainment industry big wigs and now a $30 million raise led by an early Tesla executive who led the automaker’s early manufacturing efforts.The $30 million Series A was led by Greg Reichow, the former Tesla executive who is now a partner at Eclipse Ventures. Existing investors — Andreessen Horowitz, Chris Sacca’s Lowercarbon Capital and Ramtin Naimi’s Abstract Ventures also joined. Reichow will also join Arc’s board, the startup said in its Tuesday announcement. To date, Arc has raised $37 million, including earlier investment from the funds of Will Smith’s Dreamers VC, Kevin Durant and Rich Kleiman’s Thirty Five Ventures and Sean “Diddy” Combs’ Combs Enterprises.The influx of capital and heavy hitting backers for the young company reflects broadening interest in electrification beyond a vehicle with two or four wheels — a sector that has been flooded with multimillion-dollar private funding raises as well as eye-popping debuts on public exchanges. (Earlier this week, GM announced it had taken a 25% stake in electric boat company Pure Watercraft.)It’s also, of course, a validation of Arc’s particular business, which is to electrify everything on the water, starting with a limited-edition $300,000 boat.Mitch Lee, who is CEO, and former SpaceX engineer Ryan Cook co-founded Arc with a plan to develop and sell electric watercraft at various price points and use cases. They started by focusing on the design and development of a purpose-built hull and purpose-built battery packs. Its first boat is the Arc One, a 24-foot aluminum boat that produces 475 horsepower and can run between 3 to 5 hours on a single charge. Arc will produce fewer than 25 Arc One boats.Arc has plans that expand beyond building and selling a couple of dozen high-priced boats. But at least in the near term, Arc is focused on delivering the Arc One, the company said."}
{"text": "New Found Announces Closing of $48 Million Investment by Eric Sprott. VANCOUVER, British Columbia--(BUSINESS WIRE)--New Found Gold Corp. (“New Found” or the “Company”) (TSXV: NFG, NYSE American: NFGC) is pleased to announce that it has completed its previously announced non-brokered private placement of 5,000,000 common shares of the Company that qualify as \"flow-through shares\" for the purposes of the Income Tax Act (Canada) (the \"FT Shares\") at a price of $9.60 per FT Share (the \"Financing\"), for gross proceeds to New Found of $48,000,000. The FT Shares have a hold period of four months and one day from closing, expiring on March 25, 2022. A cash finders' fee equal to 0.5% of the gross proceeds of the Financing will be paid to each of Paradigm Capital Inc. and Richardson Wealth Ltd. Mr. Eric Sprott purchased 5,000,000 FT Shares as a result of this Financing and following closing holds approximately 22% of the issued shares of the Company.The gross proceeds from the issuance of the FT Shares will be used for \"Canadian exploration expenses\" and will qualify as \"flow-through mining expenditures\" (the \"Qualifying Expenditures\"), as those terms are defined in the Income Tax Act (Canada) related to the Company’s Queensway Project located in Newfoundland, Canada and on the Company’s Lucky Strike Project located in Ontario, Canada.The Company did not file a material change report more than 21 days before the closing of the Financing, which the Company deemed reasonable and necessary in the circumstances in order to complete the Financing in a timely manner.About New Found Gold Corp.New Found holds a 100% interest in the Queensway Project, located 15 km west of Gander, Newfoundland, and just 18 km from Gander International Airport. The project is intersected by the Trans-Canada Highway and has logging roads crosscutting the project, high voltage electric power lines running through the project area, and easy access to a highly skilled workforce. The Company is currently undertaking a 400,000m drill program at Queensway. With a current working capital balance of approximately $140 million, New Found is well funded for this program.Please see the Company’s website at www.newfoundgold.ca and the Company’s SEDAR profile at www.sedar.com.ContactTo contact the Company, please visit the Company’s website, www.newfoundgold.ca and make your request through our investor inquiry form. Our management has a pledge to be in touch with any investor inquiries within 24 hours.Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.This news release does not constitute an offer to sell or a solicitation of an offer to buy nor shall there be any sale of any of the FT Shares in any jurisdiction in which such offer, solicitation or sale would be unlawful, including any of the FT Shares in the United States of America. The FT Shares have not been and will not be registered under the United States Securities Act of 1933, as amended (the \"1933 Act\") or any state securities laws and may not be offered or sold within the United States or to, or for account or benefit of, U.S. Persons (as defined in Regulation S under the 1933 Act) unless registered under the 1933 Act and applicable state securities laws, or an exemption from such registration requirements is available.Forward-Looking Statement CautionsThis press release contains certain \"forward-looking statements\" within the meaning of Canadian securities legislation, relating to the Offering, use of proceeds of the Offering; tax treatment of the flow-through shares; and the timing of the renunciation of the Qualifying Expenditures. TSXV approval of the Offering, drilling on the Queensway gold project and funding of the drilling program. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"aims,\" \"suggests,\" \"potential,\" \"goal,\" \"objective,\" \"prospective,\" \"possibly,\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"can,\" \"could\" or \"should\" occur, or are those statements, which, by their nature, refer to future events. The Company cautions that forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made, and they involve a number of risks and uncertainties. Consequently, there can be no assurances that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Except to the extent required by applicable securities laws and the policies of the TSXV or the NYSE American, the Company undertakes no obligation to update these forward-looking statements if management's beliefs, estimates or opinions, or other factors, should change. Factors that could cause future results to differ materially from those anticipated in these forward-looking statements include risks associated with the Company's ability to satisfy the conditions to close the Offering, including the Company's ability to obtain all necessary stock exchange approvals, possible accidents and other risks associated with mineral exploration operations, the risk that the Company will encounter unanticipated geological factors, risks associated with the interpretation of assay results and the drilling program including the work to assess the presence and source of bias relating to core samples submitted to Eastern Analytical as disclosed in the Company’s press release dated November 4, 2021, the possibility that the Company may not be able to secure permitting and other governmental clearances necessary to carry out the Company's exploration plans, the risk that the Company will not be able to raise sufficient funds to carry out its business plans, and the risk of political uncertainties and regulatory or legal changes that might interfere with the Company's business and prospects. The reader is urged to refer to the Company's Annual Information Form and Management's discussion and Analysis, publicly available through the Canadian Securities Administrators' System for Electronic Document Analysis and Retrieval (SEDAR) at www.sedar.com for a more complete discussion of such risk factors and their potential effects."}
{"text": "Pryon Positions for Leadership in AI-Enhanced Knowledge Management With Funding and Talent Momentum. RALEIGH, N.C.--(BUSINESS WIRE)--Pryon, the artificial intelligence (AI) company founded by the inventors of the technologies behind today’s mainstream digital assistants used by hundreds of millions of people per day, announced today new leadership and funding that will bring the next generation of interactive knowledge management to the everyday work experience.Chris Mahl joined Pryon as President and Chief Revenue Officer to oversee corporate operations and drive growth strategies. Mahl brings an extensive background in enterprise sales leadership from Oracle, Informatica and Salesforce and a track record of bringing companies to profitability in more than a decade of advising startups and venture capital firms.On the heels of an equity financing round filed in September, Pryon also welcomed new board members and observers representing some of the industry’s leading venture capital funds, signaling continued confidence in the company’s trajectory. The round was supported with new investments by 3ig Ventures; Duke University Management Company (DUMAC); Gaingels; Micron Ventures; Piedmont Capital Partners; Private Ventures Group; Rex Health Ventures; Samuel J. Palmisano, Chairman of the Center for Global Enterprise and former Chairman and CEO of IBM; and Steel Perlot, with existing participation from BootstrapLabs, Breyer Capital, Good Growth Capital, Greycroft and Revolution’s Rise of the Rest.Incoming board members include Kirsten Wolberg, former executive with DocuSign, PayPal and Salesforce; Michelle Ritter, CEO of Steel Perlot, a management company incubating, investing in, and scaling companies in today’s most challenging technical industries; and Pryon’s Chris Mahl.“This is an incredible time for Pryon’s platform,” Ritter said. “Steel Perlot believes applied AI will increasingly transform business at scale. Pryon is applying machine learning and artificial intelligence to tackle a massive problem in workplace productivity and knowledge management. We invested in Pryon’s mission and team because we believe it has the technical depth, leadership, access, and product to become a category-defining company.”Palmisano said, “As businesses are accelerating their digital transformation, Pryon's AI technology addresses the critical need for organizations to translate massive volumes of legacy content into actionable knowledge.”Wolberg added, “Pryon has developed technology that fills a gap in the enterprise software stack. In my experience, what the company offers is critical for organizations who deal with large amounts of application or document-based data, or those who want to expand the capabilities of their virtual assistants. The sky is really the limit for how Pryon’s platform can be applied to provide a unique level of accuracy and speed to the management of enterprise knowledge. I look forward to being a part of their journey.”Pryon applies AI-based intelligent document processing (IDP) to augment unstructured data from disparate sources such as application knowledge bases, digital libraries and document stores. Using proprietary computer vision and natural language engines, the company’s platform enriches the content to boost accuracy. This information retrieval for question answering (IRQA) capability allows users and systems to dynamically converse with previously static information. The platform’s API also rapidly expands the functionality of existing AI assistants, chatbots, and interactive voice response (IVR) installations, which can typically only respond to a limited set of requests, reducing the business impact of contact centers and help desks.Mahl said, “Since the moment I met the team, I have been incredibly impressed and sense the same level of energy, quality and vision I witnessed in my time at Salesforce and other successful companies in hyper growth. Our sole purpose at Pryon is to transform enterprise content into a cohesive asset that drives business value.”About PryonPryon is an artificial intelligence (AI) company focused on enterprise knowledge management. Its natural language processing (NLP) platform transforms unstructured data into experiences that increase productivity with unmatched accuracy and speed. Pryon’s automated machine learning engines deliver rapid time to value by enriching existing content. This no-code approach prevents operational disruption and allows organizations to quickly maximize the business value trapped within their information assets. Pryon was founded by Igor Jablokov, whose previous company defined the state of the art for AI assistants and was acquired by Amazon to form the basis for Alexa. For more information, please visit pryon.com or follow us on LinkedIn and Twitter."}
