{"text": "eCommerce Platform Pepper Raises $16M in Series A Funding to Enhance Ordering Experience for Food Distributors. NEW YORK--(BUSINESS WIRE)--Pepper, the eCommerce platform for food distributors, has raised $16 million in Series A funding that will enhance the ordering experience for distributors servicing over 25,000 restaurants and grocery stores in the U.S. and Canada. Index Ventures led the round with participation from Greylock, Imaginary Ventures, BoxGroup, Moving Capital, and Brett Schulman, bringing the total capital raised to date to $20M.With the Series A secured, platform enhancements are a top priority for Pepper. “This funding enables us to accelerate product development in key areas such as digital payments and a product recommendation engine to grow sales,” says Bowie Cheung, co-founder and CEO. “Our existing clients have been asking for these features, and we're excited to be able to create even more value for them.”Cheung and co-founders Chetan Narain and Ivana Tesanovic have a shared passion about food and its importance as a fundamental global industry. Narain and Cheung met at UberEats, where they observed how quickly technology became a fixture in the average restaurant, and in contrast, how absent that same technology was in the day-to-day workflows of food distributors who work with restaurants everyday.That insight led to the founding of Pepper and the launch of its first tools for NYC restaurants and suppliers in early 2020. Today, it’s evolved into a full service online ordering catalogue and payment system that takes advantage of the technology we use in our daily lives.When restaurants and grocery stores order food from their distributors, 80% of the time they leave that order on a voicemail, with no paper trail, accessible order history, or ability to double-check after the fact. And 80% of payments are made to distributors by mailed-in paper checks—many distributors have drawers of uncashed checks to prove it. Pepper recognized where miscommunications happened, money was lost, and food was being wasted.Because the platform is tailor-made for food distributors, it has the ability to support catalogs with over 100,000 items for distributors in every category from dairy, to fish, to produce, and packaging. It enables businesses of all sizes to launch mobile apps and websites that make ordering online a real business growth engine, and provides flexible payment options that fit in any model.The easier it is for venues to order from a distributor, the more they’re willing to spend. Pepper’s data even shows that when their suppliers migrate customers from offline to online, the average revenue with that existing customer goes up 15%. Eliminating reliance on voicemail orders makes ordering more accurate and eases the workload for supplier staff, too.Helping distributors grow and streamline their business is at the core of what Pepper aims to do. “When our partners have ideas on the best way to grow their business, we want to explore that with them,” says Cheung. “We want to put those tools at their fingertips.”This Series A will be the next step in bringing those desires to life for the platform’s users. “Pepper is pursuing what we think is the next big opportunity in the restaurant industry: enabling restaurants to purchase $200B of annual food inventory digitally instead of via phone and email,” says Damir Becirovic, Principal at Index Ventures, and Pepper investor. “Pepper has built a great platform that they provide to food distributors, essentially enabling a Shopify-like eCommerce storefront for them.”And enabling suppliers to better do what they do best is why Pepper was founded in the first place. “Everyday we get to work with leaders in the food supply chain who have built incredible businesses from the ground up and navigated industry highs and lows for decades,” says Cheung. “As we come out of the pandemic, it's a privilege to partner with them by providing the tools that will unlock the next wave of growth and prosperity for their businesses.”About Pepper — Pepper is the eCommerce platform for food distributors. Our clients across the US, Canada, and Mexico use Pepper to power their eCommerce experience for thousands of restaurants, grocery stores, and convenience stores. For more information visit www.usepepper.com."}
{"text": "8 disappointing investor archetypes: How founders can stop falling for them. Lak AnanthContributorShare on Twitter \t\tLak Ananth is founding CEO and managing partner of the global venture capital firm Next47 and serves on the board of several companies that he has helped to grow beyond $1 billion valuations.\tI recently wrote a piece discussing how all capital is not created equal and we are living in a period of super-abundant funding — in many ways, the best times ever for founders.In this environment, every investor has a well-honed pitch on how they can uniquely add value. Being a founder of a high-growth startup means that you will encounter many situations you never have before, so choosing an investor who will be a partner in building the business is a key decision. In this context, promises of exclusive value-add resonate deeply.Surprisingly, most founders find that the actual value they receive from investors is not always as promised. I have had the opportunity to work with amazing investors who build great thought partnerships with their founders, who are invaluable in making the decisions that change the trajectories of companies and have superpowers in attracting talent.Venture investing is an apprenticeship business, and I am humbled whenever I get a chance to learn from a great investor. However, when I speak to founders, it’s more likely that the investors they picked exhibited a variety of post-funding archetype behaviors, all of which detract from value, not add to it.In the spirit of helping founders look beyond the promises of value, let’s delve into some common archetypes of investor relationships that founders experience post-investment. I hope that both founders and investors will read through these archetypes with a sense of humor. Like a good episode of “Silicon Valley,” there is some exaggeration here for effect, but not much!8 disappointing investor archetypesThe narcissist. Narcissists are completely full of themselves, and everything is always about them — how great their firm is and how great they are. They’re so enamored with themselves that they never take time to understand what founders really want or need. Some narcissists may be well past their glory days — just figureheads riding on their former successes — and they’re not going to add value to your startup.The child with a hammer. This is the investor who tells you to follow their advice because, “We used to do this when I was at Google,” or, “When I was on Airbnb’s board, we did this.” They have a hammer, and every problem they see looks like the same nail to be pounded in — in the same way they did it in the one significant experience they previously had in their professional career. They lack the perspective that there could be 10 other ways to approach and solve the problem. Some investors also have a “fire the executive” hammer that can be particularly destructive.The know-it-all. This is the investor in meetings who doesn’t want to hear anyone else’s opinions, including the founders’. “I invested in Facebook before their Series C, therefore I have all the answers.” They don’t respect founders or their fellow board members, which is damaging to vital relationships and board dynamics. They may also have silver bullets like “OKR” or “recurring revenue” that they are partial to without understanding whether these are a good fit for this business and situation.The lapdog (aka the cheerleader). This is the investor who is never going to deliver the hard message to you — they’ll always try to be friends with the founders because they want a recommendation to the next company. They’ll pop in to a meeting and invite you out to dinner or on a lavish ski trip. Anytime there’s a difficult situation, however, they fall back on, “Whatever the founder wants is the right answer,” instead of being a thought partner and bringing a valuable perspective.The service router. If you want someone with a fat Rolodex, then you’ve come to the right place with the service router. Need a CFO or a sales manager? The service router will point you to people but never aim for excellence or help a founder figure out what looks good, say, in a new VP of sales. Service routers are good at recirculating among their portfolio companies. The problem is that the talent might have done a fine job at one company but isn’t the right fit for your startup.The Needy Ned. This investor will drive you nuts because they want to be involved in everything your company does, regardless of whether they’re adding value in the process. This might be the first company they’ve been on the board of, or they might be junior in the venture firm. You’ll know you’re dealing with a Needy Ned when they’re surprised and outraged when you haven’t told them every operational detail of your business. A more difficult version of Needy Ned is someone who not just wants to be involved but is trying to grab the wheel out of the founder’s hands and do things their way.The numbers person. For this investor, business is a big, complex spreadsheet, and everything can be reduced to a number or a ratio. They usually come from private equity, investment banking or growth investing, and they typically throw around terms like revenue churn, ARR and “the magic number.” The trouble is, they don’t understand the story behind the numbers, and they don’t know what it takes to move them.The drive-by. If you want your investor to stay out of your hair after they send some funding your way, then the drive-by is for you. They’re deal machines — even before your deal is sealed, they’re already on to the next one. By the time two years go by, they have completed 10 other deals and they’re not remotely interested in you as a founder or a company. They might attend a board meeting or two, but when they do, they’ll probably be checking their email to nail down their latest deal.My thoughts for foundersUnfortunately, founders fall for these archetypes every day. As you consider your funding options, here are some things to keep in mind.The person matters way more than the firm. Don’t buy the brand; buy the person. Perform due diligence on the person thoroughly and well. Talk to founders and dig into the references the investor gives you using your own back channels. Make sure there is a personality and style match among you, your co-founders and the existing board. In addition, make sure the investor’s knowledge and prior experience match your business.Make sure both the person and the firm really understand your business. One good way to assess this is how much diligence they do on your product, and whether they personally talk to customers as opposed to reviewing call transcripts done by third parties. If an investor does not take the time to truly understand what you are building before they invest, what are the chances they will understand it after, and, more importantly, be a valuable thought partner?Everyone is a good fair-weather sailor, but when there is a failure or small misstep (which, as I point out in my book, “Anticipate Failure,” will surely happen), the worst behaviors rear their ugly head. Examine how the person behaves when important decisions need to be made or when the going gets tough. One way to test is to ask the investor for references to their worst-performing companies and hear directly how they behaved when things were not going well.Check for evidence of value-add and ask for it in writing in quantifiable ways in the term sheet. If they say they are going to help with hiring, ask them to write down goals for the first two quarters. If they say they can help with customers, ask exactly what amount of revenue they will commit to adding. If they say their brand will attract independent board members, ask to speak to board members they have placed.If you take time to find a good fit with an investor, you will significantly maximize the chances of building something great. Even one bad investor on a board can significantly hurt the chances of your success, and I have unfortunately seen this happen a few times.Don’t be lured by promises, valuations and check sizes — these are transitory, and the sugar highs from these shiny objects will last for but a short period. Keep your eye on the goal and pick your investor wisely."}
{"text": "GajiGesa, a fintech for unbanked Indonesian workers, lands $6.6M pre-Series A. GajiGesa’s earned wage access feature user flowGajiGesa, a fintech company focused on services for Indonesian workers, announced today that it has raised $6.6 million USD in pre-Series A funding. The round was led by MassMutual Ventures, with participation from January Capital, European earned wage access company Wagestream (EWA is GajiGesa’s flagship feature), Bunda Group, Smile Group, Oliver Jung, Northstar Group partners including Patrick Walujo, Nipun Mehra (the CEO of Ula) and Noah Pepper (Stripe’s head of APAC). Returning investors included defy.vc, Quest Ventures, GK Plug and Play and Next Billion Ventures.For a more in-depth look at GajiGesa, take a look at TechCrunch’s profile of the company from February, when it raised its $2.5 million seed round.GajiGesa, a fintech startup serving underbanked Indonesian workers, raises $2.5 million seed roundAgrawal and Malinowska said in a press release that GajiGesa’s team has doubled in size over the past six months to over 50, and the startup plans to use its latest funding on product development, expansion across Indonesia and entering new markets in Southeast Asia.The startup is aimed at unbanked workers and focuses on earned wage access, which lets people withdraw their wages immediately instead of waiting for monthly paychecks, because the founders—husband-and-wife team Vidit Agrawal and Martyna Malinowska—said that gives workers much more liquidity and protects them from predatory lenders.GajiGesa now works with more than 120 companies in a wide range of sectors, including factories, plantations, manufacturing, retail, restaurants, hospitals and tech companies. Based on a survey of its clients, GajiGesa claims that over 80% of their employees have stopped using informal lenders because of its EWA feature and 40% are using other financial services through the platform like bill payments and data recharge.The company offers an employer app called GajiTim, which it claims is Southeast Asia’s “first and largest integrated employee management solution.” By that, it means that employers can manage a wide array of workforce administrative tasks, including part-time and full-time employees and gig workers. The company says GajiTim currently has more than 200,000 users.In a statement about the investment, MassMutual Ventures managing director Anvesh Ramineni said, “[GajiGesa’s] integrated platform combines customer-centric product design and world class technology infrastructure to ensure they are uniquely positioned to empower an chronically underserved market and help expand financial resilience for millions across Southeast Asia.Wagestream closes $51M Series A to plug the payday gap without putting workers in debtWagely, an Indonesian earned wage access and financial services platform, raises $5.6M "}
{"text": "Foundry Lab raises $8M to quickly, cheaply create metal castings using a microwave. Remember Easy Bake Ovens? You’d mix up some colored powder and water until a dough or batter formed, put it in a mold, pop it in the oven, and before you knew it — ding! A disgusting treat. Foundry Lab, a New-Zealand based startup with backing from Rocket Lab’s Peter Beck, has figured out how to do something similar, except instead of chemicals and an “oven,” it’s metals and a microwave.The company, which emerged from stealth on Monday with an $8 million Series A raise, is using “literally a microwave, but on steroids” to cast metal parts much quicker than metal 3D printing, according to David Moodie, founder and CEO of Foundry.“It’s super easy for the user; they literally take the mold, throw in the cold metal powder or metal ingots, put it in the microwave, press the button and walk away,” Moodie told TechCrunch. “It even dings when it’s done. As easy as heating up a microwave dinner.”(Foundry’s microwave has also been used to cook a typical New Zealand meat pie. It took only a few seconds and didn’t taste fantastic, according to Moodie.)Typical casting systems like investment casting, 3D printing and die-casting take anywhere from one to six weeks to produce. Foundry says it has been able to turn around brake shoes for cars in under eight hours using molds that had been 3D printed using computer-aided design (CAD) molds and a giant microwave. The startup is currently working with zinc and aluminum, but has done some successful stainless steel trials and wants to move onto other metals like copper and brass in the future.While Foundry’s tech has future applications in manufacturing industries where metal 3D printing can’t reach, the near-term goal is to help car manufacturing R&D teams develop production-identical, functional metal parts that can be used for testing and prototyping before committing to mass production.“One of the companies we’re talking to is making up to 600 prototype cars before one reaches the market, so they’ll keep changing and keep iterating on it, and that can get expensive really quickly,” Moodie said, adding that tooling costs could be upwards of $50,000 to $100,000.Moodie says before starting Foundry, he ran an industrial design consultancy business, designing products for mass manufacture. He felt frustrated that authorities would consistently reject patent applications because they were made with parts produced by 3D printers or CNC machines, and therefore, potentially made with the wrong physical structures.“So I did the Kiwi thing and went to the shed and lucked my way into a system that worked,” he said, noting that much of his experimenting was done using standard microwaves during New Zealand’s latest lockdown, during which time Moodie couldn’t get into his workshop. “What we’re trying to solve is actual castings, trying to simulate a die casting but doing it fast and cheaply. If you machine to a tool to do a die casting, it’s typically three to six months to get that back.”It’s still early days for Foundry. The company only has a couple of its very large microwaves out for trial with potential customers at the moment, but it will use the Series A funding, which came from Australian VC Blackbird, to get production-ready by the end of 2023.Part of the funding will go toward hiring more staff. The company has grown quickly over the past few months, up from six staffers when it first started fundraising to 17 full-time employees now. The goal is to make it to around 35 over the coming months, a task that’s been difficult with New Zealand’s strict pandemic-related border closures.“The whole border close thing is starting to hit us now,” said Moodie. “The country’s got two microwave experts, and they both have jobs. That’s been particularly difficult. So we’re trying to get someone to come across and help us.”New Zealand is beginning to open up internally, with Auckland coming out of lockdown this week and the city borders opening up to the rest of the country in mid-December. Unless the new omicron variant holds things up, the country is expected to start inviting vaccinated travelers back starting April 30, 2022, giving Foundry and other New Zealand startups the chance to hire talent from abroad.Even though Foundry is working out of New Zealand, it’s targeting markets in the United States and Europe. The company’s long game is to continue to work on the microwaves and get them to a point where they can produce the quantities needed for mass production."}
{"text": "Foundry Lab raises $8M to quickly, cheaply create metal castings using a microwave. Remember Easy Bake Ovens? You’d mix up some colored powder and water until a dough or batter formed, put it in a mold, pop it in the oven and before you knew it – ding! A disgusting treat. Foundry Lab, a New Zealand-based startup with backing from Rocket Lab’s Peter Beck, has figured out how to do something similar, except instead of chemicals and an “oven,” it’s metals and a microwave.The company, which emerged from stealth on Monday with an $8 million Series A raise, is using “literally a microwave, but on steroids” to cast metal parts much quicker than metal 3D printing, according to David Moodie, founder and CEO of Foundry.“It’s super easy for the user; they literally take the mold, throw in the cold metal powder or metal ingots, put it in the microwave, press the button and walk away,” Moodie told TechCrunch. “It even dings when it’s done. As easy as heating up a microwave dinner.”(Foundry’s microwave has also been used to cook a typical New Zealand meat pie. It took only a few seconds and didn’t taste fantastic, according to Moodie.)Typical casting systems like investment casting, 3D printing and die-casting take anywhere from one to six weeks to produce. Foundry says it has been able to turn around brake shoes for cars in under eight hours using molds that had been 3D printed using computer-aided design (CAD) molds and a giant microwave. The startup is currently working with zinc and aluminum, but has done some successful stainless steel trials and wants to move onto other metals like copper and brass in the future.While Foundry’s tech has future applications in manufacturing industries where metal 3D printing can’t reach, the near-term goal is to help car manufacturing R&D teams develop production-identical, functional metal parts that can be used for testing and prototyping before committing to mass production.“One of the companies we’re talking to is making up to 600 prototype cars before one reaches the market, so they’ll keep changing and keep iterating on it, and that can get expensive really quickly,” Moodie said, adding that tooling costs could be upwards of $50,000 to $100,000.Moodie says before starting Foundry, he ran an industrial design consultancy business, designing products for mass manufacture. He felt frustrated that testing authorities would consistently reject applications because they were made with parts produced by 3D printers or CNC machines, and therefore, potentially made with the wrong physical structures.“So I did the Kiwi thing and went to the shed and lucked my way into a system that worked,” he said, noting that much of his experimenting was done using standard microwaves during New Zealand’s latest lockdown, during which time Moodie couldn’t get into his workshop. “What we’re trying to solve is actual castings, trying to simulate a die casting but doing it fast and cheaply. If you machine to a tool to do a die casting, it’s typically three to six months to get that back.”It’s still early days for Foundry. The company only has a couple of its very large microwaves out for trial with potential customers at the moment, but it will use the Series A funding – which was led by Australian-founded VC Blackbird alongside GD1, Icehouse, K1W1, Founders Fund, Promus and WNT Ventures – to get production-ready by the end of 2023.Part of the funding will go toward hiring more staff. The company has grown quickly over the past few months, up from six staffers when it first started fundraising to 17 full-time employees now. The goal is to make it to around 35 over the coming months, a task that’s been difficult with New Zealand’s strict pandemic-related border closures.“The whole border close thing is starting to hit us now,” said Moodie. “The country’s got two microwave experts, and they both have jobs. That’s been particularly difficult. So we’re trying to get someone to come across and help us.”New Zealand is beginning to open up internally, with Auckland coming out of lockdown this week and the city borders opening up to the rest of the country in mid-December. Unless the new omicron variant holds things up, the country is expected to start inviting vaccinated travelers back starting April 30, 2022, giving Foundry and other New Zealand startups the chance to hire talent from abroad.Even though Foundry is working out of New Zealand, it’s targeting markets in the United States and Europe. The company’s long game is to continue to work on the microwaves and get them to a point where they can produce the quantities needed for mass production."}
{"text": "Southeast Asia multi-currency neobank YouTrip raises $30M Series A, will launch corporate card. Singapore-based YouTrip, an online bank that focuses on making multi-currency transactions less costly and more efficient, announced today that it has raised a $30 million Series A. YouTrip founder and CEO Caecilia Chu said the round was led by prominent family offices in Asia who prefer to remain unnamed, but are returning from earlier rounds. The Series A brings YouTrip’s total funding to more than $60 million. The company says it has now processed over $800 million in card spend globally, with almost 20 million transactions and over 1.5 million app downloads.Chu told TechCrunch that YouTrip decided to raise funding because it’s reaching an “inflection point.” “As Southeast Asia is coming out of the pandemic, and with Singapore really leading the way with the vaccination rate, what we saw on the consumer front is a huge pent-up demand in travel and also the recovery of consumer confidence,” she said. “We definitely see more spending on e-commerce and in terms of travel, we’ve seen daily transaction volumes grow at least two to three times since the beginning of Singapore’s vaccinated travel lanes.” Even though YouTrip is optimistic about those tailwinds, its taking a realistic approach toward the recovery of travel. In the medium-term, Chu said the company is most excited about consumer spending and its new B2B business, which includes a multi-currency corporate card called YouBiz. Caecilia Chu, Co-founder and CEO, YouTripOver the next year, YouTrip also plans to focus on geographical expansion. Currently operational in Singapore and Thailand, it has partnered with Visa to expand into the Philippines and Malaysia. Chu added that the company is also in late-stage discussions with partners to launch in Indonesia and Vietnam. When TechCrunch last covered YouTrip in 2019, one of core customer bases were international travelers. When COVID hit, the company had to adapt very quickly. YouTrip, a challenger bank in Southeast Asia, raises $25.5M for expansionIt added new features like YouTrip Perks, setting up partnership teams to work with merchants like Lazada and Shopee on cashback deals of up to 15%. “During the pandemic, people were not only buying much more things online, but also they were more health conscious, so we saw more purchases of sporting equipment and health supplements,” said Chu. “We’ve been targeting the most relevant merchants for our users, to get those merchants partnerships going.” The company says its transaction volume has now returned to pre-pandemic levels. Since it anticipates more traction as consumer spending and travel increases, YouTrip plans to introduce a brand makeover for its consumer app in early 2022, along with new payment features. YouBiz, its corporate card, is also slated for launch in early 2022. Chu says one of the reasons the company entered the B2B space was because more SMBs are adopting fintech services. “We know how important it is to be a truly pandemic-resilient company,” she added. “We promised ourselves that we would no longer read the news every day to see when the borders would reopen. We would make it work and continue to make it work regardless of new travel measures.” The company has also witnessed a paradigm shift among SMBS.“They’re really more open-minded to fintech products, to new banking products,” Chu said. “More relevant to us, because of the whole working from home and hybrid models, companies are increasingly distributed. Their payroll, vendor payments, even how they receive revenue or how they invoice their consumers is worldwide, and their foreign currency needs are certain to go up, so we feel that it is really the right time to segment into this market.” Once YouBiz is launched, YouTrip will be among several Southeast Asia VC-backed fintech companies that offer corporate cards or focus on the SMB space, including Aspire, Spenmo and Volopay. But Chu says the SMB space is not only huge compared to the consumer space, but “there is a massive opportunity because it is a heavily underserved one.” Aspire raises $158M Series B to build a full-stack “financial operating system” for Southeast Asian businessesIn particular, YouTrip plans to focus on companies that have between one to 1,000 employees. It picked this segment because YouBiz is not meant to be a replacement for traditional bank accounts. Instead, its main value-add is enabling SMBs to spend less on foreign currency transactions. YouTrip also plans to introduce an expense management tool, with an eye toward business travel picking up again. “I feel like on the SMB front, it’s not going to be one winner takes all. But getting back to the competition, we are also going into the space with our eyes wide open,” Chu said. “We have two key advantages that really stand out. One is that we are the only neobank that owns our entire tech infrastructure and licensing infrastructure end to end.” YouTrip invested a lot in its own technology stack “because the margin is razor-thin in consumer payment services, so in order to deliver the best cost and value, we need to optimize our value chain to a level where we have full control,” including over its product roadmap. YouTrip’s second advantage is that already has strong brand recognition. “When we talk to business owners, many are already users of YouTrip for their own purchases,” Chu said. That track record is helping YouTrip as it pitches itself to SMBs and Chu says the company already has 1,000 sign-ups for the launch of its B2B service. Insight Partners leads $34M round in Singapore-based fintech Spenmo"}
{"text": "Flowrite is an AI writing productivity tool that wants to help you hit inbox zero. When TechCrunch asks Flowrite if it’s ‘Grammarly on steroids’, CEO and co-founder Aaro Isosaari laughs, saying that’s the comment they always get for the AI writing productivity tool they’ve been building since late summer 2020 — drawing on early access to OpenAI’s GPT-3 API, and attracting a wait-list of some 30,000 email-efficiency seeking prosumers keen to get their typing fingers on its beta.The quest for ‘Inbox zero’ — via lightning speed email composition — could be rather easier with this AI-powered sidekick. At least if you’re the sort of person who fires off a bunch of fairly formulaic emails each and every day.What does Flowrite do exactly? It turns a few instructions (yes you do have to type these) into a fully fledged, nice to read email. So where Grammarly helps improve a piece of (existing) writing, by suggesting tweaks to grammar/syntax/style etc., Flowrite helps you write the thing in the first place, so long as the thing is email or some other professional messaging type comms.Email is what Flowrite’s AI models have been trained on, per Isosaari. And frustration with how much time he was having to spend composing emails was the inspiration for the startup. So its focus is firmly professional comms — rather than broader use cases for AI-generated words, such as copy writing etc (which GPT-3 is also being used for).Grammarly raises $200M at a $13B valuation to make you an even better writer using AI“In my previous work I knew that this is a problem that I had — I’d spend several hours every day communicating with different stakeholders on email and other messaging platforms,” he says. “We also knew that there are a lot more people — it’s not just our problem as co-founders; there’s millions of people who could benefit from communicating more effectively and efficiently in their day to day work.”Here’s how Flowrite works: The user provides a set of basic (bullet pointed) instructions covering the key points of what they want to say and the AI-powered tool does the rest — generating a full email text that conveys the required info in a way that, well, flows.Automation is thus doing the wordy leg work of filling in courteous greetings/sign-offs and figuring out appropriate phrasing to convey the sought for tone and impression.Compared to email templates (an existing tech for email productivity), Isosaari says the advantage is the AI-powered tool adapts to context and “isn’t static”.One obvious but important point is that the user does also of course get the chance to check over — and edit/tweak — the AI’s suggested text before hitting send so the human remains firmly the agent in the loop.Isosaari gives an example use-case of a sales email where the instructions might boil down to typing something like “sounds amazing • let’s talk more in a call • next week, Monday PM” — in order to get a Flowrite-generated email that includes the essential details plus “all the greetings” and “added formalities” the extended email format requires.(Sidenote: Flowrite’s initial pitch to TechCrunch was via email — but did not apparently involve the use of its tool. At least the email did not include a disclosure that: “This email is Flowritten” as a later missive from Isosaari (to send the PR as requested) did. Which, perhaps, gives an indication of the sorts of email comms you might want to speed-write (with AI) and those you maybe want to dedicated more of your human brain to composing (or at least look like you wrote it all yourself).)“We’ve built an AI powered writing tools that helps professionals of all kinds to write and communicate faster as part of their daily workflow,” Isosaari tells TechCrunch. “We know that there’s millions of people who spend hours every day on emails and messages in a professional context — so communicating with different stakeholders, internally and externally, takes a lot of work, daily working hours. And Flowrite helps people to do that faster.”The AI tool could also be a great help to people who find writing difficult for specific reasons such as dyslexia or because English is not their native language, he further suggests.One obvious limitation is that Flowrite is only able to turn out emails in English. And while GPT-3 does have models for some other common languages, Isosaari suggests the quality of its ‘human-like’ responses there “might not be as good” as they are in English — hence he says they’ll remain focused there for now.They’re using GPT-3’s language model as the core AI tech — but have also, recently, begun to use their own accumulated data to “fine tune it”, with Isosaari noting: “Already we’ve built a lot of things on top of GPT-3 as opposed to building a wrapper on it.”The startup’s promise for the email productivity tool is also that the AI will adapt to the user’s writing style — so that faster emails won’t also mean curtly out of character emails (which could lead to fresh emails asking if you’re okay?).Isosaari says the tech is not not mining your entire email history to do this — but rather only looks at the directly preceding context in an email thread (if there is one).Flowrite does also currently rely on cloud processing, since it’s calling GPT-3’s tech, but he says they want to move to on-device processing, which would obviously help address any confidentiality concerns, when we ask about that.For now the tool is browser-based and integrates with web email. Currently it only works for Chrome and Gmail but Isosaari confirms the team’s plan is to expand integrations — such as for messaging platforms like Slack (but still initially at least, only for the web app version).While the tech tool is still in a closed beta, the startup has just announced a $4.4 million seed raise.The seed is led by Project A, along with Moonfire Ventures and angel investors Ilkka Paananen (CEO & Co-founder of Supercell), Sven Ahrens (director of global growth at Spotify), and Johannes Schildt (CEO & Co-Founder of Kry). Existing investors Lifeline Ventures and Seedcamp also joined in the round.What types of emails and professionals is Flowrite best suited for? On the content side, Isosaari says it’s “typically replies where there’s some kind of existing context that you are responding to”.“It’s able to understand the situation really well and adapt to it in a really natural way,” he suggests. “And also for outreaches — things like pitches and proposals… What it doesn’t work that well for is if you want to write something that is really, really complex — because then in order to do that you would need to have all that information in the instructions. And then obviously if you need to spend a lot of time writing the instruction that could be even close to the final email — and there’s not much value that Flowrite can provide at that point.”It’s also obviously not going to offer great utility if you’re firing off “really, really short emails” — since if you’re just answering with a couple of words it’s likely quicker to type that yourself.In terms of who’s likely to use Flowrite, Isosaari says they’ve had a broad range of early adopters seeking to tap into the beta. But he describes the main user profile as “executives, managers, entrepreneurs who communicate a lot on a daily basis” — aka, people who “need to give a good impression about themselves and communicate very thoughtfully”.On the business model front, Flowrite’s initial focus is on prosumers/individual users — although Isosaari says it may look to expand out from there, perhaps first supporting teams. And he also says he could envisage some kind of SaaS offering for businesses down the line.Currently, it’s not charging for the beta — but does plan to add pricing early next year. “Once we move out of the beta then we’ll be starting to monetize,” he adds, suggesting that a full launch out of beta (so no more waitlist) could happen by mid 2022. The seed funding will primarily be spent on growing the team, according to Isosaari, especially on the engineering side — with the main goal at this early stage being to tool up around AI and core product.Expanding features is another priority — including adding a “horizontal way” of using the tool across the browser, such as with different email clients.This report was updated to clarify a quotation by Isosaari as he intended to say Flowrite is not just building a wrapper for GPT-3 but rather that it’s building on top of itOkay, the GPT-3 hype seems pretty reasonable"}
{"text": "\nCustomer Identity and Access Management Provider Strivacity Announces $9.3 Million in Series A Funding\n. HERNDON, Va.--(BUSINESS WIRE)--Strivacity, a customer identity and access management (CIAM) provider, today announced that the company secured a total of $9.3 million in Series A financing. The funding round was led by Ten Eleven Ventures with participation from Toba Capital.The average person has 100 different applications and services which require a password1. The brands that run those apps and services work hard to create great experiences for their customers. Yet CIAM solutions offered by large identity and access management (IAM) providers force companies to make tradeoffs between creating the best customer experience, securing their customers’ data and staying compliant with fast-changing privacy regulations. Too often, this results in engineering and security teams getting bogged down with lengthy custom-coding projects.“Business shouldn’t be forced to choose between providing a great customer journey and keeping data secure,” said Keith Graham, CEO of Strivacity. “Customers have more choices today than ever before, and they expect the brands they interact with to provide great service and safeguard their personal information. Strivacity adds secure CIAM capabilities to your online properties fast so you can grow your revenue, stay compliant with fast-changing privacy regulations and personalize your service thanks to the insights you’ll get into how customers interact with you.”Strivacity is the CIAM provider that enables companies around the globe to simultaneously provide a standout customer experience while maintaining rigorous security and compliance standards. From centralizing the management and storage of customer identities to enforcing data sovereignty, Strivacity helps their customers prioritize their users while also keeping their own marketing, engineering, security and compliance teams happy. According to Gartner, \"By 2022 CIAM will be a key component of a competitive UX strategy by 85% of organizations, up from 40% today.\"2“CIAM tools are a great driver for digital transformation, but in their current form, are still pretty complex,” said Todd Weber, CTO and operating partner at Ten Eleven Ventures. “Stitching together all the right processes and tooling – while balancing customer needs, security, privacy and compliance – is simply more difficult than it should be, and requires too much extra time and custom coding by development teams. Strivacity has developed a new kind of CIAM solution that solves this challenge by giving developers a platform to work with and creates a better experience for users. Strivacity shows how much better CIAM can be, and we’re thrilled to help bring their innovation to the world. Get ready for apps to become a whole lot easier to develop – and to use.”Strivacity will use the funding to accelerate R&D and expand go-to market investments in sales and marketing. As part of the investment, Todd Weber will join Strivacity’s board of directors.To learn more about Strivacity:Read more about what we do;Get Kuppinger Cole’s perspective on Strivacity; orStart your free trial today.About StrivacityStrivacity lets brands add secure log-in and identity management capabilities to their customer-facing applications without tying up an army of developers or consultants. We offer a unified customer identity and access management (CIAM) solution that uses clicks (not custom coding) so organizations can get going fast and don’t have to choose between creating great customer experiences, securing their customers’ data and staying compliant with fast-changing privacy regulations like GDPR and CCPA. To learn more about Strivacity, visit https://strivacity.com/.1NordPass, https://tech.co/password-managers/how-many-passwords-average-person, 6 November 20212Gartner, Technology Insight for Customer Identity and Access Management, by Henrique Teixeira, Michael Kelly, Ant Allan, Jonathan Care, 21 September 2021"}
{"text": "Fundbox, a fintech focused on SMBs, raises $100M at a $1.1B valuation. Fundbox, a company that offers loans and financial products to small businesses, announced today it has raised $100 million in a Series D round at a valuation of $1.1 billion.Or more simply, the company aims to solve SMBs’ working capital needs through its credit and payments offerings. It is particularly focused on B2B-focused small businesses.“We use artificial intelligence to deliver financial products that small business owners use to better run and grow their businesses,” CEO Prashant Fuloria told TechCrunch.Healthcare of Ontario Pension Plan (HOOPP) led Fundbox’s Series D financing, which brings the company’s total equity raised to $410 million since its 2013 inception. Existing backers Allianz X, Khosla Ventures and The Private Shares Fund joined new investors including Arbor Waypoint Select Fund and a suite of BNY Mellon funds managed by Newton Investment Management North America.San Francisco-based Fundbox last raised in 2019 — a $175 million Series C that valued the company at $700 million post-money. That same year, the company also opened its Dallas office, now its largest in the U.S., “to capitalize on the talent pool there,” according to Fuloria.Fundbox is refreshingly transparent about its financials, at least when it comes to revenue. The startup, which saw a pandemic-related boost in business, crossed $100 million in annual revenue run rate earlier this year. Today, it is “well and truly beyond” that, Fuloria said, although it is not yet profitable as it is focused on growth, he said.Since the company launched its first product in 2013, it has “connected with” over 325,000 small businesses and transacted over $2.5 billion in working capital, the executive added. In 2021, Fundbox tripled its new customer acquisition rate. But the majority of its revenue comes from existing customers, who Fuloria describes as “incredibly loyal.” He believes one of the company’s biggest differentiators — besides its use of AI and data — is that it is focused on SMBs whose customers are other businesses, rather than consumers.For example, Fundbox works with SMBs that serve customers like restaurants, such as businesses supplying food or companies supplying cleaning and staffing services to these restaurants.“These B2B SMBs have the same challenges as everybody else except that they invoice their clients and then they wait to get paid,” Fuloria told TechCrunch. “All of this capital tied up in unpaid receivables is a huge drag on those SMBs. So one of the things that Fundbox does is provide tools to unlock that working capital that’s tied up in unpaid invoices, which actually adds up to over a trillion dollars in the U.S. alone.” Customers, he added, can receive approval in minutes, with access to capital as soon as the next business day.Khosla led Fundbox’s Series A in 2014 and founding partner and managing director David Weiden said his firm was initially — and remains — impressed with Fundbox’s founders’ ability to recognize there were “dramatic increases in the availability of relevant data in the small business market.”“Many companies talk about data and using AI; ironically, only a few have any data that demonstrates the actual effectiveness of their approach,” he wrote via email. “Fundbox, including over the exceptional pandemic period, delivered strong results and are on a path to continued growth and scale.”Fundbox Secures $50 Million More To Power Small BusinessesThe company’s customers range from sole proprietors with a few dozen employees and as little as a few hundred thousand dollars a year or businesses with as much as a few million dollars a year in annual revenue. Fundbox asks its customers to connect with it via some aspect of their transactional system, such as their invoicing app or even their bank account.“We look at these business transactions sitting in their systems and put together what we call a business graph where you can imagine the nodes of the graph being all these small businesses that are trading with each other, with the customers being their vendors and the connections being their transactions,” Fuloria explained. “And that graph becomes our picture of the small business economy to derive signals or features that can be used to assess the risk of a B2B transaction or a B2B small business.”Image Credits: FundboxThe company then uses those risk assessments to provide tools, such as working capital on tap or the ability to get instant funding against an invoice. It also integrates with other companies’ technology. For example, it’s partnered with Intuit and is natively integrated inside of QuickBooks. It also shows up in places like FreshBooks’ accounting software or in Synchrony’s merchant center (Synchrony is an investor in Fundbox).The small end of the small businesses are often ignored by large banks, Fuloria contends, because the average bank spends over $3,500 (largely in human capital) in assessing a small business’s risk. For loans that aren’t much more than that, it’s not exactly worth it. However, to be clear, Fundbox says it offers up to $150,000 in lines of credit.“Our focus on using AI to make these decisions really helps us shine because more than 99% of all our decisions are completely automated without any human involvement whatsoever,” Fuloria said. “And that lets us really scale and serve customers very, very efficiently.”While primarily having served as a lender, Fundbox is now expanding into payments and membership-based offerings (with the intent to generate a subscription revenue stream). The company recently launched Flex Pay, which is designed to provide small business owners with additional payment options and greater flexibility for business expenses.For example, Fundbox Line of Credit customers now get three extra days to pay those expenses. Repayment options include a bank account, credit card or Line of Credit draw, essentially providing small business owners with another tool to buy now, pay later, according to Fuloria.Looking ahead, next year Fundbox plans to develop a product aimed specifically at entrepreneurs with multiple small businesses as well as new businesses that lack the financial history to access capital through traditional means.Shrirang Apte, VP of HOOPP, believes Fundbox’s performance this year speaks to the market opportunity “in disrupting the highly underserved world of small business financing, which has traditionally lagged behind consumer financing innovations.”Fundbox plans to use its new capital to expand its 300-person team, customer acquisition and expanding its product offerings. It recently hired a handful of new execs, including two former Capital One veterans — Khary Scott and Shawn Haigh to serve as VP and head of partnerships and VP of growth marketing, respectively."}
{"text": "CloudTrucks raised $115M Series B to help truck entrepreneurs manage their business. CloudTrucks wants to use technology to help trucking entrepreneurs operate their business: The California-based startup sells business management software that helps owner-operators manage cash flow and costs, generate revenue, handle insurance, and more, and it just raised a $115 million Series B.The company will use the funds to increase headcount as it expands its business, which operates in the United States. CloudTrucks is hiring in almost all areas, with a focus on engineers and data scientists to help double down on product, as well as customer service professionals to support truckers on the road. The company also wants to broaden its digital integration with brokers and shippers.“We cater to owner-operators and truck drivers who have one or more trucks and are managing their business while also doing the job of moving goods from point A to point B,” Tobenna Arodiogbu, co-founder and CEO of CloudTrucks, told TechCrunch. “The job of being a trucking entrepreneur is getting harder and harder. Lots of tools are being built for brokers and shippers, but not nearly enough is being done for the truck driver who’s actually doing the really hard work.”Freight movement is expected to rise from 17.4 billion tons in 2015 to 25.5 billion tons by 2045, an increase that coincides with a decrease in truck drivers. Since the 1980s, the industry has experienced high turnover rates, in large part due to low wages and the poor health effects associated with the job. Without significant changes to the business model and talent pool, the truck driver shortage is estimated to hit 160,000 drivers by 2028, according to Deloitte.The autonomous trucking space promises to one day alleviate these labor issues, but that shift will take place over decades and likely include integration between humans handling first- and last-mile deliveries and self-driving systems managing highway transport, according to Deloitte. Waymo Via’s transfer hub model is a perfect example of this.Despite future projections of a driverless world, Arodiogbu sees a market need now. There are around 350,000 owner-operator truckers in the United States, according to the nonprofit Owner-Operator Independent Drivers Association, but Arodiogbu reckons the target market is actually as large as a million truck drivers. Owner-operators usually own one truck and either lease onto a carrier or operate under their own authority, but CloudTrucks also targets entrepreneurs who have up to five trucks, as well as truckers who are contractors.Before founding CloudTrucks, Arodiogbu started Scotty Labs, a startup focused on building remote operations and autonomous driving solutions for the trucking industry, which was later acquired by DoorDash. While running the company, Arodiogbu gained insights into the problems truck drivers had with managing their businesses and why the industry has been attracting fewer drivers, resulting in today’s truck driver shortage. These issues include things like trouble making revenue-generating decisions, the rising costs of insurance and compliance, and how long it takes to get paid.“It’s not just a job of driving, but it’s everything else that people have to manage,” said Arodiogbu. “An increasing number of truck drivers just don’t want to be company employees anymore, right? They want to take control of their time. They want to determine when they’re home and when they’re on the road. They want to determine when they get to spend time with their families.”CloudTrucks launched three products over the past year to help solve trucking business challenges. CT Cash helps drivers get paid faster and alleviate cash flow constraints with instant pay and cash card options, as well as cash advances, so drivers don’t have to worry about not having enough funds for fuel or maintenance.Flex, which is designed for small trucking businesses that are already managing their own insurance and compliance, helps with back office support. This product came from an existing product line called Virtual Carrier, which essentially puts drivers under CloudTrucks’ authority. Included in this is a package deal where CloudTrucks manages everything for the driver, including compliance and insurance.Included in both Flex and the Virtual Carrier is a “schedule optimizer” feature, which Arodiogbu described as a dispatcher in your pocket. CloudTrucks has the schedule and preferences for every driver in its system, so it’s able to send suggestions for available loads that can help maximize revenue given preferences and the states they’re willing to drive to. Drivers can book those loads within the platform, which helps simplify the whole process.Then there’s Business Intelligence, a dashboard that gives drivers a breakdown of their performance, personal expenses and revenue.“You can’t really improve something that you don’t track, so with that in mind, we wanted to have a product that was very simple for a trucking entrepreneur to just look at the CloudTrucks app and, at a glance, see exactly how their business is performing,” said Arodiogbu.As far as how CloudTrucks’ business is performing, the company said its revenue has increased 9.5x since it raised its $20.5 million Series A in December 2020. The startup also said it’s seen the number of loads completed on its platform grow 8x since last year, but declined to provide a base for either of those increases. Arodiogbu did say that the company completes thousands of loads around the country per month.CloudTrucks’ Series B was led by Tiger Global with participation from Menlo Ventures, as well as investment from Flexport and angel investors Michael Ovitz and Opendoor CEO Eric Wu, and brought the startup’s total funding amount to $141.6 million."}
{"text": "Developer productivity tools startup Raycast raises $15M from Accel and Coatue. Developer-focused productivity tool Raycast has raised $15 million in Series A funding, led by Accel and Coatue. Also participating in the round were angel investors Johnny Boufarhat, CEO and founder of Hopin; Jeff Weinstein, product at Stripe; Jason Warner, former CTO of GitHub; and Ott Kaukver, CTO of Checkout.com, among others.Raycast was founded in 2020 by former Facebook software engineers Thomas Paul Mann and Petr Nikolaev, who sought to create a way to recover the time developers lose every day due to continuous context-switching between different SaaS tools.“We started the company because we wanted to improve how we work with computers,” CEO Mann told TechCrunch in an interview. “As developers ourselves, we find ourselves spending a lot of time on busywork that doesn’t bring that much value. We’d rather spend our time on the work that actually matters. This is the premise of Raycast — we bring you a tool that helps you get work done faster.”Raycast aims to make it easier for developers to find and update information with its command-line-inspired interface. The platform enables the automation of day-to-day processes and allows developers to focus on important tasks. The desktop software takes a note from peers like Superhuman and Command E, allowing users to quickly pull up and modify data with keyboard shortcuts. Users can easily create and re-modify issues in Jira, merge pull requests in GitHub and find documents. The software is essentially a developer-focused version of Apple’s Spotlight search, which aims to help software engineers navigate all the parts of their job that aren’t development work using a single tool.In terms of growth, Raycast says that in just 12 months, it has increased its daily active user base from 130 in October 2020 to over 11,000 to date, with more than 20 million actions performed on the platform in that time. The team currently consists of 12 members, with more people expected to join by the end of the year.Raycast has also released its Extensions API and Store in public beta, giving developers the ability to build custom extensions and share them with their team or community. The company says that in one month, the community built more than 100 extensions on the beta, connecting to services like Figma, GitHub, Chrome, Notion, YouTube, Twitter and more. Raycast is now publicly launching the Extensions API and Store, opening it up to developers around the world.Image Credits: RaycastAs for the new funding, Mann said Raycast wants to become the leader in developer productivity.“That’s our goal with the funding. We will use the funding to scale our team further up. We want to make this platform universally accessible to everyone so that they can build the tools they want to have,” he said.Raycast plans to use the funding to build its community of developers and tools, accelerate growth on the platform, and bring Raycast to teams. Although the company will remain heavily focused on individual developers, Raycast sees potential in making it easy to share productivity tools and workflows with others. Starting today, companies will be able to sign up for a program to get access to new team features. Users will be able to create their own internal store, where they can build and distribute custom extensions and links specific to the needs of their teams.“Teams can now build extensions and share them privately with their team members,” Mann said. “If they have an internal tool that makes themselves more productive with the custom setup they have, they can share that with their team members so they can benefit from it as well. This helps them stay productive as a team and saves them time on the busywork they usually have.”Raycast’s Series A funding follows the company’s $2.7 million seed round from October 2020. The round was led by Accel, with participation from YC, Jeff Morris Jr.’s Chapter One fund, as well as angel investors Charlie Cheever, Calvin French-Owen and Manik Gupta.“Since leading Raycast’s seed investment, we’ve been impressed with the growth and traction Raycast has seen in the developer community,” Andrei Brasoveanu, a partner at Accel, said in a statement. “This backs up our initial belief that Raycast has the potential to become an indispensable tool for developers, and we’re excited to see the team go even further with the launch of the API and Store and expansion to teams. We’re delighted to continue supporting Thomas and Petr on their ambitious journey.”"}
{"text": "Groundswell Announces A Total of $15M in Seed Funding To Democratize Philanthropy. LOS ANGELES--(BUSINESS WIRE)--Groundswell, the Philanthropy-as-a-Service platform that’s empowering employees with their own personal donor-advised funds (DAFs), today announced that they have raised a total of $15M in seed investment funding. The round was led by GV (formerly Google Ventures), with participation from Human Ventures, Moonshots Capital, Felicis Ventures, and Core Innovation Capital.Groundswell is revolutionizing how companies think about employee compensation by decentralizing corporate philanthropy and using it to fund personal donor-advised funds for each employee. Like the 401k did for retirement, Groundswell puts employees in the driver's seat of corporate philanthropy and empowers them to create worldwide impact. Employee users are also provided with tools historically reserved for the ultra-rich, including tax-free investment opportunities, customized giving opportunities, frictionless donation options, and centralized impact reporting. The platform aims to become a ubiquitous component of employee benefits packages and charitable giving.As the war for talent heats up, Groundswell will help companies authentically unlock corporate purpose alongside profit by channeling corporate social responsibility efforts through employees. By directly gifting or matching contributions into employee DAFs, companies are empowering their workforce to find the solutions they want to see to the problems they feel are most pressing - a powerful acknowledgement of the diversity of employees’ backgrounds. Additionally, as the shift to remote work accelerates, Groundswell allows workers to be the change in their community - regardless of where that community is. Considering that more Americans give to charity each year than contribute to a 401(k), Groundswell’s approach will provide a financial boost to a significant portion of the workforce.“We want to create a new category of service that combines the best aspects of HR tech, fintech, and philanthropy,” says Jake Wood, Co-Founder & CEO, who previously led the highly regarded nonprofit Team Rubicon. “Our Philanthropy-as-a-Service approach is democratizing philanthropy for the masses, by enabling them to give better, smarter, easier, and more intentionally. We’re excited to have found investors who understand this vision, and want to work alongside us as we make it a reality.”Groundswell’s platform was formally announced in September 2021 following six months of behind the scenes development in partnership with Human Ventures. Numerous corporations are lined up to launch Groundswell in Q1 of 2022. Groundswell will use the financing to add additional engineers and product staff while laying the groundwork for an aggressive go-to-market strategy.“Groundswell emerges at a time when a rising generation of workers want their employers both to care about social responsibility and enable action on causes that matter to them,” said M.G. Siegler, General Partner at GV. “CEO Jake Wood is a top-class entrepreneur with a strong background in execution and logistics needed to make the Groundswell vision a reality. We’re thrilled to partner with Jake and the entire team as they reimagine philanthropic giving.\"For more information about Groundswell, please visit https://www.groundswell.io/.AboutGroundswell democratizes philanthropic giving. It makes charity an employee benefit that unlocks a company’s purpose by decentralizing corporate philanthropy, giving employees the power of a personal foundation in the palm of their hand. The company’s vision is to build a platform that gets every solution funded and every problem solved."}
{"text": "Cycode Raises $56M Series B Round to Secure Software Supply Chains. SAN FRANCISCO--(BUSINESS WIRE)--Cycode, the leader in software supply chain security, today announced a $56M Series B round led by New York-based global private equity and venture capital firm, Insight Partners. YL Ventures, a global VC firm specializing in Israeli cybersecurity investments, who led Cycode’s seed investment, also participated in the round. The funding, one of the largest Series B rounds ever in Application Security (AppSec), comes on the heels of Cycode’s $20 million Series A funding in May of 2021. This round brings the total investment to $81 million.Cycode has capitalized on the convergence of several technology trends to achieve explosive growth. Since it first began selling in 2020, the company has acquired dozens of customers, ranging from large Fortune 500 enterprises to rapidly growing startups. Moreover, in just the first three quarters of 2021 Cycode increased ARR 7x.As software engineering and DevOps teams have adopted new tools, the tools themselves have become attack surfaces. While, in previous eras AppSec teams secured development tools, today, they are rarely responsible for doing so. In a survey of 176 technology executives, fewer than 22% of organizations have AppSec teams responsible for securing these key development tools and processes.Which team is responsible for securing the following development tools?:Source Control Management (e.g. GitHub) = 21% AppSecBuild Tools (e.g. Jenkins) = 16% AppSecInfrastructure-as-Code (e.g. Kubernetes) = 13% AppSecContainers (e.g. Docker) = 12% AppSecCloud providers (e.g. AWS) = 21% AppSecWhile DevOps automation drives efficiency in the software development life cycle (SDLC), the interconnectedness also facilitates lateral movement between tools, systems, and resources across the software supply chain.Source control management systems (SCM) are becoming the hub of many organizations’ SDLC. “In order to truly shift left, security teams need to put as much emphasis on securing the development environment as they do production,” said Kevin Paige, CISO at Flexport. “From the SCM, attackers have access to source code, they can modify CI/CD settings, tamper with code, steal credentials, provision vulnerable cloud infrastructure, and more.”The frequency and severity of software supply chain attacks are increasing significantly. According to the European Union Agency for Cybersecurity, supply chain attacks are expected to increase 400% from 2020 to 2021. Furthermore, Gartner predicts by 2025, 45% of organizations worldwide will have experienced attacks on their software supply chains, a three-fold increase from 2021.Cycode addresses software supply chain security with a platform that provides visibility, security, and integrity across all phases of the SDLC. Through integrations with DevOps tools and infrastructure, Cycode hardens security postures and implements consistent governance policies. Risk of software supply chain breach is further reduced by scanning for hardcoded secrets, infrastructure as code misconfigurations, code leaks, improper access, and more. Cycode’s knowledge graph then creates a comprehensive mapping of the software supply chain—including security violations, user activity, and other events across the SDLC—to prioritize risk, find anomalies, and prevent code tampering.“While development tools have never been more integrated, prior to Cycode, relevant DevOps security data remained siloed and inaccessible to most AppSec teams. The increasing complexity and interconnectedness of the modern SDLC means that we can no longer ignore seemingly innocuous data as harmless,” said James Robinson, Deputy CISO at Netskope. “Security teams need tools that plug in to their processes and understand how events and user behaviors relate to each other across each phase of the SDLC. Cycode’s knowledge graph delivers contextual insight to prioritize risk and gets more powerful with each new tool we plug into it.”Equally important to solving real customer pain points has been Cycode’s ease-of-deployment and rapid time-to-value. Fewer and fewer organizations have tolerance for long deployments with heavy professional services build-outs. In sharp contrast, Cycode typically installs in minutes and delivers immediate visibility across customers’ entire SDLC.“Cycode’s pre-built network of integrations made onboarding a snap,” said Joshua Danielson, CISO of Copart. “It’s rare for an enterprise of our size to onboard new vendors quickly and seamlessly. However, Cycode flawlessly connected to all of our key tools and delivered immediate value.”“Simply put, software supply chains are highly vulnerable, absent, thoughtful security measures,” said Jon Rosenbaum, principal at Insight Partners. “Cycode’s leadership in securing DevOps pipelines meets developers where they are while giving CISOs peace of mind. There has been a continually increasing demand for Cycode’s solutions, and we’re excited to continue to support the business as it doubles down on R&D and go-to-market efforts into the ScaleUp phase of growth.”Cycode intends to use the funds to fuel sales growth and accelerate development of its product roadmap. Cycode is expanding its go-to-market capabilities by building a partner-friendly ecosystem of both channel and technology alliances. Engineering will focus on expanding Cycode’s pre-built integration network to include 3rd party security tools, deepening user behavior analytics and anomaly detection capabilities and continuing to enhance its knowledge graph to enable deep investigation of breach paths through an interactive link analysis-based interface.“The key to modern AppSec is centralizing and mapping events and metadata across the SDLC such that it becomes easy to determine when disparate activities add meaningful context to each other,” said Lior Levy, co-founder & CEO of Cycode. “With each new integration, our knowledge graph becomes smarter. Hence, one of our goals is to integrate with every software delivery and AppSec tool to determine how each dot is connected and when it’s relevant.”“What’s so exciting about this company is the comprehensiveness of its vision for SDLC security,” said John Brennan, Partner at YL Ventures. “From day one, Cycode’s approach has supported a vision that surpasses anything that currently exists in the space, making it one of the fastest growing AppSec companies in the industry. This is the kind of platform solution that CISOs envision when aiming to solve big problems with robust solutions.”About CycodeCycode is a complete software supply chain security solution that provides visibility, security, and integrity across all phases of the SDLC. Cycode integrates with DevOps tools and infrastructure providers, hardens their security postures by implementing consistent governance, and reduces the risk of breaches with a series of scanning engines that look for issues like hardcoded secrets, infrastructure as code misconfigurations, code leaks and more. Cycode’s knowledge graph tracks code integrity, user activity, and events across the SDLC to prioritize risk, find anomalies, and prevent code tampering.About Insight PartnersInsight Partners is a leading global venture capital and private equity firm investing in high-growth technology and software ScaleUp companies that are driving transformative change in their industries. Founded in 1995, Insight Partners has invested in more than 400 companies worldwide and has raised through a series of funds more than $30 billion in capital commitments. Insight’s mission is to find, fund, and work successfully with visionary executives, providing them with practical, hands-on software expertise to foster long-term success. Across its people and its portfolio, Insight encourages a culture around a belief that ScaleUp companies and growth create opportunity for all. For more information on Insight and all its investments, visit insightpartners.com or follow us on Twitter @insightpartners.​​About YL VenturesYL Ventures funds and supports brilliant Israeli tech entrepreneurs from seed to lead. Based in Silicon Valley and Tel Aviv, YL Ventures manages over $300 million and specializes in cybersecurity. YL Ventures accelerates the evolution of portfolio companies via strategic advice and U.S.-based operational execution, leveraging a powerful network of Chief Information Security Officers and global industry leaders. The firm’s track record includes investment in Israeli cybersecurity unicorns Axonius and Orca Security, as well as successful, high-profile portfolio company acquisitions by major corporations including Palo Alto Networks, Microsoft, CA and Proofpoint. For more information, visit ylventures.com."}
{"text": "Alida Announces Equity Investment from BMO Capital Partners. TORONTO--(BUSINESS WIRE)--Alida, a leader in Total Experience Management (TXM), today announced that following the recent Series D funding round by Round13 Growth Fund, the company has received a subsequent equity investment by BMO Capital Partners, bringing the total investment to $23 million. This investment will accelerate Alida’s aggressive growth strategy and innovation agenda to deliver leading SaaS solutions in the Customer Experience Management (CXM) industry.“Alida is so fortunate to receive strong financial backing and trust from BMO Capital Partners,” said Ross Wainwright, CEO at Alida. “Over the past year, we have made huge strides in our innovation agenda and have seen our vision come to life. This investment strengthens Alida’s working capital position to grow key areas of our business, deliver marketing-leading solutions, and enhance the value for our current stakeholders. We are excited for the future ahead as we continue to revolutionize CXM innovation for our current and future customers.”“BMO Capital Partners is thrilled to support Alida’s continued growth both as an investor and a collaborator,” said Andrew Hockin, Managing Director, BMO Capital Partners. “Alida delivers innovative solutions to the rapidly growing global CXM market and we look forward to building on BMO’s strong relationship with the management team as they achieve the next stage of growth.”Today’s equity investment builds on the $20 million capital raise from Round13 Growth Fund in September 2021. Other recent funding initiatives include a US$10 million debt facility from Comerica Bank in July 2021, and US$20 million in growth debt from Vistara Capital Partners in 2020.About BMO Capital PartnersBMO Capital Partners is a leading provider of subordinated debt and minority equity capital in Canada, helping middle-market companies take their businesses to the next level. With $1.1 billion in committed capital and offices across Canada, BMO Capital Partners acts as a true partner, helping companies through their growth journey. For additional information, visit https://commercial.bmo.com/About Round13 GrowthRound13 Growth Fund is a Toronto-based late-stage growth equity fund that supports tech-enabled businesses in Canada. Round13 Growth leverages deep strategic relationships, capital markets expertise and growth equity investment experience to add value to its portfolio companies with a hands-on approach. Round13 Growth is part of the Round13 Capital family of funds. For additional information, visit round13.com.About AlidaAlida believes in a world where customers are the ultimate source of truth. A world where the best business decisions are those made with customers, not for them. Alida created Alida TXM (Total Experience Management) to fuse the voice of customers and employees with the ability to innovate and deliver extraordinary customer, employee, product, and brand experiences. Iconic brands like Twitter, Toyota, and J.Crew choose Alida, formerly Vision Critical, to build stronger brands, happier workplaces, winning product portfolios, and lasting customer relationships.Follow us at www.alida.com and engage with us on social media @alidaCXM."}
{"text": "123swap finance closed the seed round on $210k. VILNIUS, Lithuania, Nov. 22, 2021 /PRNewswire/ -- 123swap received funding from a number of angel investors, including Becker Venture Capital and Steven Becker, as well as other notable investors such as Polygon (Matic) Technology and other firms, VCs and others.123swap finance closed the seed round on $210kCEO and Co-Founder of 123swap Tomas Ambrazas said, \"We are really proud of what investors joined for the seed round as they saw our long-term business possibilities, etc. During this round we had many talks, with many VCs, Blockchains, Angels, and Companies. Some of them joined the private round as the seed round was closed already. I'm really proud of my team, who are working 24 hours and had integrated 9 Blockchains already and working hard to add much more. The public sale will be in December so my team can bring one of the best cross-chain bridges before that. Moreover, our investors are actively participating, advising, and bringing much-needed help to bring fuel for the 123swap launch.\" 123swap finance protocol aims to build:One window place for crypto users for easy usage of any blockchain assets. Make crypto assets work in various ways. Money should do more money. Stake, farm, mint NFT in any blockchain. To provide a seamless user experience by allowing users to access the whole crypto market in one location while never compromising the security of their private keys.What is 123swap finance platform:The 123swap protocol is a decentralized financial ecosystem that facilitates peer-to-peer crypto-asset swapping. Bridge assets, NFT swaps and many more possibilities. All without the need for an intermediary. The platform promises to simplify the crypto trading method while decreasing slippage.The 123swap platform provides a variety of DeFi options for blockchain assets across many blockchainsNFT Minting Swapping Staking Yield FarmingThe cross-chain value exchange mechanism enables platform users to conduct peer-to-peer transactions across any chain.What 123swap finance created so far:123swap finance protocol has implemented interoperability with heterogeneous chains including Ethereum, Fantom, Avalanche, Binance Smart Chain, HECO eco, OKEXChain, Moobeam, Harmony, Polygon and much more in the future like Bitcoin, Neo, Ontology, Elrond, Zilliqa, Arbitrum, Cosmos-SDK, XDAI, Optimism, Algorand, Cardano, Solana, Near and many many more. 123swap finance aggregate liquidity to allow users make swaps already.  Join us!Website — https://123swap.finance/   Twitter — https://twitter.com/123swapfinance  Telegram — https://t.me/my123swap_chat  Reddit — https://www.reddit.com/r/123swap/   Discord — https://discord.gg/arNbvrPgZxSOURCE 123swap finance"}
{"text": "Women Entrepreneurs Receive Venture Capital Funding to Address Climate Crisis . NEW YORK, Nov. 23, 2021 /PRNewswire/ -- Chloe Capital and Cornell University are helping climate tech innovators launch and advance solutions to the world's climate crisis. During the recent Diversity In ClimateTech business accelerator, five women-led climate tech companies were selected, based on their potential impact, to pitch and secure business deals.Continue ReadingDiversity in ClimateTech Founders (left to right): Madison Savilow, Lisa Altieri, SaLisa Berrien, Martha Montoya, and Dorrit LowsenThe accelerator, which convened in Ithaca, NY, was designed to connect the women entrepreneurs with investors. Over $500,000 in investments were offered by Chloe Capital to select underrepresented female founders who are projected to be leaders in the growing sustainable and clean technology industries.\"Something interesting we noticed when we were screening applicants for this program was the market trends. For one, the program applicants are raising more funds, and two, they're generating more sales,\" said Kathryn Cartini, Chloe Capital co-founder and partner. \"These metrics indicate that diverse founders in the climate tech sector are being recognized by investors as, what we like to call, 'high quality deal flow'. Out of 300+ applicants that met the program criteria, the five finalists selected were ones that showed both experience and early success in the niche market where their solution is needed,\" added Cartini.Dorrit Lowsen, Co-founder of Change Finance, a company that produces performance-oriented investment products that seek to promote a more just and sustainable world, was a recipient of a $250,000 investment.Lowsen understands first-hand the pressure to quickly address climate and clean energy technologies as she was a member of the domestic energy and environmental policy committee in Beijing during the preparation for the Paris Climate Agreement. Lowsen shared, \"We believe investing for good can profit people, planet, and investors--and that idea permeates our culture from the rigorous, rules-based methodology that underpins our investment products, to the intentionality we bring to our shareholder advocacy.\"Additionally, SaLisa Berrien, Founder and CEO, COI Energy was recognized with a $200,000 investment. Berrien has more than two decades of energy experience focused on energy efficiency, smart grid optimization, and big data analytics. She describes herself as, \"a climate tech professional that is passionate about leaving the space she occupies better than she found it.\" Berrien explains that, \"COI Energy is changing the face of energy with its digital energy management that detects and eliminates energy waste in buildings and repurposes that waste for good. We use machine learning and artificial intelligence to predict energy behaviors and make corrections to avoid waste.\"Diversity In ClimateTech launched in early 2021, recruits, educates, inspires and supports the growth of companies led by Black, Indigenous, and People of Color (BIPOC) and women founders on the forefront of climate tech innovation. Founders with innovations that reduce greenhouse gas emissions, support the decarbonization of the economy, and broadly reduce energy consumption were recruited to participate in the accelerator.\"Through the Diversity in ClimateTech program, together, we aim to help create a more diverse and inclusive environment for women founders who are changing the world through climate tech,\" said Elisa Miller-Out, Chloe Capital co-founder and managing partner.Chloe Capital and Cornell University manage the Diversity in ClimateTech program with support from New York State Energy Research and Development Authority (NYSERDA). Through this partnership, founders at the idea or pre-seed stage also receive support for their companies and are provided with an array of resources in New York's clean energy ecosystem within the Southern Tier, to help them progress.\"The Diversity in ClimateTech business accelerator and fundraising program is helping to fuel the continued growth of the climatetech industry in New York's Southern Tier,\" said Katie MacDonald, NYSERDA's Director, Technology to Market. \"Congratulations to all of these companies that are bringing diverse entrepreneurial ideas to the region, where they can take advantage of New York State's unmatched clean energy assets and infrastructure.\"Media Contact:Kathryn CartiniPartner, Chloe Capital[email protected]978-225-3288About Chloe CapitalChloe Capital is a venture capital firm that invests in women-led technology companies. In addition to investing with a gender and diversity lens, Chloe Capital partners with universities, foundations and corporations to host programs that help catalyze fundraising efforts for underrepresented founders. This collaborative approach to early stage investing is what makes the firm so unique. More than 15,000 people around the world have already joined Chloe Capital's Movement to #InvestInWomen. ChloeCapital.com About Cornell's Center for Regional Economic AdvancementCornell's Center for Regional Economic Advancement (CREA) fuels economic growth and diversity in Upstate New York through entrepreneurship and innovation. CREA is focused on making a measurable impact by supporting and managing a portfolio of over a dozen programs, including Rev: Ithaca Startup Works, Rev's Hardware Accelerators, Grow-NY, UNY I-Corps, Cleantech Hardware Scaleup, and many Cornell-facing startup accelerators and fellowships. CREA.Cornell.eduSOURCE Chloe Capital"}
